[
  "This video explores the probability of touch across various deltas. Probability of touch is the chance that the option touches the strike price before expiration, which is roughly two times the Delta.",
  "Delta is two times, but we are focusing on the probability of a touch for calls and puts in Bull markets. Calls are touched more frequently than puts. Realized probabilities of touching strikes in short option strategies are lower than theoretical probabilities, especially when exiting positions at 21 days.",
  "In the past, we looked at 20 Delta options. The theoretical chance of a 20 Delta option touching puts and calls is two times the Delta, so the Delta is 20. The theoretical chance of touching is 40 on the calls and 40 on the puts. In the last 10 years, due to being in a bull market, the puts only have a 20% chance of touching, compared to the calls at 40%. However, if you manage early on both sides where you think the theoretical is 40%, it's actually only 10%.",
  "Theoretical probability is 40%, but in reality it's only 10-14%. Managing early is key. To understand effectiveness, compare realized probability touch of 21 days to Delta (half of theoretical probability touch). For options with Delta of 20, ratio is about 3 on average.",
  "The average ratio is about 3, making it cool that the probability of a touch happening is less than a third of the time. The theoretical ratio is 40%, but in reality, it's only 11 to 14. This means there is no edge in trading, but there are mechanical factors to consider.",
  "can also consider other factors such as implied volatility and time decay to make more informed trading decisions.",
  "We analyzed SPY out-of-the-money puts and calls with Deltas ranging from 10 to 45. All options were initiated 45 days and exited 21 days later. The probability of touch at expiration for all Deltas was lower than the theoretical values of two times the Delta. Let's look at the put side first.",
  "When positions are managed at 21 days, results improve significantly across all Deltas. The specific Delta used doesn't matter. The probability of a touch at 21 days divided by the Delta is consistently below expectations. We focus on options within 40 and 45 days.",
  "Looking at 40 and 45 day options, focusing on further out of the money options. At the money options have a 99% chance of touching. Selling a 50 Delta option will likely result in a 100% hit. P&L is typically zero or negative when putting on a position.",
  "Zero or negative a few pennies per contract is rarely the case for out-of-the-money options. This study focuses on the value of exiting positions early for out-of-the-money options. A graph illustrates the improvement that exiting early can bring to a short put strategy. The trend shows that the gap between theoretical and realized profit narrows as the Delta increases, indicating higher risk.",
  "The Delta increases with larger Delta options, indicating higher risk. In the 15-25 range, you can see the actual vs. theoretical values at expiration and when managed early. The call side is higher than puts but surprisingly low when managed early.",
  "Results show that Deltas of 10, 15, 20, and 25 have a low probability of touch at 21 days to expiration, ranging from 3% to 24%. Higher Deltas are less effective, while lower Deltas are more effective.",
  "To see their effectiveness, compare the green to the theoretical and actual results. Managing trades early is crucial. Remember, it's better to manage early and see positive outcomes. Putting on trades and managing early have helped flatten my P&L.",
  "Index options puts have a lower actual probability to touch than calls across all Deltas. Managing positions at 21dt significantly reduces the chances of being tested at strikes. On average, the realized probability to touch on the put side is slightly smaller than calls.",
  "The Delta on the put side is slightly smaller than on the call side. The difference between put and call sides becomes marginal when positions are managed."
]