[
  "was driving for Uber after being laid off, but now I trade full-time. I focus on zero DT options and have seen success, with profits reaching 1.5 million over two years. I start by testing, trading, and tracking, staying curious. The key moment for me was when I realized the importance of timing, particularly at 9:32 during the opening price Discovery.",
  "focused on trading credit spreads. And then number two, we're going to talk about a specific strategy that he uses to trade credit spreads. So, without further ado, let's jump into it.",
  "full-time transition to trading and how did you adapt tasty trade mechanics to zero DTE trading?",
  "I made my first trade in 2017 or 2018 after reading Warren Buffett's work. My dad had been trading options for three years and introduced me to covered calls. I started playing around with them on Facebook and became interested in the financial markets. It was a strong market with low volatility at that time.",
  "Market was strong, and anything bought went up. Calls were sold against positions. Starting out, I worked in construction as a superintendent, overseeing projects in various industries such as drug manufacturing and hospital construction.",
  "I quickly realized that my undergraduate degree in construction was not as safe as I had thought. I was doing what everyone else was doing and was affected by the upward drift.",
  "I was affected by the upward drift in financial markets, leading me to listen to podcasts during my commute. It's funny how people turn to trading for a sense of control, especially after feeling disenchantment post-school.",
  "lost control of everything and don't control my own destiny anymore. This gives me some control back. Ways to extract Azure, why it's present, and data that backs that. Construction drawing, structurally sound.",
  "When we follow a structured approach, we get the desired output. Understanding the details and concepts is key to mastering trading. Simplifying while deepening understanding is crucial. Finance, specifically quantitative finance, resonates with me.",
  "Quantitative finance came naturally to me. Understanding the quality of assumptions is key. Tracking inputs and outputs, testing trades, and staying curious are essential for success in trading.",
  "Finding a trading strategy that fits you and optimizing it for conviction rather than just return is key. When starting out in trading, balance your job with investing on the side.",
  "I was balancing a full-time job in construction with trading on the side. Trying to put in 10-15 hours a week trading while working 60 hours a week was challenging. It was difficult to find time for everything. I managed to get through it, but it was tough.",
  "I had taken some positions off after getting laid off from my construction job working on skyscrapers. I decided to prioritize trading and take control of my destiny. I went all in on trading, making it my top priority.",
  "Trading became my top priority, with my job taking a back seat. It clicked for me that taking a chance was worth it. There was no risk in trying, as the worst-case scenario was starting over. The potential upside was worth the risk.",
  "Maybe my timing is perfect as I enter the trading space. They need strategic 25 and 26-year-olds who understand a different road through finance. Compound interest is about making money, but there's also compound knowledge to consider. Starting young can lead to significant growth.",
  "Starting something early can lead to exponential returns over time. Longevity is key in trading, as seen with Warren Buffett's success after 50 years of experience. It's important to play the long game and focus on continuous learning.",
  "At 25 or 26, it's difficult to think about longevity when you want instant gratification. By this age, you may have made some money, perhaps a couple hundred thousand through real estate or savings.",
  "When deciding to become a full-time trader in your early 20s, you commit fully to the endeavor. How did you start figuring out how to make it work and succeed?",
  "I learned how to trade by following the principle of \"proximity is power\" and modeling successful traders. I consumed as much information as possible, including watching your show. The first back test I saw confirmed that I could make money by following certain strategies. Even when I experienced drawdowns, it matched the back test results, which gave me confidence in my trading approach.",
  "It matched the back test, so I started focusing on the quantitative and numbers part to enable compounding while limiting drawdowns. I aim to be locally concave for income and globally convex to limit drawdowns. What was your worst drawdown? You have two full years of extraordinary returns under your belt.",
  "I experienced a 20% drawdown during the Russian invasion of Ukraine while running a 90-day gold TLT S&P structure. Apart from that, my largest drawdown has been 8%. Overall, it has been a good quarter.",
  "Given some of the returns, a 20% loss during a single event when starting out may seem small. It's important to view ourselves as Risk Managers first and capital allocators second. The Russian invasion of Ukraine has impacted trading.",
  "I used to trade a variety of products in Ukraine, but now I focus mainly on trading the S&P. The S&P is accurately priced with low friction costs for entering and exiting positions. It is cash settled with no risk assignment and offers high liquidity.",
  "What do you think is the bid-ask differential of the SPX? I would quantify it as the price to cross it from a buyer to meet a seller. The liquidity of the SPX is generally good, with a narrow spread and low fees and commissions. It is a good avenue for a pure short-term perspective.",
  "buyer meets seller. Entry and exit percentages are around 2%. Stop percentage is also about 2% of the premium. Options trading with a Delta of 7-20.",
  "towards the lower end of that range, around $1 to $3 for each side. It ultimately depends on volatility and the duration of the trade.",
  "On each side, I lean more towards credit selling and hold longer dated calls as a buffer. We are always skewed in the SPX due to wing price. If you collect a dollar on each side, your volatility risk is reduced.",
  "When trading, aim for a 2% gain to enter a position. Exiting may require a 4% gain, potentially up to 10% in high volatility. With enough trades, this strategy should be profitable.",
  "Yes, I mostly let trades expire to gain 2% Alpha. If a position is close to the money and my risk is threatened, I will close it at a predetermined risk ratio.",
  "When trading options, it's important to consider the potential Delta risk. Managing risk involves limiting degradation while capturing premium and using risk management to shape the distribution.",
  "Are you only using SPX options for hedging, or are you using other instruments like ES, Minis, micros, or Spy?",
  "STX is the ultimate one trick pony when it comes to hedging. Many people hedge after they are already in a position, but I always buy a hedge at the same time I sell a credit spread to offset my exposure systematically.",
  "When you trade a credit spread, you are essentially trading a synthetically naked option for capital and risk management reasons. The money involved is essentially a give up.",
  "I focus on finding the cheapest option within reason, typically aiming for a 99% discount when going for options around $200. I usually start legging into longer duration options about a week out and hold them until one day before expiration.",
  "I hold long options up to one day before expiration to capitalize on large market moves and offset risk in my portfolio. Holding them to expiration offers margining benefits and helps offset some risk.",
  "Margining and diversity of risk are important factors to consider when looking at sources of profit in trading. Credit spreads can provide uncorrelated opportunities, with vertical spreads being a common choice. Horizontal spreads and other strategies can also be utilized for different market conditions.",
  "Do you trade horizontal calendarized structures for an edge? Do you set up positions before the market opens or within the first half hour?",
  "Tomorrow morning, I will have 7 SP 500 E-mini futures contracts and 4 ES 32 futures contracts. I will also add one more contract in the afternoon. Trading will start at 9:32 AM when the February opening price is set. I will trade every two minutes until the market closes at 3:50 PM.",
  "I manage each side individually but put on trades concurrently. This results in 15-20 positions, depending on the trend. This strategy works because the positions are spread out and average in volatility throughout the day.",
  "Volatility can vary throughout the day, with fluctuations occurring in both expanding and contracting market states. The market may remain unchanged while the VIX increases, or the market may experience significant movements with the VIX going up or down. These occurrences can be unpredictable and result in large price swings.",
  "Large moves at the end of the day are common. If we rip off at 10 a.m. from a data announcement, a move twice the standard deviation could be completely fine. 100% of trades come off at the end of the day. Credit spreads are in cash, and I am always long the Tails, G, VGA, and Delta.",
  "long Tails, G, VGA, and Delta every day at 4pm with 99% of my account in cash. It's interesting to take positions home and start fresh the next day without buying wings again. When I committed to full-time trading, I started with a couple hundred thousand.",
  "started with a couple hundred thousand and now have 1.5 million in profits. I added a little capital from real estate investments, but most of it is from profits. I am not surprised by my success.",
  "Are you able to trade well in the zero day tener? The benefits include compounding and lack of correlation. Selling zeros on days when the market is tanking can be profitable due to high demand.",
  "It typically takes days to sell zeros due to high demand for volatility. This lack of relation to other events is beneficial for not holding positions overnight. The consistency of daily trading leads to smoother performance over time, but there is statistically less edge compared to longer-term strategies.",
  "Edge in trading is significantly reduced, making it difficult to master a zero-sum game where someone has to win mathematically. It's not as easy as it may seem.",
  "Trading is not easy, and many have tried and failed. Only a small percentage of people reach a level where they can risk a significant amount daily. It is not for the faint of heart.",
  "Trading is not for the faint of heart. It requires dedication and commitment, similar to starting and running a business. As a part-time self-directed investor, you are leveraging your assets just like owning a business.",
  "When trading, leverage your cash assets strategically. Avoid making impulsive decisions that may lead to large losses. It's important to adjust your position size based on your trading performance to minimize drawdowns.",
  "I aim to avoid drawdowns and minimize volatility taxes when exiting trades. I focus on executing my trading strategy without emotional responses, using grayscale screens to stay objective. I prioritize backtesting and creating consistent trading occurrences. Trading is a blend of art and math.",
  "Trading is an art, but math is an exact science. In 2022, I got laid off and started trading full-time. Have you heard of zero DT options?",
  "talking about is in the trading context?",
  "How scalable do you think your trading strategy is in the financial world? Research suggests that with credit spread trades in zero DT, you could potentially be about 5% of the open interest and still be competitive.",
  "Most traders aim to have at least 5% of the open interest for scalability. Using longer-dated options can provide protection in case of unexpected market movements, making stop losses less necessary. Holding positions overnight can be advantageous, as gaps in the market can work in your favor.",
  "If you're trading one DT short with zero DTE wings during the day, it's best to close them at the end of the day. A massive move on a zero DTE option will result in it going in the money faster than a one DT option. It's important to consider this when managing your trades.",
  "To trade effectively, you need to have a longer duration. It's not worth it to have naked options on an expensive index like the S&P 500. The high prices of options in the S&P 500 are justified by their stability.",
  "Can you scale this product beyond the S&P 500? I believe it can be applied to other products like Gold, crude oil, and ZN.",
  "Cash settlement is a common practice in the commodity world. The advantage of cash settlement is that it provides liquidity, especially in the case of quarterly expirations. Futures contracts are settled into cash, which is beneficial for businesses trading in the SPX index. Other big indexes may offer cash settlement, but they may not have the same level of liquidity.",
  "I don't think they have the liquidity you need for the SPX. It's best to stick with it. 20 years ago, this wasn't possible. Do you ever adjust your verticals by lifting a leg?",
  "The reason for having both the put and call side on is to avoid needing additional capital. The goal is to collect additional credits. Typically, trades are done as spreads. Managing a condor trade involves adjusting the short leg when necessary, while keeping the long leg in place.",
  "the short leg keeps the long leg in place. Spreads width doesn't matter. Making 100-200 trades a day for 250 days a year.",
  "If you take days off when the Federal Reserve makes announcements, there is a lot of price discovery happening. It may be best to trade between 9:30 and 9:31 as the market settles. Slippage is typically higher during these times. Overall, there is a negative expected return on trading during Fed announcement days.",
  "trading experience into a much shorter timeframe by making between 25,000 and 50,000 trades a year. This accelerated learning curve has allowed you to achieve significant success in a relatively short period of time.",
  "trading experience can be condensed from 25-50 years into 18-24 months. During this time, traders start to recognize patterns and their decision-making accelerates. The learning curve speeds up with more practice, leading to faster and more confident decision-making.",
  "I come back to the conviction of your decision-making and confidence based on your learnings. Every decision is yours alone, even when the market wins. This discussion was fascinating and fun.",
  "I think Tasty Nation will enjoy this. Thanks for coming to Chicago and sharing your story. Keep it going, Tom."
]