[
  "This feature on Tastytrade.com is exciting. Check it out on the website to see more.",
  "To access our new back testing application, log into the web-based platform at tastytrade.com. Input your username and password as you normally would. Watch the animated video for a quick explanation of how the application works.",
  "I will have already input my positions on the website. I can click on back testing to access it. When I log in, I will see a dashboard where I can navigate to the trading section and then to back testing.",
  "your positions from the desktop version on the web-based platform, even if you are overseas or without internet access.",
  "When you log in for the first time, you will encounter some compliance information. After accepting, you can access the back testing feature to analyze historical performance of a position. Simply input the symbol you want to analyze.",
  "I will select the symbol \"SPY\" from the list of 50 stocks we currently have. We plan to add 200 more stocks in a couple of weeks. The current stocks are chosen based on liquidity. You can also choose the interval for trading.",
  "Choose a short time span for the interval, such as 2013 to present. Consider different scenarios like the energy sector collapse (2014-2016), post-pandemic surge (2020-2021), or tech sector mania (2020-2021).",
  "The tech sector mania of 2020 to 2021 offers various trading scenarios. You can choose different trades, such as backtesting a short strangle strategy over the past three years. Simply click on short strangle to see how well it has worked.",
  "we can create our own strategy by choosing strikes based on Deltas. For example, selecting a strike with a 30 Delta. This makes it easier to adjust to changing stock prices, like how SPY went from a $300 stock to $550.",
  "Stock Spy is now a $550 stock, so we are choosing Deltas for trading. You can select your expiration date, typically set at 45 days but adjustable to 30 days or other options. You have flexibility in choosing entry and exit conditions using the same tool in our research.",
  "In our research studies, we use a tool that allows you to replicate our past 10 years of trading. You have two options for entry conditions: use the exact days to expiration (DTE) or choose the closest available option. For example, if looking at SPY options with 45 days to expiration, you can select the option with 45 or 46 days till expiration.",
  "One trade at 46 days till expiration was identified yesterday. Another trade at 67 days till expiration and one at 39 days till expiration were also found. Today, at 45 days till expiration, the decision was made to use exact DT. By unclicking a certain option, more observations can be obtained. This would involve making trades every single day.",
  "you can analyze the performance of different trading strategies by backtesting them over a specific time period. This allows you to see which strategies have been the most successful and make informed decisions about your trades.",
  "From October 11th, 2021 to October 10th, 2024, we will only have one trade open at a time. When a trade closes, we will open a new one. Additionally, we can create a new trade every 45 days.",
  "Exit conditions for the short strangle strategy can be kept at default settings. The orange line represents the profit and loss for the strategy, which involves selling a put and call at 30 Delta with 45 days till expiration.",
  "Delta 45 days till expiration has shown a profit over the past three years. Making adjustments to improve this strategy is important. Paper trading allows for instant results to see how well a strategy has performed over time.",
  "The Buy and Hold strategy underperformed but would have held up the money. The average profit and loss, Max drawdown, and return on Capital used can be seen. Details show 55% of the trades were not great.",
  "55% of the trades were profitable, with 18 trades in total - 10 were profitable and 8 had losses. The average return per trade, average premium collected over the past three years, premium capture rate, and fees of $111 are all displayed. Logs are also available for further analysis.",
  "Looking at the trading logs, you can see the fees breakdown. For example, for one trade, you may have OCC fees, clearing fees, and other charges depending on the number of contracts traded. It's important to track these fees over a three-year period for a clear understanding of your trading costs.",
  "Throughout the three-year period, trades were made every 45 days. On October 12, 2021, the first trade was closed due to exercise.",
  "We closed out a profitable position that expired. We experienced a loss of 36% on another trade. Fees and premiums are listed below. Transaction time was at 2:45, the most liquid part of the day.",
  "At 2:45, we focus on the bid-offer spread for trading. The first trade was done at 993 credit and closed at a debit. You can view all orders and transactions on the page and download them for detailed analysis.",
  "You can input detailed data into an Excel spreadsheet for further analysis, including overlaying it with technical analysis. This allows you to track specific criteria such as stock hitting a certain number, implementing a strategy, or monitoring percentage moves in a day.",
  "This tool displays daily settlement data for the past three years, showing the profit and loss for each day. It indicates that 4% of the total has been completed. Users can access data for thousands of other days within the test. Making modifications to a specific trade can be done easily.",
  "When trading, it is recommended to exit at around 21 days till expiration to manage gamma risk and Theta Decay effectively. This is based on historical data showing increased risk as expiration approaches.",
  "We can manage trades by setting specific profit levels, adding stop losses, or exiting after a certain number of days. The system calculates profits at 2:45 pm.",
  "On the close, it's trading at 245, the most liquid part of the day. We can run a backtest with adjustments to see how well it managed. Results may vary based on expectations. There may be a feature that was mentioned that could be helpful.",
  "If you're unsure about when to close an order and open a new one based on certain parameters, you can continuously implement this strategy by managing your trades at specific percentage levels. You can put on a new trade at the exact moment when the conditions are right, using either new strikes with the same Delta or going out to a different expiration month.",
  "If you believe the Russell is going to experience a significant increase, consider adjusting your trading strategy to capitalize on potential gains. Instead of just looking at a strangle over 45 days, you can get more intricate with your approach.",
  "can analyze past performance of a particular trading strategy in different market scenarios to make informed decisions about potential future outcomes.",
  "This strategy limits trades to five to manage limited funds. It outperformed a buy and hold approach in testing.",
  "Buy and Hold would have lost money during a market decrease. If you anticipate a decline, consider selling a call instead of a strangle. Evaluate the effectiveness of this strategy in a declining market and make necessary adjustments to maximize profit and minimize loss.",
  "This is the most advanced free back testing platform available. It provides almost instantaneous results and utilizes the newest technology. It is free with a signed account."
]