[
  "After earnings, stocks typically trend sideways or higher, especially if the earnings report is in line with expectations. This is often the case when the market is at all-time highs.",
  "If a stock has a strong or weak earnings report, the market may continue to trend in that direction or normalize within 45 days of the trade. It is mostly random immediately following.",
  "publicly traded companies release quarterly earnings reports detailing their financial performance. These reports can cause dramatic overnight moves in the market as they are released either before the market opens or after it closes.",
  "Earnings releases often lead to dramatic changes in implied volatility. It is important to understand how underlyings behave in the weeks following an earnings report. Retail traders should consider this when making trading decisions.",
  "We conducted a study on earnings announcements of the 15 largest components of the S&P 500 over the past eight years. We analyzed the overnight, 7-day, and 30-day moves following each announcement.",
  "The relationship between the size of earnings moves and the following moves can be measured on a scale from -1 to +1. This indicates how often the following move is in the same direction as the earnings move, known as continuation. The average size of the seven and 30 day moves is calculated as the mean absolute. By comparing the statistics of earnings moves that exceeded the implied move to those that did not, we can see the overall contrast. Note that these earnings moves are temporary.",
  "Earnings moves stayed inside expected 48% of the time, below theoretical or empirical non-earnings frequencies. Next slide: correlation, continuation, mean absolute move. Top 15 stocks over eight years.",
  "This is the top 15 stocks over eight years in the S&P 500. When looking at the size correlation and continuation, it is evident that these moves tend to be greater than expected, especially around earnings. The mean absolute move and continuation numbers are higher than random numbers.",
  "The size correlation is interesting. After seven days, there is some correlation, but it decreases after 30 days. The continuation of the move is still good. Earnings inside the expected move result in lower correlation and continuation. The mean absolute move after 7 days is smaller.",
  "When earnings are inside the expected move, there is not much to consider for a continuation. However, when earnings are outside of the expected move, everything changes.",
  "In trading, changes in size correlation, continuation numbers, and mean absolute move are important factors to consider. After earnings reports, there is often a high continuation move outside of the expected range. For example, if there is a negative earnings report, the stock tends to continue to decrease in value over the following days.",
  "lower after seven days and seven out of 10 times after 30 days. This stock is in the top 15 of the S&P 500. The mean absolute move is usually greater than expected, so being aggressive is necessary, especially when rolling up the untested side.",
  "This slide shows a powerful tool for analyzing stock movements during earnings season. If a stock moves beyond the expected range after earnings, investors often wait a few days to see if it will correlate with the overall market or rebound.",
  "Being aggressive with rolling is my biggest takeaway. Earnings moves exceeded expectations, with the underlying performing well afterwards.",
  "is important to be aware of the typical market behavior following earnings in order to make informed trading decisions.",
  "research is crucial in determining the best trading strategy. It is important to consider how market trends will affect your decision-making process."
]