[
  "The zero DT iron Condors offer wide wings for trading SPX. Time is not factored into the F minimums, which benefits customers but not broker firms. It is strange that SPX does not offer the benefit of duration for traders.",
  "Short positions on naked Z DT trades are untradeable for most accounts due to the high risk involved. To reduce the risk, buying wings is necessary to bring the potential loss down to a more manageable level. Using low-cost out-of-the-money long options can help in playing Zero DT trades effectively.",
  "We started the day with a set buying power and were unsure how much we would spend on wings. The question is, what is the cut off for a synthetic strangle versus an iron Condor in the SPX? We initially thought it would be 30 points, but after today's research, we will reveal the answer.",
  "Today's research shows that the trading range is around 50 points. For SPY, it's within 5 points, for Q's it's within 5 points, for IWM it's within 5 points, and for SPX it's within 50 points. A range of 50 points or less is like an iron condor, while a range of over 50 points, specifically 60 to 90 points, is like a synthetic strangle. Let's move on to the next slide.",
  "On the next slide, the put side will be shorter or tighter than the call side. An equal call will be cheaper than an equal distance put. In zero days, two years of data show 20, 30, 40 Delta strangles with fixed strikes ranging from 30 to 100.",
  "Fixed strikes range from 30 to 100 wide. Consider the total cost of the wings and aim to close at 25% profit. Focus on the 20 Delta short strike for optimal results. For example, $40 wings cost $1, $50 wings cost $0.67.",
  "If you want to go wider, the price goes down to 24 cents on zero days. The average buying power ranges from 3,400 to 8,300. The wider the wings, the cheaper the cost to buy them, but the more money you have to put up to make the trade. Real protection is generally minimal.",
  "If you choose a $40 wide or $90 wide spread, you will receive the same $650. The average daily buying power is about $650, regardless of the width of the spread. A $60 wide spread protects you by 20 basis points. The average buying power is $5300 with an average cost of 50 cents.",
  "The average cost is 50 cents, regardless of the tier. It is all a matter of preference. If you only have $30 or $40 to spend, go for the cheaper wings to save money. If you have extra capital, you can opt for the more expensive wings.",
  "If you have extra capital, consider buying $90 wings for 24 cents. It can reduce the amount of money you need to put up for the trade. Without the wings, you would need to put up $120,000, but with the wings, it's only $3,400 to $8,000.",
  "If you choose the 30 Delta strike, you will pay more for the wings but put up less money. This may help you more in certain situations.",
  "These numbers are all the same. 133% of the time, it could come into play when doing the 40 Delta strangle. The problem with the 40 Delta strangle is that some traders prefer smaller numbers like 20s over 30s or 40s. It's a matter of personal preference.",
  "When choosing the width of your trading wings, it doesn't matter if you go $30 wide, $40 wide, or $50 wide. You can choose $90 if you want to put up more money or $40 if you want to put up less. It's all symmetrical and comes down to risk versus reward. Ultimately, the stock needs to cooperate with your strategy.",
  "To be successful in trading, it is essential for the stock to cooperate with your strategy. When trading zero days, consider your account size when making synthetic short options. Let's move on to the next slide.",
  "Choose your desired strike price carefully, avoiding overly tight options that may not provide added value. While naked zero DT premium can be costly in terms of buying power reduction, wide iron condors can mimic strangle behavior effectively. For example, an $80 or $90 wide iron condor can achieve similar results to a strangle strategy.",
  "For $90, a strangle behavior is essentially being executed, with a 30 cent per trade narrower than 50. This can be seen as an iron condor, with the wings providing protection from large moves. Spending less on the wings is possible when short strikes are further out of the money. Adjusting wing selection daily based on buying power commitment can impact P&L.",
  "The level of commitment affects how much profit and loss you are willing to accept. It's a strategic game of placing bets and managing capital to maximize earnings."
]