[
  "Is this the end of BPR breaking losses? Before 2020, there was never a loss on an early managed 16 Delta strangle in the Spy that exceeded the initial buying power requirement. The worst case, as a percent of initial buying power reduction before 2020, happened in 2009 with the trade's loss of 21 days to expiration closing at 56% of the initial buying power reduction in Spy.",
  "In 2020, the initial buying power reduction in SPY reached 56%, breaching the 21-day DT Mark at 1.1 times 110% of the initial buying power. This indicates a strong predictive ability for maximum risk. In 2024, markets across all assets experienced significant swings, resulting in sharp losses.",
  "trading in 2009 or 2020. The focus is on the risk of buying with BPR as the limit for losses. We analyzed SPY, QQQ, TLT, and gold since the beginning of the year, noting the worst losses in 11 months.",
  "After 11 months, we observed the worst losses for short 16 Delta strangles. We computed the magnitude of each product's loss relative to the buying power on this trade for the last year. Despite 2024 being a tough year to trade, let's take a look at the next slide.",
  "2024 was a tough year for trading, as every year presents its own challenges. Volatility can either collapse or remain too low. In my experience since 1983, there has never been an easy year.",
  "In 1985, I had a successful year trading and didn't experience any losing weeks. It was a peak year for me at 28 years old.",
  "BPR of a naked short premium trade in 2024 showed a sizable buffer against losses for each asset tested.",
  "The worst losses for each asset tested this year ranged from 9% to 24%. August 5th had the biggest loss at 16% for Del and 24% for Q's. TLT had lower losses. Year-to-date performance seems low.",
  "Throughout 2024, implied volatility across asset classes consistently ranged between 15-25%. This resulted in broad break evens for short premium positions, leading to potential extreme losses. On the morning of August 5th, there was a significant move with volatility spiking to about 45%.",
  "On the 5th, implied volatility spiked to around 45 before dropping back down to the low 30s the next day. There was a significant explosion on a Friday that reversed by Tuesday, highlighting the difficulty of timing hedges against sudden moves in the market.",
  "In trading, it's important to know when to lift your hedge. The worst loss of a short premium in 2024 was 24% of the trade's initial buying power, with the q's being the worst market. This typically happens when implied volatility is high.",
  "It is rare to see a loss exceed the buying power since break evens are very wide. The reason August 5th didn't show up is because the worst losses were observed for 45 days but managed at 21 days.",
  "On August 5th, there was a significant loss in trading. It may seem like the loss was due to selling after 45 days, but it actually happened after 21 days. There was a moment of panic on August 2nd and 5th.",
  "There was a moment of panic when the numbers were much higher, but after waiting 21 days to make the adjustment, it was nothing at all."
]