[
  "Welcome to Option Trades Today. I'm Tony the Baptist. Today's trade idea is for January 30th, 2025. The market is currently showing the Emin S&P down $7.75 and NASDAQ down $76. The S&P has had a range of over $50 today, currently down eight. Meta and Tesla earnings have had a significant impact on the market, with IBM being one of the biggest movers.",
  "One of the biggest movers of the group, up almost $30. The market was strong but has given back most of its gains. Russell is up 19 points, leading the pack. The Dow is basically unchanged, down four points. Volatility is surprising given today's movement, currently near the high of the day at 17, up only 5 cents. Keep an eye on volatility as it starts creeping up.",
  "Volatility is increasing as the S&P and NASDAQ trend downward. Bonds are up 13 ticks, with a $4,000 move since hitting lows two weeks ago. Considering a post-earnings trade after closing out a Tesla position.",
  "I closed my Tesla position today, which had been one of my largest losers in 2024. It was a big winner for about nine or 10 months last year, but I gave it all back and more in the last few months. Today, Tesla moved within the expected range, so I closed my position. Let's take a look at the March options for Tesla.",
  "In March, I had 390 puts that were down $7 while the stock was up $15. The calls I was short were only up $1. Staying mechanical and working the process paid off in the end.",
  "I am currently trying to replicate my success with Tesla by trading with Goldman Sachs. However, I am facing challenges with this trade as the Ivy rank is low at 18 and the stock has been consistently rising without any downward movement. Unlike Tesla, which had some fluctuations allowing for trading opportunities, Goldman Sachs has been steadily increasing.",
  "Goldman Sachs has experienced a strong rally. I will close my trade to cut losses due to the IV rank. Moving on to today's trade, I will focus on Tesla despite recent earnings. The IVX 5-day change is significantly lower compared to other stocks post-earnings.",
  "Chang is down by twice as much and the IV rank is 19. Tesla's Ivy rank is 41 and the IV 5day adjusted is only down five. The move in volatility was discussed when closing the trade on the show. Tesla's Ivy rank was in the 70s before earnings, dropped to the low to mid 30s after the rally, and is now back up to 41. Despite the volatility decrease post-earnings, a directional trade will be made.",
  "For volatility, I'm planning a directional omnidirectional trade in Tesla. March options with 50 days to expiration are ideal, with 45 days being optimal. I executed a 1X two put ratio spread with 15 Delta options.",
  "Rare to find high implied volatility, bought 15-day 335 puts once and sold 320 puts twice for $2.94. Checking if price is accurate on Bob the trader page. Stock price slightly lower than when trade was made.",
  "The trade has seven Deltas, so if the stock moves $2, the trade should be 6-10 cents lower, not 40 cents lower. Volatility is contracting. The puts I'm buying are down by $3, the puts I'm selling are down by $2. The spread is in by another dollar. I received $2.94 for this trade, using about $88,500.",
  "This trade requires about $88,500 in buying power. It is a $115 wide ratio spread, which is rare for a $300 stock. Your break even is $15 below the 20 strike, around 305 plus any credit received.",
  "You can potentially make $1,500 on a 320 pin with this trade. The goal is for Tesla to go up immediately. The Delta is fairly neutral at seven. The credit will contract, which is the desired outcome.",
  "buck or two loss but it's better than losing 30 some OD thousand.",
  "The margin account allows for increased buying power, with the ability to change buying power by a multiple of four or five times. This can increase buying power from $30,000 to approximately $88,000, although some credit may be sacrificed.",
  "Consider naming it a wide ratio broken wing butterfly. Tesla is rallying, and I hope you saw this trade in real-time on the follow page. I closed my other Tesla trade when it was up.",
  "I traded Tesla when it was up around $47 and got lucky with a long Delta. The puts are down $14 and calls are up. I had to stay mechanical. Marvell gave me some trouble today, had to roll up the untested side. Gold continues to rally, had to roll up the untested side. Stayed mechanical with TSM despite putting on a bullish trade.",
  "I put on a bullish trade on TSM on Tuesday, but it moved too quickly. I had to roll up the puts. I made a trade at 10 o'clock after the earnings report came out. It was slightly bullish, aiming for the stock to go higher. I used a wide put ratio spread for this trade.",
  "receiving a wide put ratio spread with a 90-87% probability of success. The trade generates $12 a day in Theta Decay. The stock is rallying, leading to a potential max profit of $1,700. Buying power is around $85. Thank you for watching and liking the podcast.",
  "Thank you for transferring your account to Tasty Trade. Your support helps us keep the lights on and Tasty Live free for all traders. Good luck with your trading endeavors."
]