[
  "Welcome to the life cycle of a trade series. Today, we will cover an iron fly trade on a high volatility underlying, such as Paler. Iron fly trades are slow-moving but can be profitable in the right market conditions.",
  "Fly is setting up nicely here. Paler stock has exploded to the upside with high implied volatility of almost 70%. Earnings expiration in February has implied volatility in the 80 handle. Stock has come down slightly, but the biggest issue is its volatility.",
  "The stock has high volatility, requiring a higher margin. Consider an iron fly strategy with a straddle at the 70 strike for a credit of over $10. Buy wings to limit buying power.",
  "To cap our buying power, we will buy 15 wide wings with a strike of 55 for the long put option and 85 for the call option. This sets up a 42% pop.",
  "Your risk profile is within the expected move, making this a lower probability trade. With a 60 IV Rank and almost 70% implied volatility, there is a lot of volatility baked into this position. If the underlying sees a five or 10 point drop in volatility, this spread would likely be profitable as long as the stock stays around the current mark.",
  "Mark is inside the expected move due to a volatility contraction. Routing at an $852 credit for a 50/50 High Vol play in Paler. Moved to 845 and filled at 856 on the iron fly. Aiming for a move between 60 and 80 over the.",
  "looking for a move between 60 and 80 over the next 37 days for this to be profitable. We've had some two-sided action with the stock going from the 70 handle up to 85 and back to 75. We've gone $5 in the money on the call side. Lots of extrinsic value in a high volatility stock like this.",
  "this trade before expiration.",
  "I have $2.50 or 60 left to make on this position if the stock stays where it is. The stock has rallied significantly in the last hour, moving from 73 to 75. Earlier, I was seeing about $120 profit, but that has eroded a bit. Still, with 15 days to go...",
  "With 15 days until expiration, the decision is whether to close the position or roll it into a further out expiration or a new position. I am choosing to close the position and take some profits. The position was losing when it reached 85, but with a pullback, it is now profitable.",
  "We had a pullback and made some profit on the position. It's time to take the profits and move on to another position. When closing out, ensure there is a bid and ask on the long options. Remove options with no value. There is value in these options, about eight or nine cents on the downside. Try to get H filled for a profit.",
  "If we can get H filled for a bit less than the mid price, we could potentially make a profit of 85 cents. The bid-ask spread is wider for in the money options, making it harder to fill at the desired price. Adjusting the price may be necessary.",
  "Adjust the price slightly above or below the mid price when buying or selling. The closing order resulted in a $881 profit after a $765 debit. The trade experienced a sideways move throughout."
]