[
  "Welcome to Option Trades Today. I have a trade idea for you on November 19th, 2024. The S&P is up $2, with a big range of 70 handles lower and 10 handles higher. We opened much lower and went lower after some numbers.",
  "The market initially dropped but has since rallied back. Nasdaq is up 44, Russell is up 50, and Dow is down $165. Volatility is up 30. The market is churning higher despite upcoming economic news.",
  "The market is trending higher, with bonds gaining some momentum. There is potential for further upside, but also reasons to consider selling if bearish. Checking the High option volume list for opportunities based on implied volatility changes.",
  "The implied volatility change of each product's individual implied volatility affects the IV rank. Higher numbers indicate a greener IV rank. By filtering out stocks with earnings, I can focus on trading opportunities based on volatility rather than premium.",
  "The stock has a high premium and low Ivy rank. It is a relatively high-priced stock at $413, making naked options expensive. A strangle strategy would require around $5,000 in buying power.",
  "$5,000 makes it more expensive. I prefer using calendar or diagonal spreads. I did this with Meta, a $550 stock. I got the move wrong initially, but after one day, I was able to profit. I am looking to make a similar trade in Microsoft today.",
  "In an IRA account, it may take $50,000 to $60,000 to trade naked options. It's advisable to stick to options with defined risk, preferably around 45 days until expiration. December options with 31 days or January options closest to 45 days could be suitable choices. Consider using both for trading strategies.",
  "In the next 45 days, I plan to do a directional trade on Microsoft, which has a high correlation to the market. Volatility has been increasing, as seen on the IV rank 5-day change. Netflix, with a 73% correlation to the market, has not been performing well. You can check correlations in the watchlist or on the platform.",
  "Check the watch list or the right-hand gutter on Tasty Trade for the correlation to the S&P 500. Microsoft has a 73 correlation. In the last four or five days, it has moved lower with the S&P 500, which is also coming off of highs.",
  "The S&P and NASDAQ have been declining from recent highs, including Microsoft. Microsoft, however, is not as affected and may be a good buy opportunity. Consider purchasing an in-the-money option in January.",
  "When buying an in the money option, look for high volume and open interest. Aim for options with a Delta around 60-70 for better fills.",
  "I'm looking to buy a 60 Delta option with 59 days until expiration. I will buy a 405 call in January and sell something in December. I want the monthly implied volatility to be no greater than two points, currently at 22%.",
  "I have a 22% implied volatility in December and 22.2% in January. I am buying a full 2% difference. For me to not make this trade, December volatility would have to be 22 and January volatility would have to be closer to 24 or 25. I prefer volatility to expand in January due to faster Theta Decay with less time for options.",
  "In December, I plan to sell an out-of-the-money option to maintain my current mechanics. Whether it's the 420, 417, or 415 option, you can create a delta or diagonal of any size. The 415 option will be cheaper than the others, with 11.5 long deltas compared to 15 long deltas.",
  "This trade has 15 long deltas at $3 and 19 long deltas at $3.20. It is a bullish strategy with a $15 wide diagonal long spread. Despite having almost 20 long deltas, I am receiving $22.76 for the $1,300 risk on this trade.",
  "My maximum risk on this trade is $1,300, which is smaller than trades with a larger delta. By trading calendars and different spreads using options, you can adjust volatilities to analyze potential outcomes.",
  "It's important to consider whether you are long or short in this trade. The lack of a pop may be due to the unpredictable volatility in December and January. Focus on the 20 Delta long position in Microsoft that has not cooperated.",
  "Looking to catch a falling knife in Microsoft with a defined risk trade. The trade has a high probability of profit, above 60, due to positive Theta Decay. Analyze the position in the analyze tab to see how it moves with volatility.",
  "If you check Bob the trader's profile on the follow page, you'll see my recent profitable trade. I entered the position on the seventh and closed it on the 11th, making almost a dollar as volatility expanded.",
  "The IVR expanded and the stock moved in the direction I anticipated, allowing me to profit on a put diagonal trade. I hope for similar cooperation from Microsoft with an $8 move. You can view my trades in real-time on the Tasty Trade platform.",
  "Consider making trades on the Tasty Trade platform after transferring funds to your account. I opened a long Delta diagonal position on a low IVR stock, anticipating volatility expansion. Earnings are scheduled for January 19th, after expiration, but we may see a boost in the days leading up to it.",
  "Two days before earnings, being long on that option. I'm Tony Batista, thank you for your support. Keep Tasty Live free for all platforms. Join us on Tasty Trade."
]