[
  "S&P and Russell are both in the green, with implied volatility overstatement and profit targets with strangles. As premium sellers, we profit through implied volatility overstatement, which we have found to be overstated 75 to 80% of the time.",
  "In this study, we will explore the effects of implied volatility on strangles, focusing on achieving quick profits. Research over 12 years has shown that profits can be achieved quickly, with varying success rates depending on the time frame.",
  "In the last 24 hours, we analyzed strangles with various Deltas at 45 days, managed at 21 DT or 50%. The trades were grouped based on implied volatilities over or under 18. The VIX is currently trading at 17.31, down 0.60.",
  "Last night's close is just under the current level. We will discuss the effect of implied volatility on strangles, the optimal number of days for maximum profit, and the impact of managing at 21 days versus 50%. How does implied volatility affect profit targets by a percentage?",
  "I believe managing a 21-day target will result in higher profits compared to a 50% target.",
  "Theoretical probability of profit for selling options is calculated by taking one minus the Delta of the option. Implied volatility has a higher effect on strangles, resulting in higher credits. Entry is the only thing you can control.",
  "If you have a strangle, the theoretical probability of profit (POP) can be calculated as 1 minus 2 times the Delta. For example, selling a 20 Delta strangle would result in a theoretical POP of 60%. However, the actual POP may be closer to 80%. The actual win rate often exceeds the theoretical POP.",
  "money that it's not going to touch it but if you look at the probability of touch it's almost twice as much as the Delta so you have to be careful with that. In high implied volatility, the return on capital was nearly double, making it important to consider when trading options.",
  "The 20 Delta options have a win rate of 76%, which is 16% higher than the theoretical rate of 60%. With high implied volatility over 18, the win rate increases to 78%.",
  "The win rate increases significantly with higher IV, resulting in a better average return on capital. With a win rate of 76 to 78 in high IV conditions, the average return on capital is 4.2%.",
  "Statistically, doubling the average return on capital is significant when trading with higher implied volatility. In high IV, more credit is collected and the P&L tends to be higher as a percentage of that credit. This results in less dramatic swings in P&L from trade to trade.",
  "Swings in P&L from trade to trade can be minimized by using further out-of-the-money strangles at a 20 Delta. P&L volatility drops to 71%, resulting in smaller volatility swings and higher P&L as a percent of the credit. This strategy maintains lower P&L volatility and higher profitability throughout the trading process.",
  "Here we analyze the average number of days until reaching maximum profit. The actual average is 17 days, with around 28% of occurrences seeing peak profits between the first and second week after trade entry.",
  "When trading stocks around earnings, it's important to note that if a trade is going to work, it typically does so within three weeks. This timeframe aligns with the general rule of thumb for trading around earnings. If you're considering a trade with a stock that has upcoming earnings, keep in mind that the trade should show signs of success within three weeks of entering the position.",
  "don't think you'll be too affected by increased volatility leading up to earnings. 68% of the most profitable days occurred before managing a 21-day moving average.",
  "16 Delta strangles have been the most profitable, with a 50% profit in 20 days. Managing at 50% profit resulted in faster profits compared to managing at 21 days.",
  "Managing at 21 days typically leads to faster profits compared to managing at 50%, with a slightly smaller P&L. Both approaches yield similar results in the end, but managing at 21 days allows for quicker profits.",
  "it's six of one, half a dozen of another. If you quickly reach a 50% gain, you may want to consider taking profits rather than letting it run for a higher gain. In terms of portfolio volatility, it's wise to take profits to manage risk.",
  "Taking profits is prudent. The median PNL rose with increasing implied volatility due to its mean-reverting nature. This is interesting as it is the 50% profit target. The days to reach this target did not decrease with higher implied volatility, likely due to the increased initial credit. This typically occurs in the 50 to 75 range, which is uncommon. The IVR range for 16 Delta strangles is usually in this range.",
  "IVR range for 16 Delta strangles is typically 25 to 50, with the second tier of 50 to 75 being rare. The trade lasts about 17 days, with a median P/L of 76 and an initial credit of 182. In high implied volatility, increasing strangle Delta can maintain win rates and double the return on capital.",
  "focus on win rates and doubling the return on capital with 20 to 30 Delta strangles. Consider the days in a trade for 16 Delta strangles, exiting at 17 days post entry for maximum profits. Early management can impact long-term profitability, but managing a 50% profit accelerates profits compared to 21dt.",
  "Lower average P&L due to increased volatility may not accelerate gains. Managing trades becomes easier after making adjustments."
]