[
  "Welcome to Option Trades Today. I'm Tony the Baptista. Trade idea for January 26th, 2024: S&P down $4, NASDAQ down 12, Russell up 13, Dow up 14. Dow and Russell showing strength today.",
  "Dow and Russell are stronger today, with Russell leading. S&P and NASDAQ are weaker. Volatility is up 30 cents after recent losses. Bonds are down nine ticks. I made a pseudo commodity trade with coin.",
  "I am considering a trade on coin. The chart shows coin down $434 with an Ivy rank of 11. I am planning to implement a premium selling strategy with a directional bias. I am looking into a diagonal trade by selling the Feb options that are two or three strikes out and buying the Feb options that are one, two, or three strikes out.",
  "I am buying January options that are one to three strikes out of the money and selling options that are two to four strikes out of the money to add some long Delta. With earnings coming up on January 29th and only 22 days until expiration, I need a quicker move to the upside. I am uncertain about the timing of this trade, so I am opting for a Delta long strategy.",
  "The Delta long strategy appears to be outside the expected move. The Ivy Rank has dropped significantly from the mid-range to 11, possibly due to skewed data from the market being closed.",
  "The Ivy ranks may appear artificially low due to the market being closed. I will be looking at the watch list on the Tasty Trade platform. Coin is down $4.75 and looks weak today. I am considering a bullish trade on Coin. Bitcoin is around $100,101.",
  "Bitcoin is up around 100,000 just last night, indicating a potential end to the rally. This could benefit other coins like Ethereum. I am considering a 1x2 put ratio spread, going $10 wide to take advantage of the volatility.",
  "The implied volatility of 83 seems high compared to other months, but earnings on January 29th may impact these options. With almost a month until expiration on February 21st, I don't expect volatility to increase significantly. I am considering selling an extra unit here.",
  "I am looking to do a 1 by 2 ratio spread with options. I will buy the 180 puts and sell two of the 170 puts. I aim to buy the 180 puts at around a 15 Delta and go further out of the money. The standard deviation line is at the 180 strike. The market for Bitcoin options is currently wide.",
  "Markets are wide with Bitcoin slightly higher. Lower prices are better. I sold for $176 credit, mid price now at $1.75. Options are wide, reference where I got filled. Small Delta.",
  "This is a small Delta trade with a 94% probability of profit. It has a positive Theta decay of 7 and A2 with four long Deltas. Consider entering the trade when the stock is around $5. Walk your order down slightly to potentially get filled at a similar price.",
  "15 to 20 Deltas, going further out of the money. Break even on trade is $160. Haven't seen $160 on chart since September, or about a year ago in February. Is it unreasonable to think coin won't go back down to $160, $90 lower than current price, despite expected move?",
  "the expiration date. The expected move is $62, but anything can happen. With $3,400 in buying power, I aim to collect $176 by capitalizing on a directional bias. I hope for the stock to rise or for volatility to decrease, causing the extra unit to decay quickly. This trade offers a chance to make $1,000, with a max profit of $1,176.",
  "I am comfortable holding this trade until February expiration and through earnings on January 29th. The trade has a 94% probability of profit and positive Theta Decay. I am disregarding the low Ivy rank due to potential data inaccuracies from the holiday week. I have adjusted the trade to reduce Delta risk and am risking $3,400 for a potentially unrealistic maximum profit.",
  "trade at the $1.76 level. If the stock continues to decrease, you may be able to profit more than initially anticipated. Keep an eye on the mid price for potential entry points. If the stock remains low after this video, I will consider placing a trade.",
  "If the stock is still down, I will add more contracts. I will update the trade on the following page for you to see in real time. Please consider transferring your account to Tasty Li tasty trade for more updates.",
  "Transfer your account to Tasty Trade to access the best content and trading opportunities. ACAT your account over to us to support our platform and enhance your trading experience on Tasty Live."
]