[
  "bit down as well. Looking at potential option trades, I'm eyeing a bullish position on XYZ stock. The technical indicators are showing a potential breakout to the upside, so I'm looking at buying call options with a strike price of $50 and an expiration date of March 1st. Keep an eye on the market conditions and consider entering this trade if the stock continues to show strength. Happy trading!",
  "NASDAQ down 50, Russell down 19, and the Dow up 28. S&P has been trading sideways for the last two weeks, with volatility at 1673, near the low end of its range. I focus on stocks with high option volume and no earnings.",
  "One stock to watch is Tesla, which has recently hit new lows. Tesla's IVX 5-day change is up 6%, with an Ivy rank of 46. Volatility has been expanding over the last five days, even on the downside. It's important to note how volatility increased as Tesla went higher from November to December, and is now increasing as Tesla goes lower.",
  "noticed that Tesla's IV Rank and volatility have been decreasing since July last year. However, there has been a recent uptick in volatility despite the stock price going lower, indicating possible capitulation. I have placed three trades in Tesla, with one already filled.",
  "I executed a one by two omnidirectional put ratio spread on Tesla. I bought one 280 put and sold two 270 puts for $237. The mid price is 2.45.",
  "At $237, Tesla's mid price is 2.45. With Tesla down 8, I was able to get filled at or one penny below mid price. There is plenty of liquidity and volume. This trade has about eight long Deltas, with a break-even below $260. Your break-even is around $257 if filled at $245.",
  "Is your break even at the end of the green line? This trade uses $7,200 in buying power with an 89% probability of profit. There is $13 a day in Theta Decay. The trade has a slight long Delta position. Tesla has dropped from $420 or $430 to $330 recently.",
  "$420 or $430 to $330 down about $100 in the last two weeks. I'll nibble on Tesla. Another trade I looked at but did not get filled on yet is a $10 wide Jade lizard. I'm going to sell one 355 call and buy the 365 call. We aim to collect around one-third.",
  "Buy the 365 call spread to create a Jade lizard strategy. Consider selling the 290 put for $10.10 or the 295 put for around $11.30.",
  "I would consider buying the 295s for around $11.30, with a 76% probability of profit. This trade uses approximately $9,200 and has 16 long Deltas. It also provides $24 in Theta Decay.",
  "The next trade I am considering is a strangle with a 270 put and 435 call options. I will look to get filled on this trade after finishing the podcast.",
  "I'm choosing the one long Delta over the one short Delta by going with the 435 calls and the 270 put trading for around $682. This trade has an 80% probability of profit and $31 in Theta Decay, with less Delta risk compared to the put ratio spread.",
  "The delta risk on the put ratio spread is present on both sides of the strangle. We are currently well outside the one standard deviation range at 435, which is near the old highs and lows. The credit received is around $6, bringing the total down to 270. The break-even point on the 1 by 2 put ratio spread is around 26.",
  "I have three trades to show you today, all in Tesla: a 1 by 2 put ratio spread. I recommend opening an account with Tasty Trade to support our free content."
]