[
  "What do you trade to get 45% annual returns? I developed a checklist that worked, but I needed to add more money to my account. It took around 6 months. Last year, I made around 2800 trades. I am not just shorting puts anymore. Welcome to the show, Chris from Dallas.",
  "Welcome to the show. Thank you for having me. I have successfully integrated trading into my busy schedule as an entrepreneur. I started actively trading at 47, after trading stocks before that.",
  "I thought I could pick the right stock, but the returns were unsatisfactory. I also invested in commercial real estate, but the lack of liquidity was a concern.",
  "lack of liquidity in commercial real estate can be challenging for investors. Tying up capital for extended periods can cause missed opportunities. Active investing and trading can be more appealing for some due to the potential for quicker returns.",
  "I became interested in active trading after discovering Tastytrade. I stumbled into it rather than actively seeking it out. I started by picking equities and buying.",
  "transitioned from equities to investing in commercial real estate due to the lack of liquidity. I then discovered options trading, which offers leverage and flexibility.",
  "I learned about options trading from books like Natenberg and McMillan, but struggled with the mechanics. Then I found Mike and his whiteboard, which helped me understand how to actually trade.",
  "That was your first connection with Mike White, selling a 30 Delta put with a Profit curve. Using probabilities and statistics on the opening trade resonated with you, leading you to watch Market Measure and Options Jive. The quantitative approach of using probabilities and statistics intrigued you, rather than just buying a stock.",
  "When you started watching Mike and other Tasty shows, how long did it take you to start placing trades? It was pretty quick once I understood. I started with a 30 Delta put, which was my first trade.",
  "My first option trade was buying a 30 Delta put on an oil and gas company called McDermott. I bought the put at $3 and sold it for $450 in 1980, making a profit of $150 on a two-lot trade. I was confident and shared my success with my housemates, believing I had it all figured out.",
  "I lost all my money and my friends' money in one winning trade after thinking I had figured out the keys to the universe. I am now more risk averse after trading for five years.",
  "I've been trading for five years and have never bought options on an opening trade. I learned about options from watching Tasty Live. Starting small and testing mechanics was key for me as a risk-averse trader.",
  "When trading, it's important to understand probabilities. Start with a highly liquid one-lot trade, like Tesla or Apple. As you gain confidence, progress to selling more puts, focusing on the 20 Delta.",
  "The next progression is to sell the 20 Delta call and adjust the 30 Delta put to create a strangle. Start trading one lot for the first year and a half. Everything is working well and you may wonder why you didn't learn about this sooner.",
  "I wish I had known about trading earlier. I need to add more money to my account since the probabilities are in my favor on these trades. Instead of investing in other deals, I should put it in trading.",
  "In other investment deals, consider putting your money into active trading for better returns and control over outcomes. Active trading allows you to take ownership of your success relatively quickly, typically within around six months of watching and trading the markets.",
  "After months of trading and analyzing results, a mid-six figure account achieved a 45% average return over the last four years. This is a significant accomplishment considering the account size and market conditions post-pandemic.",
  "I have been trading post-pandemic, experiencing rallies in 2021, sell-offs in 2022, and rebounds in 2023 and 2024. It has been challenging, but I now primarily trade strangles, with 80% of my trades following this strategy.",
  "80% of my trades are strangles with a 20 Delta. I start watching the Futures markets around 7:15 AM and trade actively between 8:30 and 9:30 AM.",
  "I focus on trading between 8:30 to 9:30 and 2:15 to around 3:15. I trade all products and am indifferent to the product.",
  "Once you understand how Futures move with equities and the differences in volatility, selling a 20 Delta strangle is the same in crude oil as it is in the S&P. This broadens opportunities, especially in times of depressed volatility.",
  "I trade currencies, commodities, and metals. Let's discuss your trading mechanics. As the CEO of the company, how active are you in trading?",
  "As the CEO of another company, I am very active in trading on a daily basis. Last year, I made around 2,800 trades, compared to 1,500 the year before. On average, I carry around 30 positions each day.",
  "On average, I have around 30 positions, but can have up to 50-55 positions when volatility is high. Today, the VIX is at 16, so I am short on currencies and bonds yields. I am selling my positions to adjust my book accordingly.",
  "The current volatility in IVR is high above 35. I am strict on following trading mechanics, including adjustments, rolling, and closing out positions. I have developed a checklist for trading from the opening bell.",
  "When opening my watch list of 250 liquid underlyings, I first check the IVR above 35 and the five-day change. If positive, I glance at the chart to see if it's trading at extremes.",
  "If the stock forms a higher low, I will consider strangle it. If it is in the mid-range, I will sell the 30 Delta put. If the call side gets breached, I will roll up to manage the trade. I prefer not to get whipsawed.",
  "I aim to avoid getting whipsawed and typically close trades with a 50-60% profit. I prioritize managing my trade size as my account grows, focusing on percentages rather than specific numbers. Size control is crucial for new traders to consider.",
  "Each opening position I take is limited to 1-2% of my net worth. I believe in being disciplined about size to avoid risks. This strategy also allows me to explore other uncorrelated trades with available capital.",
  "When considering investing, do you still engage in traditional or commercial real estate investments? I have a company-sponsored 401k plan for my employees, but other than that, I have been focused on trading for the past four years and don't see myself doing anything else.",
  "You will trade for the rest of your life due to the flexibility and capital efficiency it offers. Having control over opening and placing trades is key. Your success in trading has likely made your business more successful in the last four years.",
  "trading or do you go into business? Both involve making decisions with risks and potential returns. In trading, you assess probabilities and risks before making a decision. Similarly, in business, every decision, big or small, requires consideration of potential outcomes.",
  "decisions in trading involves assessing the risk and potential return of each trade, similar to making decisions in business such as entering a new market or hiring new employees. It's important to consider probabilities and manage risks effectively.",
  "In trading, probabilities and risk play a crucial role in making quick decisions. Missing an opportunity can result in loss, so quick decision-making is essential for success in trading and business. Making 2800 trades in a year requires efficient decision-making skills.",
  "Making 2800 trades in a year requires quick decision-making skills. It's not mathematically possible to not improve in this aspect. This is especially relevant for individuals with full-time jobs or running their own businesses.",
  "started out selling a 30 Delta call on Nvidia last year, but it had an explosive run and I regretted not taking profits earlier.",
  "I started out selling a 30 Delta call. We both knew it was over for us and should have known when that would happen. I broke my rule of two, thinking I knew something and adding to losing positions. I was short Nvidia, more of an ego thing. I failed to close it and take the loss, but it taught me a valuable lesson that not every trade will be successful.",
  "Not every trade will be a winner. Follow the mechanics and stick to your discipline. Learn from mistakes like letting emotions get in the way or losing discipline. What other trading mistakes have you noticed recently?",
  "One of the biggest mistakes in trading is thinking something is overpriced or underpriced and predicting direction. Adding to losers can also be detrimental. Adding to winners can lead to big wins. Trading is a psychological game, with fear and greed playing a role.",
  "Psychological game, fear, and greed are real components of trading. The mechanics provide a tool to keep you in guidelines and protect you from greed and fear. I have traded for four years and nothing scares me about the market.",
  "In August, the NASDAQ dropped 1,700 points in two days, causing fear among traders. Shorting the S&P did well, but some positions went beyond put strike causing pain. Proper management and sizing can help navigate through such situations.",
  "Are you a trader with available capital looking to take advantage of new opportunities? Join us at Tasty Live Mechanics for inspiring stories of traders finding success through options trading.",
  "If you believe your trading journey should be shared with Tasty Nation, we want to hear from you. Email us at risingstars@tasty.com for a chance to inspire others with your success."
]