[
  "Welcome to the life cycle of a trade series. In this video, we will cover a custom trade - a put ratio with a naked call on ccj, a stock trading near its highs at around $60.",
  "The stock is currently trading around $60, slightly below its 52-week high. It has an IV rank of 16, indicating relatively low volatility. Considering the overall market's low implied volatility, I am inclined to take a short position on this stock to capitalize on premium.",
  "This stock is ideal for short premium trading due to the low capital requirement. I used about $750 in buying power for a strangle position with a $3 credit. I plan to add a short call with a put ratio spread to spice up the position.",
  "seen on the curve view. By using a put ratio spread instead of a naked position, you can still be short one contract on the downside while reducing risk. This strategy adds an extra Delta to the downside, with a short 30 Deltas on the position.",
  "I'm short 30 Deltas on this position by buying a put spread for a small debit. Selling at 186 and buying at 310 for a net cost of 50 cents. This trade allows for more downside room and higher profit potential with an embedded put spread.",
  "Put spread uses slightly more buying power than a strangle due to closer break even on the upside. Both trades have positive Theta and short volatility. Put spread has higher profit potential with a $5 wide spread.",
  "You have a $5 wide put ratio spread with profit potential if the stock drops to $55. The credit collected on entry adds extra value to the trade. Place the trade at $136 and monitor for fill at $134. The stock is dropping, providing additional profit potential.",
  "I have a short Delta position as the price is currently at 119. I got filled at 119 on the short call put ratio spread. Our position includes a ccj put ratio with a naked call, similar to a strangle with the short 65 call and the 60-55 put ratio spread.",
  "We had an extra put on the downside, making two puts in total. One is covered by a long option, leaving us naked on the 5565 strangle with an added long put spread for downside protection and potential profits. The trade was initiated for a $119 credit. The call has lost most of its value along the way.",
  "The put ratio IO has gained value, currently trading for around 21 C Credit. The spread between the 60 and 55 strike prices is worth $5, with the stock trading around 51.58. This means the spread would trade at $1.50, or $150.",
  "Trading at $1.50, $150 above the $50 strike. At expiration, profit would be around $200, including the original entry credit.",
  "have all those things working in your favor you can actually make money on the trade even if the stock doesn't move at all. This is the power of trading short premium positions.",
  "We can potentially profit from this trade by closing it for a credit. We will buy back the call, sell out of the 60 strike put, and buy back the two short 55 puts for a total closing price of 15 cents.",
  "We opened a position at $119 credit and closed it for an 8 cent credit, resulting in a $127 profit. The put ratio spread gained value, allowing us to get the credit for the close. Nice trade with no capital outlay."
]