[
  "In this video, we will cover a short put spread on CrowdStrike. The stock has been heavily impacted by recent news about software issues.",
  "The recent software update issue caused a significant stock sell-off. This presents an opportunity to capitalize on increased volatility. I plan to sell a put spread in September.",
  "Sell a put spread in September on CrowdStrike around a 20 delta at the 230 strike. The stock is near its lows for the year, around $250. Aim for a $10 wide spread with a total risk of $700 to $800.",
  "I will sell the $10 wide spread with a 70% probability of success. Selling a 20 Delta short option that trades at less than one-third the width of strikes. Routing at 223 to try to get filled.",
  "We moved the price down to 220 and got filled at 2115. The stock is volatile and has wide spreads. The down tick in price helped with our long Delta position. We are benefiting from the price action in CrowdStrike.",
  "In CrowdStrike, the E-mini S&P 500 futures are up 50 points with a v-bottom bounce back rally. We sold puts spreading CrowdStrike, which has been in the news for problems with their update. The stock was trading at 269 when we put on the trade, but dropped to 200 over the last two weeks.",
  "We entered this trade on the 24th when it looked like a bottom. The stock dropped from 264 to 200, then rebounded to 262. Our put spread is now slightly out of the money but close to breakeven. Implied volatility remains high.",
  "I plan to adjust my position to a more neutral stance due to the high volatility. I will add a hedge with some short Delta and short premium to take advantage of the volatility.",
  "have a 20 short Delta put and a 16 long Delta put. I plan to do a 310-320 call spread to balance it out. This puts us at risk above a big gap on the chart. I am comfortable with this risk and anticipate a decrease in volatility and time decay.",
  "I plan to sell at around $140 to take advantage of the move in CrowdStrike. This will result in a credit of $3.50 to $3.60, which is the width of the strikes in the Iron Condor strategy. Let's aim to get filled above the mid price.",
  "I placed the order at 140, slightly above the mid price, and adjusted it to 138 if not filled. Sold at 138, resulting in a total credit of 353. Currently marked at 340, up 15 cents on the trade. Made adjustments to turn the position into a more neutral Delta position.",
  "expect given the move in the stock but I'm not going to complain about a profit so we'll take it and move on to the next trade.",
  "I typically aim for around 100 Bo out of a $3 credit position. My net credit on this position is $353, with the original put spread sold at $2. This represents about 30% of the max profit from the original position. The stock has earnings on the 28th, making it very volatile.",
  "This week, the stock has been very volatile, moving significantly in both directions. Instead of holding through earnings, I prefer to take profits and close out positions. I will try to get filled on a closing order for a couple of bucks. To close out positions, right-click on the ask price for the short option to buy to close or sell to close on the long.",
  "To close, sell the long option at the bid. On the upside, buy to close the short option. Making a profit on the move lower on the call spread. Expecting around a 70 cent profit, aiming for a 7 cent fill at a 283 debit for a $70 profit.",
  "283 debit put us at a $70 profit. Cancel and replace at 285 for fill on iron Condor. Chains orders together on Tast trade platform. Made $68 on original put spread at 215.",
  "Sold put spread at 215, call spread at 138, closed for $2.85 debit, $68 profit. Avoided earnings. Suggest next strategy to cover. Watch Johnny trades Wednesdays at 9:40 a.m. on Tasty Live."
]