[
  "today we will discuss stock price simulations. Last week, we covered historical popular metrics like historical volatility, beta, and siar. Today, we will focus on forward-looking risk metrics derived from simulated stock prices and the process of simulating a stock price.",
  "Simulating stock prices helps us understand trading pitfalls. This data is from a risk workshop simulation. Let's dive in.",
  "we discuss geometric Brownian motion. It is important to remember the constant drift and volatility assumptions that are associated with it.",
  "When analyzing stock prices, it is assumed that they follow a continuous process with normally distributed log returns, constant drift, and volatility. The graphic on the left shows a particle undergoing Brownian motion in a fluid.",
  "The horizontal displacement of a particle over time resembles a stock price. The particle undergoes geometric Browning motion, while stock prices have constant drift and volatility. This can be described by a stochastic differential equation.",
  "Equation: The change in stock price is determined by expected returns, standard deviation of returns, current stock price, and change in geometric Brownian motion.",
  "The change in geometric Brownian motion equation is not as important as the approximation used to solve it. A discrete time approximation is provided below. This model can be used to project stock price changes using two components.",
  "stock prices are determined by two components: a deterministic component consisting of expected returns and standard deviation of returns, and a stochastic component representing market randomness. This suggests that stock price changes are influenced by both predictable and unpredictable factors.",
  "When modeling stock prices, there is a predictable component and a random component. The random element adds market randomness, making the model more realistic. The formulas may be complex, but the concept is straightforward.",
  "This model suggests that stock prices have a predictable component, a deterministic component, and an unpredictable component. The change in stock price from day to day is not completely random.",
  "In trading, the stochastic component is driven by a standard normal random variable ZT, representing a normal distribution with a mean of zero and variance of one. This component simulates randomness by selecting values from historical stock performance data.",
  "We simulate market randomness by grabbing a value from a distribution as a stock price evolves over time. This is driven by the assumption of a normal distribution. This also helps us back into the expected move of the stock price.",
  "In trading, simulating randomness involves pulling random values from a distribution consistent with the Black-Scholes formalism, such as geometric Brownian motion. This helps in understanding the deterministic part of trading.",
  "Each stock price evolves based on expected daily returns and standard deviation of returns. The random component is pulled from a distribution consistent with the Black-Scholes formalism.",
  "If a stock is trading at $100 with an annualized expected return of 5% and a standard annualized volatility of 20%, we can simulate this using the starting price of $100, expected return of 5%, and volatility of 20%.",
  "The Sigma term is 0.2. When simulating daily stock price movements, the delta T term in the equation is 1/252. This allows us to time step each day. Just plug these values into the equation for easier understanding.",
  "We will input the values into the formula and pull from a random distribution represented by ZT at each time step to evolve the stock price in the simulation.",
  "These are the prices and values we are plugging into the equation to calculate the expected move of the stock price. By simulating the stock price over time, we can calculate certain statistics.",
  "We can calculate certain statistics that make sense in the trading context. By simulating data over a year and repeating the process multiple times, we can create a Monte Carlo simulation.",
  "We use Monte Carlo simulations to project stock prices over a year, creating a distribution of possible outcomes. This allows us to measure statistics such as probability of profit (POP), standard error, and other risk measures. This method can be applied to portfolios or individual stocks for analysis and decision-making.",
  "With stocks, you can plug in different options and analyze various distributions. This method is useful for Monte Carlo simulations. Understanding this process is crucial for effective trading strategies.",
  "Understanding the limitations of the Black-Scholes model is essential when using simulations for trading. Stock prices are assumed to be continuous in the model, but this may not hold true for stocks with significant earnings jumps. This limitation should be considered when applying simulations to stocks with upcoming earnings.",
  "The upcoming trades have normally distributed log returns with constant drift and volatility. It's important to consider that volatility can change over time. This suggests that simulation results should be taken with caution. It may be necessary to account for other factors with more complex pricing models.",
  "Many limitations in simulating stock prices are rooted in complex models. Using Monte Carlo simulations can help address these challenges.",
  "Next time, consider using a Monte Carlo simulation for trading if you don't have historical data for backtesting. It's a cool way to analyze different outcomes probabilistically over time.",
  "Over time, you can use a spreadsheet to simulate trading scenarios. This is a useful tool that can be utilized in Google Sheets. Understanding the process is key to effectively using this tool.",
  "If you understand the process and have a model for randomness and stock price, you can do it yourself."
]