[
  "This is the start of a four-part series on trading during earnings season. We will cover key metrics needed to navigate these trades and discuss the unique opportunities they present. Understanding the factors that impact outcomes is crucial. Earnings trades have a small edge, in my opinion.",
  "Earnings trades offer a small edge due to their binary and immediate nature. While they provide instant gratification when correct, there is limited edge overall. However, with proper risk management, earnings trades can still be a viable strategy for traders with smaller accounts.",
  "Proper risk management can help you capitalize on market moves while minimizing potential downsides. I recently looked at Netflix for earnings trades but didn't see much trading activity. The markets weren't as tight as I expected. I tried selling calls on Netflix this morning due to its high stock price.",
  "$700 stock. Sold November 870 calls, took a while to close. Trading mechanically offers advantages for earnings trades, especially with high IV or IVR. Provides more trading opportunities and exposure to different stocks. Note: there are also downsides to earnings trades.",
  "Stocks with high implied volatility above 30 tend to have rapid changes in implied volatility during earnings season. Adjusting to these changes can be challenging due to limited time and the difficulty of recovering from outlier moves.",
  "Volatility has been exceeding 30% more often than usual in trading days. When analyzing six years of data for Apple, Microsoft, Netflix, and Amazon, the average notional IV is around 35, but around earnings it increases to about 42, a 20% difference.",
  "average implied volatility around earnings for these stocks is about 20% higher, with standard deviations of around 8% for Apple and Microsoft, 14% for Netflix, and 10% for Amazon.",
  "Tomorrow, Amazon is expected to have a 10% increase. Netflix has the highest standard deviation IV change around earnings, making it the riskiest of Apple, Microsoft, and Amazon. The average implied volatility change is 10.3.",
  "Since 2018, we have sold 16 Delta strangles 45 days to expiration and also sold 16 Delta strangles closest to earnings in four stocks. Our research shows a 72% win rate overall for selling 16 Delta strangles.",
  "show that Netflix has the lowest win rate on earnings among these stocks in the last six years, with Apple and Netflix dragging down the overall percentage to 72%. Microsoft and Amazon performed better in comparison.",
  "The numbers show that Netflix has underperformed theoretically. This may lead to a directional bias towards shorting Netflix due to its high stock price.",
  "would probably sit out trading Netflix due to low volume or liquidity. Netflix earnings are scheduled for Thursday after the close, not tomorrow. Let's move on to the next slide.",
  "We analyzed the average price movement of four stocks. The change around earnings is plus or minus 7.2%, compared to 2.4% without earnings. Earnings risk and volatility are almost 3 times higher. These numbers show significant differences in key mechanics from the previous data.",
  "The key difference in 45-day trades is timing. Place your trade the day before an earnings announcement to capture pre-earnings volatility. It doesn't matter if you trade two days before, the day before, or the day of the announcement. Each stock's volatility is unique, and it's impossible to predict the exact high tick to sell.",
  "Keep your position size small to manage risk. Consider exiting the morning after earnings to lock in profits or adjust trades. Use option strategies that benefit from high implied volatility pre-announcement. Avoid concentrating too much risk in one earnings play.",
  "There is too much risk in one earnings play to protect against unexpected outcomes."
]