[
  "This is Market Measure with Dr. Jim. We have discussed market efficiency and the efficient market hypothesis. Do you align with the semi-strong or strong version of the hypothesis, Mr. Schultz?",
  "emotional reaction of the market in the search for equilibrium in the short term is more powerful than the efficient market hypothesis.",
  "In the short term, risk in trading cannot be manipulated, only understood and managed accordingly. Let's test this theory with two popular ETFs, SPY and IWM, which have different underlying prices, implied volatilities, and components.",
  "I am currently short SPY and long IWM. I have held this position for about two and a half months. I am interested in comparing the average P&L and short-term risk profile of each trade over time to determine if there is a risk-return advantage in trading one over the other.",
  "The first question is not fair. The second question is, do you think there is a risk-return advantage of trading the S&P 500 over IWM? I would assume that IWM could potentially give you greater returns, but SPY would give you lower risk. It's a matter of picking your poison.",
  "I believe you will likely face lower risk with SPY and higher returns with IWM. The risk-return advantage of trading one over the other will be minimal.",
  "So, when considering both risk and return, it is important to analyze how the data is segmented to pinpoint the return and risk aspects. From 2013 to present, there have been 12 years of data on 16 Delta strangles in both three lots in IWM on average. The SPY is around three times the price of IWM, with one lot in the SPY for 45 days.",
  "In the Spy, one lot was traded for 45 days and in IWM for 21 days. The win rate, average P&L, volatility, and return on investment were recorded. The win rate between the two is nearly identical, regardless of implied volatility. Let's move to the next slide to see where we stand.",
  "The win rate is virtually the same across different products, suggesting efficient pricing of Deltas. The key takeaway is the risk.",
  "The risk-reward ratio for these strategies is close, with 36% more expected risk and return for IWM. Historical risk and return numbers align almost perfectly. The average implied volatility for IWM is consistent.",
  "Implied volatility for IWM is consistently higher. The ratio of IWM to SPY is 1.33. The average P&L for strangles was greater for IWM, indicating higher volatility and potential for higher returns on investments. Next slide.",
  "Let's see how we can use this information. My decision on what to trade is based on implied volatility rank, not the pairs trade I have. If I were to do a strangle, I would put the position on based on this information.",
  "I base my trading decisions on implied volatility rank, not personal preferences for specific stocks like SPY, Dow, Q's, or IWM. I focus on where the greatest opportunity lies, as the potential profit remains the same regardless of the product chosen. Being product indifferent allows me to explore various opportunities and choose the best one based on strikes, Deltas, and probabilities.",
  "When trading SPY and IWM on Coinbase, probabilities are generally uniform. Risk and reward are efficiently priced in liquid and diversified underlyings. Comparing implied volatilities can help assess risk across different products.",
  "In this study, we compared the risk and return characteristics of two products over the long term. We found that historically, higher implied volatility in underlyings resulted in higher profit and higher risk. The S&P has rallied 50 handles, which is impressive, while the Nasdaq is now only down 270.",
  "Nasdaq is down 270 points. The Trump tariff meetings are later. There may be news affecting the market as Nasdaq was down 115 points and now down 70."
]