[
  "Welcome to Option Trades Today. I'm Tony the Baptist with a trade idea for you from downtown Chicago on October 17th, 2024. The S&P is up $10, with a range from 5871 to 5927. Bulls and bears both have opportunities to profit. NASDAQ is up 75, and the Russell has been strong in the last two weeks.",
  "Russell has been strong in the last two days but is taking a breather today. It is down 18 points, while NASDAQ is also taking a breather. The Dow is up 105 points. Dia, which is the Dow options, has a dividend of around 50 cents.",
  "If you have deep in the money calls around 374 or lower, there is a risk of a dividend impacting your trade. Traders who prefer trading zero or one-day options in smaller products like SPX or diamonds may be affected by the upcoming dividend.",
  "Trading at around 429 calls with a 50 cent dividend puts the calls at risk of being exercised if the put option is trading at or under 50 cents. This would result in the person on the other side of the trade getting long stock and collecting the dividend. In this scenario, buying the puts for under 50 cents the next day could lock in a 10-cent profit.",
  "50 cents lock in a 10-cent profit on a dividend play. Consider implications with larger dividends, such as SPY's $1.50 dividend. Short options or deep in the money call spreads can become risky if one side is exercised, leaving you short 100 shares of stock.",
  "100 shares of stock long your call, you have no additional risk but you owe that dividend. In SPY, it would be $150 and in the Diamonds, it would be 50 cents. A dividend risk play. Look for a high IV Rank and get rid of earnings.",
  "I found a promising stock, MU, with a 5-day change of over 1.5% and an IV rank of 41. It has tight liquid markets and high option volume, making it a good trading vehicle.",
  "can consider trading MU options with high volume and liquidity. The stock has shown a decent range today, trading between $114 and $112. With 29 days until expiration, consider looking at weekly options for potential trades.",
  "45 days to expiration, weekly options are trading with a 20 cent spread. Volume and open interest are decent, although not as high as December options. Despite 64 days until expiration, the decision to trade these weekly options seems clear.",
  "It's best to trade December options with 64 days until expiration. December options have higher implied volatility at 51.5% compared to November options at 48%. This can benefit you when selling premium.",
  "I have no opinion on MU. I see it as mid-range for its recent move. The stock has been as high as 150 and as low as 85. I want to reduce risk due to high volatility. VX is down 22 cents.",
  "trade VX with defined risk to take advantage of the current volatility. This strategy also requires less buying power. Feel free to comment below or listen to my podcast for more insights.",
  "I'm looking to sell based on the high volume of options today. The markets are about 10 cents wide.",
  "The spread is 5 to 10 cents wide depending on the strike. There is good volume, open interest, and tight markets. The IV rank is 41.5% with expanding volatility over the last 5 days, up almost 1%. Selling around the 20ish Delta range like the 97.5 put and 135 calls could form a classic iron Condor with slightly more risk to the downside. This is because we are just inside the expected move.",
  "Inside the expected move, there is room for upside potential. Using a strategy with $1,100 in a margin account offers low risk and high buying power. The profit potential is around 68%, with a daily Theta of $10. The strategy is delta neutral with a Delta of less than one. The maximum profit is $592. This makes it a good option for putting capital to work with a relatively small amount.",
  "I want to show you how to trade with a small amount of capital on a stock with high monthly implied volatility. This could be a good opportunity for those with buying power or those willing to take on the risk of an undefined risk trade. Consider using the same amount of buying power while managing the risk.",
  "the risk is lower with the same buying power. I will set up a $10 wide iron Condor. Typically, for every $100 stock, the width is $10. This does not change my risk parameter significantly. Buying power decreases from $1100 to $700. Max profit is...",
  "I sold this for 38, the mid price at the time. I anticipate selling for 309 or even 310 with an uptick in implied volatility. I chose a defined risk trade to use less buying power without significantly changing my risk profile. The strangle looks promising.",
  "The strangle looks appealing for those willing to take on extra risk. Despite having two long Deltas, it will move slower. Removing the wings at the same strikes makes it delta neutral or short one Delta. Buying wings $10 wide indicates call skew.",
  "getting long Delta by going $10 away from my purchase price when it was delta neutral or short Del. This is a way to adjust call or put skew in trades and manage Delta movement. Defined risk helps mitigate potential losses.",
  "will move down the short strike. For example, if the stock goes lower and my Delta becomes positive 15, I may move the 97 put down to 90. This will increase my buying power to $1,200 from $700. This is how I manage my trade Delta.",
  "If the stock price drops and my Delta reaches +15, I would move the call down to the 125 strike. I am reducing my Delta by 50%. I got filled at 308. You can see these trades on Bob the trader's page before the podcast is released.",
  "I made a MU trade around the same time I usually do. The stock was at a higher IV rank of 42, with a 62% probability of success. I prefer around 65% probability. I received a credit of 308 for a delta neutral iron condor trade.",
  "Learned from this podcast that it has about two long Deltas, which I still consider to be delta neutral. Now is the time to transfer your account to Tasty Trade, the top brokerage firm. Take advantage of the $5,000 they will give you for moving your account or opening a new one.",
  "For more information, please contact support at tastytrade.com. You can also reach out to me at bat@tastylive.com or leave a comment on YouTube. Your feedback is appreciated."
]