[
  "is now for the SPX to be cheaper than its corresponding Futures. Currently, the SPX is trading at 2575.51, about $50 lower than the S&P Futures. This discrepancy can be influenced by interest rates.",
  "Rates have been more normal in the past than recently, so it's mainly a function of the cost to carry the synthetic equivalent of a stock position. The S&P 500 and SPY are the same product, but their prices differ.",
  "The S&P 500 is a popular index watched by investors worldwide, with underlying instruments like SPX, SPY, and ES Futures closely tracking it. The SPX is a cash index and cannot be traded, while the ES represents tradable Futures Contracts. The NASDAQ is up on the day.",
  "securities? The ES is currently trading at a premium of roughly 47 points higher than the SPX. This raises the question of whether this is a common occurrence or an outlier event.",
  "The difference between two ETFs tracking the same basket of stocks is the cost to carry, which includes dividends and interest rate costs. This segment highlights the dividends in the SPX.",
  "In the SPX, dividends are already built in, but the cost to carry the equivalent stock position is not in the ES. The cost to carry and dividends are built into the price of the actual future in the SPY.",
  "The formula for trading stock and dividends is based on the expected forward value at settlement date. It includes the stock price, risk-free rate, dividend yield, and time to maturity. This formula prevents arbitrage opportunities in this play.",
  "There is no arbitrage opportunity in this play. The relationship between interest rates and dividend yield determines whether ES trades at a discount or premium to SPX. If interest rates exceed the dividend yield, ES will likely trade at a premium. Currently, interest rates exceed the dividend yield, so ES is trading at a premium.",
  "the ES has traded at a premium due to the dividend yield being higher than interest rates. Currently, the dividend yield is around 2.5%, which may lead to the ES trading at a premium.",
  "In the past 30 years, there have been four periods where the ES was priced higher than the SPX, coinciding with Federal Reserve interest rate increases. Fluctuations in interest rates are key in creating discrepancies between the ES and the SPX.",
  "When the FED raises rates and the cost to carry is greater than the dividend yield, an inversion occurs. In June 2022, the Federal Reserve announced a 75 basis point rate hike, leading to an increase in the ES to SPX spread. This is not a tradable example, but it highlights the impact of rate hikes on trading strategies.",
  "reason why there's nothing tradable here. Buying back more of the spread and rolling down calls to take advantage of crude oil movements.",
  "The statistics show the percentage of times the ES is higher than the SPX. These results are consistent with our previous discussion. With the Fed reducing interest rates, we may see a tightening of the spread in the future. This is not tradable information, just for observation.",
  "It's important to understand the trading numbers. Over the last 30 years, it has been tradable 54% of the time. Since 2008, it was 25% of the time, but since 2022, it has been 85% of the time due to the rate hike environment in the last three years. This context helps when rolling futures from one month to the next.",
  "For takeaways, ES and SPX both represent the S&P 500 but can trade at slightly different prices due to the cost of carry in Futures Trading. The gap between these prices is influenced by the relationship between interest rates and dividends.",
  "The relationship between interest rates and dividend yields does not always indicate arbitrage opportunities, as everything is typically already priced in. If interest rates and dividend yields both return to 2.5%, the asset will likely trade at the same price."
]