[
  "Welcome to Option Trades Today. I'm Tony the Baptist and I have a trade idea for you on September 26, 2024. The S&P is up 13 points, but was up over 50 points earlier. The NASDAQ has had a 300 point move already, but is still up.",
  "The market is up this morning, with the Russell up 18 and the Dow up 2011 points. Chinese stocks are up, while SMCI is down due to a report suggesting possible accounting issues. Earnings for SMCI were on November 6th, before the November expiration, making it less appealing for trading. The markets are showing wide spreads.",
  "The markets are wide today, so I decided not to trade SMCI. I went back to my high option volume list and focused on stocks with upcoming earnings. JD, a Chinese stock, has a high Ivy rank and is up almost 4% in the last 5 days. Palo Alto Networks is also performing well.",
  "Today's volatility is lower, making trading more appealing. Buu has increased almost 2% in the last 5 days with an ivy rank of 58, higher than JD. Buu, priced at $37, may be more challenging to sell premium in compared to JD due to smaller premiums.",
  "$410 in JD, big change in Bu. Bu is well off its highs, up almost $4 higher than current levels. Market making lows, considering trading lower in Bu or looking for a selloff.",
  "for a potential selloff in BU before earnings on November 19th. Check the option chain for November 15 with 50 days to go and consider taking trades off around 21.",
  "When trading in October, consider moving positions from October to November within a specific timeframe. Look to roll positions from today to the next few days or weeks. Consider opening positions in November. Evaluate market conditions before making decisions.",
  "Some out-of-the-money options have wide spreads, like 10 cents for 87114 and 20 cents for puts. Be cautious with pricing when trading, especially when selling. If selling puts, aim for a price well above the $193 mid price.",
  "At a $193 mid price, consider offering $197 to $198 and adjust based on stock movement. Be more aggressive if the stock is ticking up, and keep pricing steady or slightly lower if it's going down. This is for a long Delta position.",
  "are looking to take a bearish position with no downside risk, consider a call ratio spread. This strategy offers potential gains while limiting downside risk.",
  "A bullish position in trading involves limited downside risk. Ratio spreads have a wide sweet spot around the short strike, which is opposite to the desired stock direction. Buying options with around a 30% probability of success and $5 wide strikes is recommended.",
  "Wide strikes make it more challenging, so I will default to buying the 110 calls and selling the 120 calls. I am aiming for a $10 spread with a 1 by 2 ratio for a high probability of profit at 87%. This strategy also gives me a short Delta of 16. The green line indicates the probability of success.",
  "The probability of success in this trade is high with limited downside risk and potential upside above 120. By buying one 110 call and selling two 115 calls, the break-even point is around 112.",
  "I am short one extra 115 call, which increases my risk above 120, approximately 121 to the upside. My best-case scenario at expiration in 50 days is the stock at 115, resulting in a profit of $500 plus the credit received, making my max profit $638. I am considering taking on either more or less risk with the trade, depending on your preference.",
  "I believe trading contracts carries more risk, so I am opting for a spread with a 1 by 3 ratio. This means buying one 110 call and selling three 120 calls, using $4,200 in buying power. This spread offers potential for higher returns compared to a 1 by 2 ratio.",
  "If you were looking to do this trade one by two, you'd be using $2,200 in buying power. I prefer to do it for a credit over a dollar. With a 1 by 2 or 1 by 3 spread, my break-even point will be different. Using $4,200, I am going with a 1 by 2 spread.",
  "I am long one 110 call and short one 120 call, creating a spread worth $10 at expiration if the stock is at 120. With two extra calls, my maximum profit is $173, based on current trading levels.",
  "I entered a call spread at $1.56 and $1.70 when the stock was at $66.50. If the stock reaches $120 at expiration, I make $1,000. My break-even point is $125 with a 91% potential profit.",
  "On this call spread, I have two calls at $5 each. My break-even is approximately $125 with the stock trading at $101. The $10 expected move is important because it aligns with my long strike. If the stock moves as expected over the next 50 days, the 120 calls will be worthless and the 110 calls will be at the money.",
  "I am long on the 110 calls with the most premium. I hope the stock opens down $7 tomorrow, causing the spread to potentially be at zero or a small debit. This could result in a profit of around $1.50 overall in Buu.",
  "The stock is down almost 10% from its highs today, which is over a 10% move. There is no guarantee of success, but I like the 91% probability. Positive Theta at $85 for the risk. If volatility contracts and the stock doesn't move, we don't have to worry about earnings.",
  "If the stock goes lower, out of the money options will lose premium faster than at the money options. Having 23 short Deltas means wanting the stock to go lower. Max profit is $1,173, currently at 167. Markets may fluctuate, but selling at 175-172 is likely with the stock at $740.",
  "If you're watching this now, you'll see me on the follow page as Bob the trader. I sold at $1.56 with the stock trading just under 101 and sold at $1.70 with the stock trading just over 101. This trade will have movement if the stock goes in the opposite direction.",
  "Collect more credit by buying back for a profit. Rare 1x3 call ratio spread with no downside risk. Keep positions small to avoid trouble.",
  "Keep your positions small if 1x3 is too much buying power for you. Avoid trades that are too large for you. I prefer wider trades with defined risk like iron condors. Be cautious of trades with undefined risk. I have been saving my buying power for trades with more risk.",
  "Trades that offer higher risk and reward potential. If you enjoy our podcast, support us by opening an account with Tasty Trade. Like and subscribe on YouTube to help us continue providing free content."
]