[
  "This is relevant for traders who often work with the normality assumption in stock log returns. The Black-Scholes model forms the basis for many statistical assumptions and trading models. However, real data often does not fit this assumption, as actual returns are messier than expected.",
  "Returns can be messier than mathematical simplifications suggest. Quantile-quantile plots are a statistical tool for comparing distributions visually. Today, I will use them to show when markets deviate from normality.",
  "This morning, I'm good with the introduction on page one. I'm not sure how much longer I can continue. Let's see if you have more pictures to add.",
  "My 8th grade math teacher used to say that math is the pursuit of laziness. Let's use math to understand things in a simpler way. The normal distribution is a symmetric distribution marked by the mean and occurrences.",
  "Central tendency is defined by variance, which is used to measure volatility and standard deviation in statistical assumptions for expected moves in trading. This distribution is key in finance. When looking at actual log returns for SPY from 2015 to 2024, we can see the data on the next slide.",
  "From 2015 to 2024, when analyzing stock log returns, it is evident that the distribution is not perfectly normal. Fat tails and frequent two to three sigma moves occur more often than predicted by a normal distribution. The distribution appears to be sharper than expected.",
  "Normal distribution estimates show asymmetry in option distributions, with skew and kurtosis. This can lead to being Fooled by Randomness. Realized returns may differ from expected returns. To better understand this, we can use quantile analysis.",
  "Quantile plots provide a direct comparison between two distributions by plotting their quantiles. Quantiles slice up the distribution into equal probabilities. For example, the normal distribution has three quantiles.",
  "The three quantiles of the normal distribution divide the data into equal chunks. When applied to stock returns, we take the returns of a stock, such as data for SPY from April 24.",
  "In April, there will be nine different daily returns. Each return will act as its own quantile. We will slice our target distribution into that number of quantiles and plot them against each other.",
  "plotting the returns of SPY against the quantiles of the normal distribution. If the distributions match, we should see a straight 45-degree line. This is pretty close with these nine data points. Let's move on to the next slide to examine the actual data.",
  "slide. The data shows a similar distribution between Spy returns and a normal distribution from 2004 to 2007.",
  "volatility, we can see deviations from the normal distribution. This is evident in the curvature of the data during extreme market moves.",
  "The market enters a period of extreme volatility when there are large moves around the two Sigma Mark (2.2%) for SPY. These deviations tend to cluster together, a concept known as volatility clustering.",
  "When there is a two Sigma move, the probability of another one occurring within 10 days is about 74%. On average, there are about two and a half two Sigma moves, deviating from the assumed equal distribution.",
  "In real markets, volatility clustering occurs in real time. This transition between different regimes is widely accepted by financial professionals and academics.",
  "Transitions between different market regimes with unique characteristics and properties can persist for a sustained period of time. These regimes can include bull markets, bear markets, or selloffs. Quantile plots show that the distributions are fundamentally different from the normal distribution that described S&P returns from 2004 to 2007.",
  "Historic returns from 2004 to 2007 may not be applicable in the current trading environment. The new regime may have a different distribution, affecting the reliability of historic data in formulating models during high volatility periods.",
  "active trader is so important.",
  "Watching the market as an active trader is important to identify signs of a shift in market behavior. Increased correlations and intraday volatility are indicators of potential changes in market regimes.",
  "Intraday volatility has increased in the market, similar to CL VIX levels. Bond and gold prices are appreciating, along with other defensive assets. Recognizing these changes in real-time is crucial for adapting trading strategies to new conditions. This shift indicates the market has entered a different regime.",
  "There are computational methods for reliably detecting regime shifts, such as clustering algorithms, Markov models, and Gaussian mixture models. We may discuss one of these methods next week. Quantile plots are useful for analysis. Let's move on to the takeaways.",
  "Quantile plots compare two distributions by plotting their slices against each other. Dynamic quantile plots show that market returns deviating from normal distribution are large and occur close together, known as volatility clusters.",
  "Volatility clustering is the concept that the market may transition between different regimes with unique statistical properties that persist for a sustained period. These transitions are often triggered by market shocks. Recognizing when the market is in a certain regime is important for trading.",
  "ability to recognize when the market has shifted is crucial for knowing when to adjust statistical estimates. Computational tools are especially helpful for this, as it can be challenging to do in real-time. Identifying a regime change is difficult, but important for successful trading.",
  "In 2020, during a market sell-off, we were in the office after experiencing several big down days. I remember you saying you couldn't tell if we were in a sell-off yet. Regime changes are difficult to predict, but there are usually telltale signs that require more information to confirm.",
  "make an informed decision on your trades."
]