[
  "Welcome to Option Trades Today. I'm Tony Baptist with a trade idea for November 26th, 2024. The S&P is up 20 handles at 6,028. Nasdaq is up 79, Russell is down 13, and the Dow is down 146. Volatility is up by 25 cents.",
  "Volatility has decreased in the last few days, making it challenging to enter new positions. I closed my 1 by 2 call ratio spread on Coin for a profit of about a dollar. I am considering re-entering a position on Coin.",
  "Coin is currently trading at $6.7. I have set up the IVX 5-day change list for you to show the highest changes. These are the high option volume list with IVX going higher over the last 5 days.",
  "Over the last 5 days, I will be changing the IVX 5-day change to IV rank and sorting it from high to low. Coin is currently at the high end of the range, down by 18% today.",
  "Coin is down 18% today with high implied volatility. Despite not being a perfect setup, I will take a trade due to the high IV rank of around 60. I will put on a double ratio trade.",
  "putting on a double ratio spread in Coin. I will use a 1 by 2 ratio spread for more flexibility since the stock is not near its highs. I will trade on both sides in January, as 45 days is optimal for this strategy. Trading in December with only 24 days is not enough time.",
  "I will be using different widths on each spread. A ratio spread involves buying one and selling two options. I will be going $15 wide and selecting the option with a 78-10 Delta, such as the 200 puts.",
  "I will buy one 200 put and sell two 15 puts. The spread is wide, around $1.40-$1.50. The trade has a 94% probability of profit and is slightly bullish with a long Delta and positive theta of $77 per day. Max profit is $1,600.",
  "We are long one 200 put option. If the stock drops to 185 in the next 52 days, the 185 puts would be worth zero and the 200 puts would be worth $15, giving a max profit of $1,625 with a buying power of $3,800. This trade is well outside the expected move to the downside.",
  "My break-even point on this trade is just under $170, factoring in the credit received. I plan to put on a call spread on the other side, aiming to go further away from the money with my long position.",
  "I'm buying a 540 call and selling two 560 calls, creating a $20 wide spread.",
  "I'm selling two 560 calls now for a credit of $4 to $4.10. The call spread is 235 points away from the call we're buying, showing call skew. This strategy may be advantageous if you're slightly bearish on the overall position.",
  "I am currently taking a neutral position on the call side for coin. I have a ne5 Delta and a potential profit of 92%. I received $530 for this spread. The markets are a bit wide, so take your time when filling this order.",
  "Fill the order above the mid price, currently at 547, at 555 or 560. Walk it down by 2-3 cents each time until filled as close to the mid price as possible. This stock has short Delta, so the price will likely go higher. Aim for a higher credit on entry for better results. Note that buying power required is twice that of selling.",
  "Buying power for selling the put spread is $6,200. Max profit on the upside is $20 wide plus the full credit received from the put spread and call spread, totaling $530. Break even is $585 on the upside and $160 on the downside. Trade has a high probability of 92%.",
  "anticipate but I think it's a good risk reward trade so I'm willing to take it.",
  "It requires more buying power than I prefer, but it's a high probability trade with a significant amount of credit. Consider transferring your account to Tasty Trade for more high probability trades and credit. Contact us if you encounter any issues.",
  "If you have any problems, contact support at tastytrade.com. Happy Thanksgiving and stay safe and warm. Peace."
]