[
  "Today, we'll discuss premium Decay in options trading. In at-the-money options, premium Decay accelerates in the last 50 days before expiration. The Decay curve is not linear, slowing down further out in time and then speeding up around the 40-50 day mark. This acceleration continues as expiration approaches, with a consideration of risk-reward.",
  "The reward decreases as you get closer to expiration, increasing risk. This holds true in real trading when separating occurrences with and without directional movement. If the stock price is close to the original price, the P&L is purely from Premium Time Decay, isolating stock movement and Delta.",
  "we are analyzing stock movement and Delta exposure from short premium by focusing on data Decay during sideways market moves. Looking at SPY from 2005 to present, we sold at the money puts with a 50 Delta and recorded non-movement occurrences when the stock was within 0.5% of the previous day's price.",
  "45-day cycle, there is a higher probability of the stock price returning to its original level. This analysis focuses on price movements within the market.",
  "moves $30 with a $3 expected move over six months. It may take longer to reach that price again, even if it moves in one direction. Consider mean reversion in terms of volatility, not just stock price. After a large move, there may be a tendency for the stock to revert back.",
  "the expected move based on implied volatility. It's important to analyze non-movement occurrences to compare actual daily premium decay with theoretical premium decay.",
  "looking at options trading. This acceleration in premium decay is important to consider when making trading decisions.",
  "When trading closer at the money options, time is limited. Price movements are more unpredictable on a day-to-day basis or shorter duration. In bull markets, the call side is tested more often than the put side. It's important to consider directional bias when trading.",
  "When controlling for directional bias, the call premium decay looks similar to put premium decay during sideways moves. This study focuses on inside move periods and days, where the premium decay for calls matches that of puts in the hypothetical curve.",
  "Delta is one of the largest risks when trading and can adversely impact performance. Premium Decay is relatively the same for calls and puts when the directional move is removed from the equation. In this study, Delta was excluded to focus on comparing premium Decay between calls and puts.",
  "Delta is the key factor in determining the direction of positions. When we control for Delta, we see that returns come from premium decay. This is why we focus on high volatility and mean reversion. Theoretical premium decay closely matches actual premium decay, especially since most traders sell out-of-the-money options.",
  "Most traders sell out-of-the-money options. Does actual out-of-the-money option decay follow the theoretical? This will be covered in part two. Part two will focus on price movement and probability of profit on expected moves."
]