[
  "Recently, we featured a trader who specializes in zero-day trades, weekly options, and monthly options. After receiving feedback from viewers, we conducted further research on his trading strategies.",
  "Emails on the wings for $120,000 to sell a one lot triangle in the SPX on a zero day. Buying wings reduces capital to a couple thousand dollars, making it a more efficient use of capital.",
  "Capital efficiency is key when trading options. Consider factors like the distance of the wings, the expiration date (zero day, seven days, 30 days), and the strike price to optimize your strategy.",
  "Today's segment focuses on long-dated wings for zero DTS. The goal is to determine the optimal width of the wings to maximize mechanical efficiency and trade optimization. By going further out, we aim to minimize theta decay and optimize the trade for higher probabilities of profit and upside potential. This approach may not be the most capital efficient, but it effectively manages premium risk in undefined risk trades.",
  "probabilities of profit and upside potential are similar to RIS strategies. Placing these trades in zero DTS is impractical due to regulatory buying power requirements for spot price and strikes. Neglecting time until expiration, we are exploring using very cheap zero DT options to turn our strategies into wide iron Condors. Instead of purchasing wings likely to lose all their value in zeros, we are considering using...",
  "Using longer-dated options to create short-term diagonal spreads, also known as a strangle swap, involves selling a front month strangle and buying a back month strangle for capital efficiency and risk management. This strategy can be referred to as a Double D call or any other name, but it essentially functions as a strangle swap.",
  "We conducted a 2-year study using zero DT SPX options at market open. We sold 20, 30, and 40 Delta strangles paired with 30 DTE options. Instead of the expected move, we used 5, 10, and 15 Delta options. We considered closing the strangles at 25% profit.",
  "We closed the strangles if they reached 25% of Max profit or left them on until expiration. The wings were sold back before closing everything out. No holding the wings here. The Net Daily performance was computed including the wings in the guts and resulting buying power averages.",
  "Powers noted that the averages of the wings occasionally fluctuate, but they were sold for less than cost. All trades were assumed to be done at the mid price. Moving on to the next slide, we will see some results. This is our preferred strangle Vic with 20 Delta short strikes. The key point is the P&L per day with a 25% profit target, including all losses carried forward.",
  "This strategy involves using 15, 10, and five Delta long strikes without management. Despite not taking profits at 25%, the average daily P&L remains positive. The average Wing cost per day is around $40. This highlights the importance of managing trades early.",
  "Manage your trades early. Focus on the 30 Delta to make more money by taking more risk. Your P&L per day losses without management may not be much worse, but you can make over double the money. Wing cost remains the same, making this an attractive option.",
  "same risk. It's a matter of personal preference and risk tolerance.",
  "You get paid for taking additional risk, your average daily P&L is positive, your wing cost stays the same, and you can choose your strategy. The key is managing a 25% risk. Data availability is important for a two-year study.",
  "Over the last two years, there has been a two-year study using data every 10 minutes. In the last two years, VA has been relatively constrained. It has definitely had an impact on this study. The last two years have been very good for zero DTS.",
  "Selling zero DT premium near the money has been profitable in recent years due to limited market volatility. Selling naked zero DT premium is prohibited for regulatory reasons, but not buying wings or diagonalizing can be a cost-effective alternative.",
  "The cost of using zero wings was recouped when the position was sold, costing only $40 a day. Zeros are more expensive than that in total. The costs for diagonals were higher than iron condors. Selling naked strangles is not recommended.",
  "After exploring different methods to control the binding power for zero DT strangles or strategies, using cheap zero DT options appears to be the most cost-effective approach. Buying 7 or 30-day options may offer more peace of mind but does not change the probability of profit.",
  "Would you switch from a 20 Delta short strike to a 40 Delta for more profit potential, or stick with the 20 Delta and 25% management? Tony and I typically use the 25 Delta as a middle ground between 20 and 30.",
  "When choosing between the 20 or 30, consider the premium. Today, the 30 has more potential relative to the 20. We typically aim for around 25 in the morning, 20 the night before, and 30 later in the day. We avoid the 40s.",
  "We typically trade in the 30s but may consider 40s. We are behind schedule and taking a short break. Victor is filling in for Tom. Liz and Jenny will be hosting tomorrow. Tony will return on Monday. Scott is up next."
]