[
  "In the last 15 minutes of S&P 500 trading, zero DT option sellers can benefit if the stock price stays within a specific range by the day's close. This analysis is based on data from nearly 4,000 trading days over 16 years, focusing on the final 15 minutes from 2:45 to 3:01 central time.",
  "From 2:45 to 3:01 central time, the key findings show that the last 15-minute range typically stays within a quarter of a percent 85% of the time and within half a percent 95% of the time. In 98.66% of cases, it stays within 34 of a percent. Percent moves can be significant, especially in the spy and the SPX on the trading platform.",
  "On the trading platform, a one to two standard deviation move is around 0.7. We use SPY instead of SPX in the study for easier data access. The first chart shows a normal distribution.",
  "first chart shows a tight range of around 0.25%. To put this in perspective, 0.25% is equivalent to about 15 handles in the S&P. This morning, the S&P moved half a percent overnight, compared to the 15 handles in the last 15 minutes.",
  "minutes, the market is currently priced about 15 handles away. Yesterday, I sold some calls that were 10 handles above, but there isn't much premium for 15 handles away. When discussing percentages, the data can be skewed, so it's important to be cautious.",
  "If you go out to 15 handles away with 15 minutes to go, you can collect about 30-40 cents. Going inside of that may bring in about a dollar. Each quarter of a percent increase brings in more profit. The last 15 minutes of trading the Spy is closely monitored and strategized.",
  "48.3% of the time, the Spy goes higher in the last 15 minutes, while 50.2% of the time it goes lower. It seems like it goes higher 100% of the time.",
  "surprised to see that including data from 2020 and 2022 shows a lower closing rate. It's interesting that 1.5% of the time there was no change at all. I had expected more volatility in the last 15 minutes of trading, but it seems that lower days outnumber higher days during this time period over the last 16 years.",
  "The data shows that the SPY typically falls within a half a percent range during the last 15 minutes of trading, with 95% accuracy. This indicates low volatility during this time period.",
  "In the last 15 minutes of trading, volatility tends to increase. This is similar to a normal 45-day cycle where volatility rises. Consider managing your trades before the market closes to avoid the heightened volatility.",
  "On January 17, the one standard deviation theoretical move is plus or minus 0.25%.",
  "The standard deviation is +/- 0.25%, between 596 and 599. On this specific day, it was 597, a -0.12% move. This pattern is consistent on most days. The information is also presented in table form, showing minimum and maximum numbers.",
  "Your minimum and maximum numbers are 2% and 3%, respectively. These dates were from 2020 when there was high volatility. The standard deviation is 41, indicating fat tails in the data distribution.",
  "The SPX has experienced many outlier moves over the past 16 years. In 2020, there were a high number of three standard deviation day outliers. This data reinforces the importance of incorporating mathematical analysis into trading strategies.",
  "On average, there are five outlier moves per year, with 2020 having the highest number. The graph shows actual counts of three standard deviation outlier moves since 2009.",
  "In 2008, the data shows high volatility. The rest of the years are also graphed out, with some years showing no significant changes. Three standard deviations is a lot, but five for a year seems unusually high. It's important to filter out any misleading information.",
  "Outlier moves happen most frequently in March and least frequently in January and December.",
  "Trading volume is highest in March compared to July, January, and December. Months with higher trading volume tend to have more outlier moves. In January and December, we should not expect many outlier moves. Heading into February, we may see an increase in trading activity.",
  "As we head into February and March, historically some of the biggest moves in the market have occurred in March. March is known for significant market fluctuations, such as in 2000, 2009, and 2020. It is likely that we may see similar trends this year. Interestingly, Tuesday has shown to have the smallest mean and median percent move for the Spy in the last 15 minutes of trading.",
  "It is interesting to note that Tuesday, not Monday or Friday, has the most outlier moves in trading. The blue and green highlight the mean and median of trading data.",
  "The difference between mean and median is significant. We often use the median because it is less affected by outliers. Let's move on to the next slide.",
  "Monday tends to have a tight trading range, especially in the last 15 minutes of the trading day. Tuesdays typically have the smallest range on average. Outlier moves are rare and large, with three standard deviation moves being very uncommon. Upside outliers are more painful than downside outliers. March tends to have the most outliers.",
  "March has the most outliers. Betting that the Spy trades within plus or minus half a percent of its 245 price was successful 95% of the time. Non-directional defined risk sellers can thrive in that time period. A 1% move in the SPX is $60.",
  "A 1% move in the SPX is equivalent to a $60 change. Dealing with large dollar moves is common, even if the percentages are small. It is recommended to trade SPX instead of SPY to avoid assignment risk, especially if something moves after hours."
]