[
  "Welcome to Option Trades Today. I'm Tony Batista in downtown Chicago at the Batcave. Let's discuss a trade on 1010, focusing on volatility in oil-related products. The S&P is down $13.",
  "The market is down with S&P down $13, NASDAQ down $36, Russell down almost 1%, and Dow down 120. The Russell is the weakest of the group. The Russell Ean S&P graph shows it at an extreme low, indicating a one-to-one relationship between being long Russell and short S&P.",
  "The relationship between being long Russell and short S&P or long Russell stocks versus short S&P is similar to the relationship with NASDAQ. The SL NQ shows a similar extreme, although not as large. This could be of interest to those looking for market divergences and considering buying the Russell.",
  "Russell may be a buy soon. Oil is up $1.37 today with a high IV rank of 89. The product is range-bound, especially around 82. Oil has a call skew. Look at November options closest to 45 days.",
  "When trading options, it is ideal to go closest to 45 days. The mechanics remain the same whether trading Futures or Equity options. Focus on the closest call skew, such as the at-the-money strike at 74 or 75. Remember, when trading Futures options, you are always trading the future at 74.",
  "When trading Futures options, always focus on the future month represented. The Z4 future is currently trading at $74, while the front month is trading at 7470. Ensure you are trading the correct future that aligns with your strategy.",
  "Ensure you are trading the correct future month. Oil prices tend to decrease as you look further out in time. This is different from the usual cost to carry pattern. Pay attention to skew when trading.",
  "The skew is evident in the at-the-money strike price of 74, with the future trading at 74.72. Moving $10 up, the option is trading around $160 on the offer.",
  "The 64 call option is trading for 82 cents, while the 84 call option is trading for almost twice as much premium. This indicates that the Delta for the 84 call option will be larger.",
  "Delta increases as volatility expands. This means that options will have a higher Delta when volatility is higher. When volatility expands or contracts, Delta becomes dynamic. This is important to consider when trading options.",
  "I'm going to look at OVX, which is the crude oil VIX Index. This shows the volatility in oil. OVX is a CBOE product that reflects oil volatility.",
  "The current oil price is around 34 or 35, with an extreme call skew. Taking advantage of this, I will be going back to the well for SLCL with a 1x two ratio spread.",
  "I took a $100 profit on a Pro product trade. Today, I will take on more risk by trading oil with high implied volatility and skew. I will aim for around the 15ish Deltas.",
  "I'm looking to take a bit more risk by trading the 18 Delta options. I plan to buy one 88 call and sell two 94 calls. I prefer trading whole numbers, even though the spreads are narrow.",
  "If all options have the same bid-ask spread, I will trade any strike. When options have wider spreads, I prefer trading whole number options as they typically have tighter markets. I got filled at 37 cents.",
  "Filled at 37 cents. 1 by 2 omnidirectional bearish ratio spread with massive call skew. Check out Bob the trader for more details.",
  "You can duplicate this trade on the T trade platform. Let's look at the trade page for CL. 97% pop, $30 a day in Theta Decay. This trade is almost 10 times the size of Uso, so a 1 by two ratio spread is like a 10x $20 ratio.",
  "The spread in Uso is a 10x $20 ratio spread contract, using $3,700 in buying power. Max profit could be $637 with a long 188 call and short two 90 calls and 94 calls. If oil pins at 94 at expiration, you would want to exit the trade.",
  "You'll want to exit the trade a week before expiration. Span margining increases buying power as expiration approaches. For example, if the stock is trading at $94, buying power can double to $66,000.",
  "The product would be worth $6,000 at expiration if the price was at $94, just below the $88 call. The $94 calls that you are short would be worth nothing, as you sold them for $370. This type of trade can be done in an IRA account on the trade platform.",
  "I am not aware of any other platform that allows you to short naked calls in an IRA account. You can be short naked calls in an equity in Tastytrade as long as you have the required buying power. The Delta here is close to zero, making this an omnidirectional bearish spread. The break-even point is slightly over $100, which oil has not reached recently.",
  "Oil prices have not exceeded $100 and have remained relatively stable for the past 36 days. The recent move from $66 to $80 represents a $14 increase, which is outside of the usual range. This trade has a high probability of success at $97, but there is always uncertainty in trading. It is risky to hold onto a position with a potential loss while waiting for it to become profitable.",
  "To be profitable, ensure you have enough buying power in your account. As the product price rises, the mid price may increase as well, allowing for a better fill. Aim for profit targets of $100, $150, $200, or $300. This spread should contract if oil prices decrease, making it an omnidirectional bearish spread with no downside risk.",
  "There is no downside risk in oil trading. Out of the money calls can help maintain profitability. Buying power can change with a $6 spread. For example, buying one 60 call and selling two 606 calls can increase buying power from $3,000 to $4,000. This is a product for experienced traders.",
  "This is a big Traders product, not for those with smaller accounts. Consider buying the 70s and selling the 76s one by two to simulate a $2 WID spread. Buying power increases to about $10,000 with span margining in Futures options, unlike in equity options.",
  "Options trading is different from equity trading. Make sure to research and understand the differences before trading options. Remember to start small and follow our rules for account size. We welcome accounts of all sizes at tasty trade. Open or transfer your account today.",
  "Support tasty trade to keep our content free for all traders, regardless of their brokerage firm."
]