[
  "We're looking at my DraftKings strangle. On the follow page, type in the symbol in the search bar to see all my DraftKings trades. You can view adjustments and the price of the underlying.",
  "Here you can see the price of the underlying and The Ivy rank. The actions include closing, rolling, buying the guts, and selling the wings. Focus is on the mechanics of the trade and holding the position in the underlying for the entire calendar year. Profits and losses are not the main focus.",
  "Throughout the calendar year, I traded various strikes by scalping puts and calls on the underlying asset. I maintained a similar position with one contract but adjusted the strikes as needed. The order chain on the platform shows the trades made with a Tasty Trade account.",
  "If you have a Tastytrade account, it tracks all the rolling and adjustments you make on a position in the same transaction. This tool adds up all your credits and debits to give you a net average trade price. This helps you determine your basis on your position, whether it be the same strikes or a new position.",
  "When you close a position, you are combining your realized profit and loss. There are two buckets of P&L: realized and unrealized. Rolling a position involves closing one position and opening a new one in the same or different expiration.",
  "The tool combines your realized P&L from closed options with your unrealized P&L from open option positions to give you a total. This helps you track your position. The focus is on showing how you can continue to roll a position, regardless of whether the stock goes up or down.",
  "Rolling a trade allows you to collect extrinsic value over time, regardless of the stock's direction. This can lead to profitable trades. You can find more information on rolling trades on the tasty live.com site.",
  "Which strike are you rolling to and why? How many Deltas are you aiming for? We aim to reduce overall Delta exposure by 25-50%. For example, with one contract trade for DraftKings, the maximum Delta exposure would be 100 if one option goes deep in the money. Each adjustment impacts Delta exposure.",
  "The price of DraftKings at each adjustment is shown at the top, with the net Delta change at the bottom. Rolling up a put results in a long Delta, with the difference between buying a 5 Delta put and selling a 20 Delta put being 15 Deltas. All adjustments made during this trade fall within a certain range.",
  "I made around 0-25 Delta adjustments during this trade, mostly aiming to reduce my overall Delta by 25-50%. On a one-contract trade, I can realistically reach a max Delta of 100. Rolling to pick up 20 long Deltas or short Deltas is my strategy.",
  "long 20 short Deltas dynamically with the stock price results in a 25-50% reduction in overall Delta. Transactions follow this pattern, with outliers highlighted in blue indicating significant underlying moves.",
  "We bought DraftKings in mid-June at 37.5 and it went up to 45, a 20-25% move in two to three weeks. I decided to reduce my Delta exposure by rolling up and picking up 30 Deltas on my transaction.",
  "I experienced a 25% increase followed by a 30% drop in the stock price. I had to decide whether to lean heavily directional with 70-80 long Deltas or reduce that Delta. I tried to maintain a balance in both directions for this position.",
  "reduce Delta exposure by making adjustments to add extrinsic value and reduce intrinsic value in a year-long trade. This helps manage risk and uncertainty in the stock's movement.",
  "Reducing Delta exposure by focusing on maximizing extrinsic value can result in a wide Break Even range at the end of the year. This strategy will be visually shown in upcoming slides. It is difficult to do nothing, but it is an option to consider.",
  "Is that an option for you? You can make that decision based on whether the stock has gone up significantly (consider going short) or down significantly (consider going long). It's fine for this position as we can't predict the future. My goal is to collect premium without leaning too heavily in either direction when the stock moves.",
  "When a stock moves, it can be difficult to know whether to take action or do nothing. Emotions can play a big role in decision-making. If a stock is down significantly, it may be necessary to take steps to reduce losses. It's important to make a decision and manage risk, even if it may not be the best choice in hindsight.",
  "hold a position through difficult times to manage it and collect more extrinsic value. The visuals are from the order chains on the Tasty Trade platform. Right-click on an order to pull up market snapshots.",
  "Pulling from your own trades is accessible for reducing Delta exposure. Adjustments aim to reduce overall Delta exposure by 25-50%. Slide five discusses IVR in this trade.",
  "We decided to hold this trade for the entire year instead of closing it multiple times during low volatility. We made adjustments throughout the trade to maximize profits.",
  "Throughout the trade, it's important to manage Delta and extrinsic value, even when volatility is low. Volatility changes can impact credits in the order chain.",
  "volatility plays a significant role in determining the size of meteor credits. When volatility is high, credits are larger compared to when it is low. This is especially true when transitioning from out-of-the-money to at-the-money positions to maximize extrinsic value. This results in wider Break Even zones, which are crucial. Moving on to slide six, implied volatility is another key factor to consider in trading.",
  "We always consider the actual implied volatility. IV Rank indicates whether the current implied volatility is high or low relative to the past year. This helps determine if the IV number is high or low for the underlying asset. For example, if a stock typically has 15-20% IV, we can assess if the current IV is within that range.",
  "Implied volatility of 15-20% with an IV rank of 5-10 may lead to closing a position. DraftKings has an IV of about 4 times that of SPX, which has an IV of 13-14%.",
  "The current implied volatility is about four times higher than SPX. With higher implied volatility, options premiums are significantly higher, allowing for wider break evens and more room for the stock to move. This results in a larger potential profit range.",
  "We focus on high implied volatility underlyings because they offer a wide range for the stock to move. This allows us to withstand significant price fluctuations. For example, if a stock goes from 35 to 50 (a 30-40% increase) and then drops back down to 30, we can still profit from these large price swings.",
  "5050 down to 30, then up 40% and down 50%, then up 30%. The trade settled five or six dollars higher. This is implied volatility. Not many stocks move like this, but you get paid for it. The stock ended relatively sideways.",
  "The stock traded sideways, allowing us to profit from the risk taken on this position. With higher implied volatility, such as 14-15%, like SPX, it is difficult to make money on trades with large fluctuations.",
  "A stock with 14-15% implied volatility may not be profitable if the realized volatility is higher. Higher implied volatility indicates a larger potential price swing. It's important to monitor both to make informed trading decisions.",
  "higher the implied volatility, the more you get paid to take on risk. For example, in DraftKings, the December 19th 2025 cycle has a $14 move. If the realized move is less than 14 points, implied volatility has overstated realized volatility.",
  "Realized volatility in SPX is currently expected to be 700 points through next year. With SPX at 6,000, if it reaches 7,000 to the upside or 5,000 to the downside, realized volatility would exceed implied. Long-term expirations do not exhibit near-term implied volatility, so compounding the 30-45 day premium would result in even higher returns.",
  "When selling premium in options trading, it is beneficial to stick to the 30-45 day range. This is because there is typically higher implied volatility in the near-term cycles compared to longer-term cycles. By looking at longer-term cycles, you can determine the baseline range for implied volatility. This can result in higher premiums, especially when compared to other trading options like DraftKings or SPX.",
  "using options to trade it could be a profitable strategy.",
  "next year, if volatility remains at 40-50% and you sell premium, you are likely to make money. Selling premium on high volatility underlyings allows you to profit from the difference between the volatility you are paid and the volatility realized in the market. This strategy can be profitable over time.",
  "We look for high volatility underlyings. One of the adjustments we can make is going inverted, buying the guts, or selling the wings. It's all about extrinsic value and selling volatility. The goal is to have realized volatility come in less than implied volatility.",
  "If the implied volatility is lower than expected, it doesn't matter if some options were in the money at times. By collecting enough extrinsic value through rolls, losing trades can be turned into winning trades. This is a year-long trade strategy.",
  "This is an example of collecting premium over a year-long trade. By staying in the trade for this duration, you can see how the premium collected compounds over time. The chart will show a consistent increase in premium collected.",
  "collected more premium by compounding it throughout the year. I started with a $200 strangle and ended with an extrinsic value credit of around $1,100. I received a 215 credit on the first trade and bought back my last trade at a 244 debit. This allowed me to realize the value of all the credits I accumulated throughout the year from various trades.",
  "buying calls and puts, starting with a straddle with $4 in premium and ending with a total credit of $1,800. Check out the archive for more options trading concepts on tasty live.com.",
  "can find my trade in DraftKings. It involved multiple transactions throughout the year, similar to Nick's. Let's dive in and discuss the details.",
  "On the Tasty Trade follow page, you can view all adjustments made to a trade from the beginning. The opening trade had a 57% profit potential. Throughout the year, the trade was manipulated as the stock price moved. The trade was opened for almost $4 with a straddle at the 35 strike.",
  "As the stock price moved to the 35 strike, it was right at the money. The original column shows the price at the time, while the now column shows the current trading price. The at the money straddle collected $4. Starting with a straddle allowed me to maximize my extrinsic value credit received throughout the year.",
  "Straddles provide more potential than strangles in certain situations. For example, DraftKings did not have any skew to exploit with a strangle. However, with significant call skew in ibit, starting with a strangle might make more sense as it allows for going further out of the money to the upside without facing the same challenges.",
  "For a deep in the money option, consider starting with a strangle depending on the stock's position. Check out the order chains for different products to analyze your own.",
  "From the lower left, the opening trade was a 35 straddle for February. It was manipulated to a 35 straddle and rolled out from February 2 to February 16 for $2. The trade kept rolling out until it eventually went inverted to the 38/41 inversion, which was rolled out in time for $2 in premium. The put strike was adjusted up to the 43 strike put.",
  "I was assigned on the 43 strike put and decided to take the shares at 43. The stock had dropped significantly, but I had collected premium and could sell a covered call against the shares to manage risk. Mike could have rolled out the put in time for a few pennies.",
  "Roll out the trade for a couple of pennies instead of adjusting the extrinsic value. Keep the static Delta to maintain the position's risk perspective. This provides a static Delta to the upside for a strong reversal.",
  "I have static shares against the short call in a straddle, which poses upside risk. Rolling a deep in the money option forward may not yield much time value if collecting pennies.",
  "If you get a big move, your option that was previously all intrinsic value will now be at the money, holding both intrinsic and extrinsic value. The extrinsic value is against you because you have to buy it back.",
  "At a certain point, an option may only have intrinsic value, making it essentially the same as owning the stock. When the stock has moved significantly lower, the option may only be worth pennies when rolling it. When selling premium, you are collecting extrinsic value.",
  "When trading options, it is important to consider the extrinsic value you are collecting to justify the risk. Without extrinsic value, it may be more beneficial to hold shares with a static Delta. By collecting extrinsic value, you can lower your basis on shares and mitigate potential losses.",
  "I kept the shares at $43 and sold all the options, keeping the extra intrinsic value collected. I rolled the 38 strike down to $35 for a dollar and then rolled up and out.",
  "Rolling up and out involves moving extrinsic value from a near-term cycle at a lower strike to a further dated cycle at a higher strike. This can increase profit potential for your shares. For example, I did this for a 40 cent credit, giving my shares an additional $100 of profit potential by moving from a 35 to 36 strike.",
  "40 cents of credit is ideal for keeping shares and avoiding a short call going in the money. Make sure the short call still has extrinsic value. Offensively rolling covered calls can be found on Tasty Live. Rolling out in time a couple of times, moving from October to November, can pick up a dollar.",
  "In November, the price moved from November to December, gaining a dollar. DraftKings was at around 43-44. The short call had no extrinsic value, so I closed the position, making $1,123 overall with a small gain in the shares.",
  "I sold premium below the $43 level by collecting over $1,000 of extrinsic value, allowing me to have a basis well below $43. This flexibility is possible with a high volatility underlying, where you can sell premium below the strike price as long as you have a significant amount of extrinsic value.",
  "looking for lower implied volatility when trading options. For example, with DraftKings, you can roll further out of the money on a short call. In a different scenario, if a 35 straddle started at $4 and the stock dropped to $15, it may be best to hold onto the shares and wait.",
  "I took the shares at 43 and had already picked up a ton of Premium. If you don't have a lot of Premium, you can't sell below your basis. Having a lot of extrinsic value gives you more flexibility. My break even was at 27-28, so selling at 35-36 was profitable.",
  "At 27-28, selling at 35-36 puts me above my break-even point, despite buying at 43. I appreciate your adjustments, particularly the focus around the 21-day mark. Your approach is more mechanical compared to my scalping calls.",
  "An example of a trade for those who can't be in front of their computer all the time is to make 200% return on capital with just one trade a month. It may not always be this successful, but it shows that trading doesn't require hours of monitoring.",
  "trade without constantly watching the ticker. Size and experience play a role in being able to trade this way effectively.",
  "Being flexible and managing risk is important when trading short puts. Rolling a short put perpetually can be a hands-off, high probability trade. It's crucial to size your trades correctly so you can take on the shares if needed, eliminating headaches and avoiding the need to close the short put position.",
  "If selling a put and planning to close it if it goes in the money, a put spread is recommended to avoid undefined risk. Having the correct size allowed flexibility in trading decisions.",
  "We sold high implied volatility throughout the year. The stock came in under its projected implied volatility. DraftKings opened at 34, reached 49, and dropped to 28.",
  "At 34, reached 49, dropped to 28, now at 44, up 10 points from open. Collected $4 premium a year ago, now up $10, showing lower realized volatility than implied. Market snapshot available on order chains.",
  "On your order chains, right-click on any underlying to access the View Market State snapshots for a deeper analysis. The top shows Delta and the bottom shows stock price movement throughout the year.",
  "The price of the product fluctuated between 30 and 50 throughout the year, showing high volatility. Despite the risks involved, the premium paid reflects the potential for significant moves. The Delta remained relatively stable, with occasional spikes and drops.",
  "DraftKings stock dropped from 50 to 20 at one point, with a brief increase to 40 in February. This may have been due to earnings. Consider adjusting strikes and picking up long Delta rolls during these fluctuations.",
  "I rolled up to the 43 strike put from a 35 straddle to a 41-38 inversion, shifting from short Delta to positive Delta. The rest of the trades are similar, picking up 10-30 Deltas, always under hedging.",
  "contrarian adjustment to the stock going up. Rolling up a put instead of fully buying. Adding a small 20-30 Deltas adjustment, not a 50-70-80 Delta adjustment. Always under hedging, starting with a 35 straddle and eventually moving to a 38-41 inversion.",
  "I entered a 3841 inversion when the stock was at 42. I kept my inversion minimal, with 750 in premium and a $3 wide inversion. I rolled out from April to May and picked up another $2, bringing me to a total of seven.",
  "I made $9 in premium on a three-wide inversion trade. With $1,100 in premium and the 3843 inversion, the stock has a big range to move without me losing money. I continued to pick up more premium as the stock chopped around.",
  "The premium remained stable, hovering around the same level. Delta stayed close to zero, with a range of plus or minus 30 Delta, except for one adjustment. Each roll kept me within 30 Deltas on either side of the market, whether bullish or bearish, focusing on extrinsic value.",
  "I focused on extrinsic value, time decay, and IV contraction to avoid big directional trades and widen break evens. IV rank in DraftKings has been volatile, ranging from 10 to 40 around earnings.",
  "The stock has seen spikes from 10 to 40 around earnings. Without earnings, the implied volatility rank is at 30-40. Volatility swings are positive as they allow flexibility to roll and adjust positions.",
  "you can adjust positions based on changes in implied volatility. The current IV rank for DraftKings is at a low of -0.1, indicating a decrease in implied volatility for the year.",
  "IV levels to consider when trading are 40%, 50%, and 60%. These levels indicate decent premium and lower buying power requirements. DraftKings offers high return on capital potential due to its favorable IV. Trading a strangle or straddle with a $600 investment can yield a $3-4 profit.",
  "Start the trade. DraftKings currently has an implied volatility of 40-45%, which is the lowest it has been all year. This is a good IV environment for trading. Avoid equities with IV of 25% or less, as they are not ideal for short premium strategies.",
  "High volatility is important in trading because it allows for greater profit potential. Holding high-risk equities without being compensated for that risk can lead to losses. In contrast, stocks with high volatility can result in significant gains, making it a key factor to consider in trading decisions.",
  "If you want to sell premium in a higher volatility stock, it can be potentially profitable. Our trades typically follow this pattern with the stock price fluctuating.",
  "The green dotted lines from the start to the end of the trade expand above and below the stock price. The initial break-even point was between 38 and 48, with a 35 straddle and $4 premium. At the end, the break-even points were below 25 and above 54. DraftKings would have had to go up 50% for me to lose money at the end of the cycle.",
  "the expected range, you can profit from collecting short premium consistently. It's important to keep your position size small and trade high IV products to manage risk effectively. This strategy allows you to stay in trades longer and benefit from market fluctuations without extreme price movements.",
  "Focus on trading a product that stays within implied volatility. Making multiple adjustments throughout the year to pick up credits and widen break evens can help offset intrinsic moves against you. Collecting extrinsic value makes it harder for the stock to beat you. Ultimately, it all comes down to implied volatility.",
  "Implied volatility is key in trading this stock over a year. Selling volatility means projecting price movement between 60-70%. The stock needs to go up or down 80-100% to lose money on this trade over a year. In the short term, it needs to move significantly to be profitable.",
  "In the short term, you may experience losses over one to three months, but that doesn't guarantee a loss over a year. Understanding realized volatility compared to implied volatility is key. For example, with a 20% implied volatility stock moving 25-30%, you lose money. But with a 60% implied volatility stock moving 20-40%, you make money. This trade was successful.",
  "This trade involved a 36 covered call with no upside risk. If not exiting at the end of the year, rolling up and out would have been considered.",
  "I planned to exit this trade at the end of the year. I had a 36 strike short call against my shares when the price was near 36. Consider moving the call to January and up to 40. For example, if you have a DraftKings covered call at 45, you could buy it back for a dollar and move it to January or February at 49.",
  "You can roll up the 45 in December to the 49 in February to collect another dollar. This allows you to manipulate covered calls and give yourself more room to breathe. If the short call is at the money, you can roll it up and out to increase extrinsic value.",
  "Give yourself more room to breathe for those shares. It was a nice trade that didn't explode at the end of the year. Good job."
]