[
  "Welcome to the life cycle of a trade series where we cover trade entry, adjustments, and closing orders. Today, we will discuss a poor man's covered call trade. With the market up, low volatility, and Target trading at $130, we are looking to enter a new trade in this portfolio.",
  "Target stock is currently trading at 130 after dropping from 155 following its recent earnings. The stock has bounced back slightly, but looking at a longer-term chart, we can see it has reversed years of price movement and is back to early 2021 levels. This could be a good opportunity to take a long position.",
  "Adding a long Delta position in this portfolio with a Poor Man's covered call strategy. This is a more capital-efficient way to be long the stock and short a call. Buying stock in a margin account provides about 2:1 leverage. For example, buying 100 shares at $30 would use $13,000 in cash value.",
  "The cost per share is $130, resulting in a $13,000 position with $6,500 in buying power. Selling the call reduces buying power slightly to $6,200. This strategy is capital intensive, especially in a margin account.",
  "In a smaller account, it's important to be capital efficient while maintaining position or Delta. A poor man's covered call involves going further out in time, like 50 to 90 days. Consider being long a call that is in the money with a Delta between.",
  "When the Delta is between 80 and 95, the option is more expensive. The further in the money you go, the more intrinsic value the option has. Extrinsic value is equal to the out-of-the-money put. For example, buying a 110 call would cost around 51 cents.",
  "you would be paying around 51 cents over the intrinsic value of this option, making the cost of the long stock position $51. I plan to use a maximum of $11,000 for this trade, considering my position and capital efficiency. I will choose the 120 strike option.",
  "I'm considering the 120 strike for a lower Delta. Short call should be in the 30 to 50-day timeframe, long call in the 50 to 80-day timeframe. Looking at selling the 135 strike in January for $3.",
  "Selling at $3 uses about $1,000 in buying power. Total of 36 Deltas, with the option Delta at 38. If long stock and short call, net 62 Deltas. Using 20% of capital compared to long stock and short call. Lower Delta exposure than covered call.",
  "My break-even point is around $130, with an extrinsic value of zero on this position. The risk profile resembles a typical covered call, with profits above $135 at expiration.",
  "risk profile above 135 there's no more profits to make. Break even to the downside is at 120 due to capped risk. Synthetically long a put without physical shares, a capital efficient way to belong the stock for a decent amount of time. Position filled at 1065, break even at this level.",
  "We are breaking even with the stock price at Target. The stock has rallied six points in one week, reaching 136. We will close our poor man's covered call position by buying back our January 135 call option and selling the synthetic stock.",
  "We will be selling to close the synthetic stock position with the 120 call we had in February. The current price is $12.90, resulting in a profit of around $225. The significant move in Target has led to this profit. We had a sizable long Delta going into this trade. Let's aim for $12.85 to get filled.",
  "Let's go for 1285, got filled at $220 profit on this poor man's covered call - synthetically long the stock, short the call."
]