[
  "Welcome to Option Trades Today. I'm Tony Batist. On December 5th, 2024, the market is showing a tight range with Entps down four handles. The Emin snps had a range of only 10 points overnight, which has now increased to about 14.5 points. This indicates a relatively tight range in the market.",
  "The market is in a relatively tight range with some stocks moving today. NASDAQ is down 20, Russell down 15, and Dow down 100. Volatility is low at 1455, with little change expected.",
  "Volatility at 1470, bonds down seven ticks. Checking the watch list for high option volume. Also keeping an eye on the bat watch list for stocks and futures. Tom's list at the bottom for reference.",
  "We prioritize Tom at the bottom because cream rises to the top. The bat watch list is higher than the Tom watch list. There are various crypto products, dividend Aristocrats, dividends, earnings, Futures, market indicators, and high option volume list to consider.",
  "I am currently looking at various market indicators. I found a stock, SMCI, with high option volume and recent news coverage. The stock has rallied back to $41 after dropping into the teens due to accounting irregularities. Volatility and IV rank remain high.",
  "Volatility in SMC High is currently around 42, lower than when Ivy rank was in the 60s and 70s. The stock is at a higher equilibrium after earnings, typically in the 20s. It remains high due to ongoing activity. Let's locate SMCI on the list.",
  "SMCI has dropped 11% in the last five days, which is a significant move to the downside. I will be executing a Batwing trade, which has a synthetic strangle element to it. The Ivy rank is currently at 42.",
  "Ivy rank of 42 is relatively high compared to other stocks without earnings. One example is boil, a triple leverage natural gas product that is difficult to trade profitably due to its volatile nature. It is challenging to make money or sell premium in this stock.",
  "It's difficult to sell premium without earnings with an IV rank over 40. One $8 stock to consider is SMCI, currently at an IV rank of 42.6, down 11 over the last 5 days. Consider this trade cautiously and look for a green IV rank before entering a volatility trade.",
  "Let's look at January options with 43 days left. Stick to the most liquid ones around 45 days for optimal trading. The stock has shown good movement. Consider an omnidirectional double ratio spread or batwing trade. Check the Delta to determine the desired stock direction.",
  "I am trading a 1 by 2 ratio spread by buying the 62 call and selling two of the 65 calls for $117. The 20 Delta is over a standard deviation move to the upside due to call skew.",
  "There is call skew when doing the put spread. The credit will not be as high and the trade will be closer to at-the-money stocks. The spread is $3 wide, with a potential max profit of $417 for a $1,200 risk.",
  "If the expiration date is still far off, you could potentially make $3 on this trade in addition to the $117 you sold it for, totaling $4.7. This would be a short Delta play with a max profit of $65, which is $24 higher than the current price of SMCI. With a Theta Decay of $5 a day and a 91% probability of profit, there is risk on both sides. It's a good learning example, but keep in mind that your potential profit may decrease.",
  "The stock is expected to decrease, resulting in higher credit and maximum profit. However, there is increased risk on both sides. Theta will increase, Delta will decrease, and buying power may slightly decrease.",
  "I will buy one 32 put and sell two 29 puts at a mid price of $1.89.",
  "stock continues to rally, I may adjust my entry price accordingly. It's important to be patient and strategic when placing trades in volatile markets like this.",
  "I entered at 187 with the mid price at 189. I got filled at 185. The trade has a 76% probability of profit. The credit received and Theta both increased significantly.",
  "When selling premium, aim for high Theta Decay and a probability of profit over 65%. A decrease in Delta from 15 to 8 or 14 to 8 is ideal. Max profit increases slightly with the amount of credit received. For example, receiving around $1.15 on a call spread and about 70 cents on a put spread.",
  "Getting about 70 cents on the put spread. If bearish on SMCI, consider only the call spread. If bullish, move up a couple of strikes to collect more credit. Buying power decreased to 1356 as predicted. Like this trade and the Greeks. Wish I was getting filled.",
  "I entered the trade around $190. There is a pattern forming that resembles a bat wing, with potential upside around $66 and downside forming another bat wing.",
  "The little batwing is going higher, so keep an eye on it. Consider transferring your account to Tasty Trade, the top brokerage firm. They are offering money for new accounts. Bring all your positions, as they transfer in kind.",
  "Transfer in kind is a faster option than cash when trading. Tasty Trade is supported by the brokerage firm, allowing all content to remain free. Support the brokerage firm to support Tasty Live."
]