[
  "Welcome to Option Trades Today. I'm Tony the Baptist with a trade idea for January 23rd, 2025. The S&P is up $9.75 and NASDAQ futures are also up. Let's dive into the market.",
  "NASDAQ futures are down $55, Russell is up slightly, and the Dow is up 244 points. Volatility is down 31 cents, which typically boosts the market. Yesterday, volatility was higher due to economic data impacting bonds.",
  "The recent event likely impacted bond prices and market volatility. To find a trade, I review my watchlist and exclude any stocks with upcoming earnings. This helps me focus on potential trading opportunities.",
  "I will focus on options with significant implied volatility changes over the last 5 days. Delta Airlines shows a 2% increase in implied volatility, making it a potential candidate for trading. American Airlines also experienced a similar change.",
  "American Airlines recently released earnings, while Delta Airlines is scheduled to report earnings after April expiration. Delta Airlines has an Ivy rank of 36 or 37 and has been trending upwards. Consider a skewed iron condor strategy using March options.",
  "The implied volatility rank is 39, which is considered good. The stock has a $6 expected move, making options around the $6 higher mark attractive. Consider options around the 15-23 delta range, such as the 72.5 or 75 strike.",
  "I default to the 23 delta here. If I go down by $6, I expect to move at 60-62 delta. To achieve a profit of 59-60, I may need to go out another strike. To aim for a 65+ pop, I would need to sell options that are above a dollar.",
  "Stocks under a dollar may require a limited amount of buying power, around $700 or less. It may not be the best use of capital to aim for a profit of just a dollar. Consider a delta neutral trade, such as shorting five shares of Delta Airlines in a smaller account.",
  "I considered a reverse Jade lizard strategy by selling a put spread. I aim to collect one-third of the width of the strikes. However, the low implied volatility limits my options. I may need to sell at the money to collect a significant premium.",
  "$5 unless I'm going really at the money with a tight spread. I decided to trade Netflix post earnings. The implied volatility rank is low at 177%, so I'm changing my strategy.",
  "IVX has decreased by 18% in the 5 days following earnings, indicating lower volatility. Monthly implied volatility is also low. Considering the stock's post-earnings pop, it may be a good opportunity to fade it. Consider entering the trade with the stock up $24.",
  "With the stock up $24, let's discuss the hidden risks of this trade. I will be doing a broken wing butterfly on Netflix. When analyzing option pricing, it's important to recognize skew, whether it's put skew or call skew. This is especially prevalent in products like ETFs such as SPY.",
  "ETFs like SPY typically exhibit put skew, while high-flying stocks like Netflix, Tesla, and Apple often have call skew. Call spreads are cheaper to trade when a stock has call skew, while naked options are more expensive. Selling naked calls can yield high premiums, while buying call spreads is a cost-effective strategy.",
  "They trade cheap because the expected move is large. Skew is evident when comparing options at different strike prices. Calls at 1,080 are around $12, while puts at 880 are around $8.25.",
  "The puts are trading around $8, $4, $3.50 with call skew equal distance away from a $100 expected move. There's an $80 expected move in March with 57 days. I will focus on March with 57 days as the monthly options in February with 29 days are too short dated. I plan to buy one call spread and sell a naked.",
  "buy one call spread and sell a broken wing butterfly in Netflix. Focus on high probability of touching the target number.",
  "I aim for a 50% probability when trading spreads. I will buy a 1040 call with a 30 Delta, which gives a 60% chance of reaching 1040 in the next 57 days. The spreads have a $20 width between strikes.",
  "When trading broken wing butterflies, ensure an equal distance between strikes. For example, buy a $20 wide spread and sell double the amount of a $40 spread. Purchase the 1040 1060 $20 spread once.",
  "I am buying one 1040, selling two 1060s, and buying one 1140. The spread is $20 wide by $40 wide, risking $80 to make $120 with a max profit of over $2,000.",
  "I sold a spread for $157 when the stock was around $19. I monitored the stock's movement and placed my order slightly above the mid price. If the stock is now at $24, I would aim to sell the spread at $2.",
  "filled at $2, placing an order at $2 and adjusting down to $1.95, then to the mid price of $1.88. If not filled, go 5-7 cents below mid price. Max profit potential is $2,177, including credit received and strike width. Buying power of $18,000 yields a max profit of $21.80.",
  "The pin at $1060 is small at 10%. By looking at a butterfly with equal distances of $20 away, we can determine the probability of pinning at $2000. I aim for a break-even point around 1080, which aligns with the standard deviation line.",
  "The dotted line indicates my expectation to make a profit of at least a dollar on this trade. The green line shows that there is no downside risk due to the defined risk trade. I am aiming for the stock to gradually move to the upside.",
  "I want the stock to slowly climb, sit, or go down. I want time to pass or for the stock to decrease. The out-of-the-money spread loses value while the in-the-money spread gains value. Lower volatility can cause the spread to decrease in value. With low IV rank, I won't take that risk.",
  "I am not willing to trade at such a low price. There is some added risk due to the stock being around $1,000 and the possibility of a split. A stock split can be slightly bullish and increase the number of contracts held.",
  "After a stock split, the number of contracts you hold will increase. For example, if a stock splits 10 for 1 in the next 57 days, a 10 by 20 by 10 spread would become a 10 by 20 by 10 spread. The credit received would remain the same at $1.90. No change would occur in buying power, only in the number of credits held.",
  "Some reasons for making or not making a trade, potential pitfalls, and the importance of transferring positions to Tasty Trade to support the platform and keep content free.",
  "Content is available to you 24/7 with your support."
]