[
  "Portfolio allocation should prioritize risk management. Consider adjusting allocations to minimize risk exposure. Conduct a back-of-the-envelope calculation for equities portfolios to ensure a balanced approach.",
  "This strategy is more suitable for an equities portfolio. It may require adjustments when applied to options trading, considering position size and risk measurement. Despite its classic nature, the concept remains intriguing. Let's delve into it.",
  "Today, I want to discuss Modern Portfolio Theory as a method to determine portfolio weights based on risk allocation rather than capital allocation. It is an interesting concept that can help diversify a portfolio effectively.",
  "A portfolio allocation strategy focuses on capital allocations to achieve a specific level of risk, reward, and diversification. For example, a moderate growth equities portfolio may consist of 60% stocks and 40% bonds and metals.",
  "Our portfolio consists of SPY, QQQ, Apple, TLT, and gold, with 20% allocated to each. The capital allocations are equal across all assets. The risk contributions may vary, as they are calculated differently from volatility risk contributions.",
  "When analyzing risk contributions from 2015 to 2022, it is evident that SPY, QQQ, and Apple have higher risk contributions compared to TLT and GLD. This aligns with expectations, as these assets have lower volatility. Allocating 20% of capital to each asset would result in Apple contributing more risk due to its higher volatility.",
  "The total portfolio volatility is 13.7%, with Apple contributing about 5% of the risk. The NASDAQ and Spy also contribute significant amounts of risk, while TLT and gold contribute very little. The goal of a risk parity portfolio is to have all components contribute equally to the overall portfolio risk.",
  "risk parity portfolio focuses on allocating risk rather than capital. This portfolio has a volatility of about 10%, with 2% coming from each asset. There is a greater emphasis on TLT.",
  "In a risk parity approach, TLT and GLD are emphasized more while less is allocated to Apple, NASDAQ, and SPY. Calculating the weights for a risk parity portfolio involves a complex numerical optimization problem. More details will be discussed on Bad Trader.",
  "risk-adjusted return by allocating capital based on the volatility of each asset. This approach aims to achieve a more balanced risk exposure across the portfolio. Let's dive into a numerical example to illustrate this concept.",
  "The goal is to give higher weight to lower volatility assets and vice versa to even out risk contribution across assets. This is not as precise as actual risk parity, but it's a decent estimation. The equation for determining asset weights will be shown with numerical breakdown shortly.",
  "The weight for each asset in the portfolio is calculated by taking one over the volatility of the asset divided by the sum of one over the volatility of all assets in the portfolio. This equation is used for n assets in the portfolio.",
  "It's important to consider the differences in measuring risk between equities and options portfolios. Options require a different approach due to their unique characteristics.",
  "returns for each asset in the portfolio. This will give us an idea of the volatility of each asset.",
  "To calculate the standard deviation of daily returns for an asset like SPY, historical volatility is around 1.14%. For comparison, QQ is 1.40% and Apple is 1.83%. You can also use implied volatility (IV) instead of historical volatility. Measure risk first before using the formula provided.",
  "For equities, we use standard deviation to calculate risk. We plug the weights into the equation. For example, for SPY, you would take 1/1.14 and divide it by the sum of 1/1.14, 1/1.40, 1/1.83, etc. This would result in about 20% as your risk parity portfolio.",
  "You can approximate a risk parity portfolio by allocating about 20% to SPY. Use either annualized or daily volatility for all assets, as long as they are scaled the same way. You can also use notional times volatility for allocation.",
  "If you apply the volatility approach to equities, it can be inclusive for all types of traders. This strategy is similar to other options trading strategies but with different metrics. By applying this approach to all assets in the portfolio, it moves us closer to risk parity.",
  "This backtest from 2015 to 2022 shows risk contributions are closer to even. Higher weight is given to TLT and GLD at 25% each, with Apple at 12%, and SPY at 20%. Risk contributions are more even but not as close as actual risk parity.",
  "The RIS parity may not be exact, but it is a simple and easy way to get closer to it. Online tools can help with the calculation.",
  "The process is interesting and looks better than equal weight. One drawback is that it doesn't consider expected returns goals, focusing on equalizing risk contributions for a more stable portfolio with a higher sharp ratio.",
  "Stable returns over time depend on your investment goals. Consider expected returns when using diversification and weight techniques. Use them in conjunction with other strategies, especially for options trading where risk measurement differs.",
  "Risk parity portfolio allocation focuses on allocating risk rather than capital, aiming for each asset to contribute a similar amount of risk to the portfolio. While true risk parity is complex, a naive approach can approximate these weights.",
  "Next week, we will focus on bad trader behavior during live streams and discuss the methodology behind true risk parity, including covariance matrices. This week, we will approximate weights using a back-of-the-envelope calculation that emphasizes lower volatility assets."
]