[
  "Welcome to the life cycle of a trade series where we discuss trade entry, adjustments, and closing orders. In this video, we will cover a naked put trade for the Johnny Trader portfolio. Looking at the S&P 100 list, chip names are moving up while payment stocks are mixed. Let's make a couple of trades.",
  "a potential candidate for selling naked premium. Another stock to consider is Square, trading at 85 with an iv rank of 75. Both stocks are within the desired price range and have high iv ranks, making them suitable for the strategy.",
  "With an IV rank of 69, Shopify has been trading range-bound recently. I plan to sell a naked put for the August expiration, despite upcoming earnings.",
  "I will be focusing on August expiration and targeting short puts with a 20 to 30 Delta. The UH 60 strike put is trading at $2 and requires about $700 in buying power. I have sufficient capital on the sidelines to take on this trade.",
  "Looking at a naked put with a 25-27 Delta, high Theta, and a max profit of around $2 using $700 in buying power. Looking to manage the trade for a $50-$100 profit over the next few weeks. Placing an order at 212. Closing order on a shop naked put put on last week.",
  "Last week on July 10th, we sold a put at $212 when the stock was trading at 66. It is now trading at 69, showing a 5-6 point price movement to the upside. IV rank has expanded during this move.",
  "The option had a 26 Delta and has now gained a profit of $63, about 30-40% of the max profit in under a week. It's time to close this trade and open up the August expiration. We've lost about eight Deltas due to the up move.",
  "The option is cheaper due to the up move. Click the ask to buy the option. The mid price is $50 for the 60 strike put. If filled, there will be a $62 profit. Closing order for the short naked put is $150. Nice stock move resulted in a $62 profit, about 30% of max profit with minimal buying power.",
  "Another successful trade for our Johnny Trad portfolio with a nice return on capital. Tune in to Johnny Trades every Wednesday at 9:40 a.m. on Tasty Live to catch these trades live."
]