[
  "explored the benefits of wider wing widths in iron condors for lower risk trading.",
  "Traders often debate about account size when setting up an iron condor. Factors to consider include selecting strikes, contracts, and wing width. Typically, traders go 45 days to expiration and manage at 21 days. Using 10 years of data, we compiled statistics to provide additional insights.",
  "Consider the width of the strikes when executing an iron condor. Compare win rate, SAR, buying power, return on capital, and cumulative performance of average P&L. Middle-of-the-road players typically use 5 or 10 strikes wide.",
  "We are middle-of-the-road iron Condor traders, typically using a $10 range for our trades. This allows us to trade higher-priced NASDAQ stocks effectively.",
  "When trading strangles, we typically stick to 20-25 Delta for the short strike. Wider wings mimic the same Delta strangle performance more closely, while tighter wings result in a lower win rate and premium collected. Wider wings also require more buying power.",
  "Our buying power is currently at around 25% of the premium we would typically take in.",
  "If you're trading three Deltas, you're using $300 for a $6,000 strangle, which is a 20 to 1 ratio. Aim for around a 10 Delta, which is about 20-25%, for a more sensible approach to defined risk trades. Avoid using a 1/12 ratio and opt for a 1/4 ratio instead.",
  "Using a back-of-the-envelope calculation, we aim to collect enough premium. A 52% win rate is not ideal, as we prefer to be in the 60s. The cumulative P&L over time shows the performance of different wing widths with the iron condor strategy. Two lines are below zero with no clear reason.",
  "When trading, avoid assets with negative returns below the zero line. Focus on assets with positive returns, such as those above the 10 Delta and 13 Delta lines. This pattern is consistent, except during extraordinary events like the pandemic.",
  "The pandemic dragged down the averages, but wider spreads have been more profitable. Tight iron condors have lower risk but may lead to negative returns over time. Cumulative PNLs show the impact on buying power and capital deployed.",
  "Cumulative gains over time differ from traditional trading analysis. The strangle showed the most positive results. We prefer undefined risk but typically stick to a 10 Delta. The study showed the worst losses.",
  "Based on the study, the worst losses are in line with expectations. It is advisable to avoid Delta widths and narrow width iron Condors with a negative long-term profit and loss. While it may be tempting to minimize initial investment, it is important to consider the potential risks.",
  "It's attractive to have low buying power with tight iron condors, but their low average P&L, negative return on capital, and win rates don't justify consistent use. Increasing the wings on trades can replicate the performance of a strangle while using less buying power.",
  "Using options allows you to define and limit your risk while using less capital than buying the underlying asset."
]