[
  "Open to 90 minutes minding your zero GTE. Zero DT markets in liquid underlyings are fast and exciting for retail option traders. Experienced traders know that careful attention and rapid management are keys to success in the zeros.",
  "The initial performance of a zero DTE trade within the first 90 minutes is crucial. Historical data shows that trades typically go awry after 12:00. Using zero DTE strangles at market open with varying amounts ($10, $20, $30) can be a successful strategy.",
  "After 90 minutes, we checked positions that were $10, $20, and $30 out of the money. We separated results between those up and down, and considered closing or leaving positions alone. Reentering after 90 minutes performed better than leaving them alone.",
  "Closing trades after 90 minutes has been my experience. Managing winners is key - close out at 90 minutes for a high win rate. If you have to stay in, consider reentering. Keep in mind that naked short options require significant buying power.",
  "naked short options are buying power inefficient, so it is recommended to purchase wings that are farther from the money to reduce buying power and daily P&L impact by 5 to 15 cents, depending on the amount of buying power committed. Buying the wings typically results in a 10 to 15 cents worse trade outcome.",
  "If you buy wings from a month back, you may experience a slight decrease in profit. Our DT mechanics suggest closing positions at 25% of max profit, sometimes within the first 90 minutes. We analyzed three triangles $30, $20, and $10 out of the money and calculated the average P&L at 25% profit. We also looked at the win percentage at 90 minutes.",
  "The new data shows a win percentage of 94% and an average P&L of 251 for 20 Delta strangles at 90 minutes. The average P&L at 90 minutes is 263.",
  "At 90 minutes, the average P&L is 263, with a win percentage of 94%. Holding trades until close drops win percentage to 71% and average P&L becomes negative. Holding trades without reentry results in two out of three P&Ls being negative.",
  "We analyzed winners and losers at 90 minutes, focusing on a naked zero day trade with a close to 80% increase. The trade was $30 out of the money with a win percentage and average P&L at 90 minutes being high. The win percentage and average P&L at close were also favorable.",
  "The win percentage for reentering trades at close was 79%. The average P&L at close for reentering trades was negative. Reentering losers after 90 minutes turned out to be winners.",
  "The trading results show a 68% win percentage. The average trade duration is 90 minutes. Let's move on to the next slide to review the 20 Delta numbers.",
  "20 Delta out of the money strangles tend to perform better than 10 Delta strangles. It is important to stay away from the at the money strike to avoid larger losses.",
  "The first hour and a half of trading can be crucial for short premium positions. When a trade reaches 25% of Max profit quickly, consider closing it immediately. It can also be profitable to close winners at 90 minutes, even if they are less than 25% of Max profit.",
  "reentering POS losing positions after 90 minutes appears to be promising. Holding through expiration was successful, but there hasn't been much back and forth action in the market over the past 18 months. Reentering in the same type of market conditions could be beneficial.",
  "If you reentered losers, it worked out. If you reentered winners, it was less effective. It's better to take profits and walk away. Let's take a quick break and come back with Scott Sheron from Tasty Trade World Headquarters."
]