[
  "We're discussing the importance of speed over size in trading volatile stocks like Nvidia. Recent outlier moves in certain stocks can be detrimental to short premium trades. For example, Nvidia dropping from $1550 to $120 is difficult to defend against a $30 move when the expected move was lower.",
  "The stock moved $30, double the expected move of 15, causing volatility in Nvidia to increase. This is not ideal for short premium trading.",
  "I get into trouble when the market sells off with a V expansion. The recent outlier move in Nvidia on Monday caused a spike from 48 to 72. We are using Nvidia as an example.",
  "Nvidia is a popular choice for trading due to its high stock value and significant option volume. Recently, there were 10 million Nvidia contracts traded in a single day, a substantial increase from previous trading volumes.",
  "Yesterday, we traded 5-6 million Nvidia shares. With an IV rank of 54 and a March 21st regular expiration, a 30 Delta strangle of $10.45 using 5,500 buying power. A $30 move can impact you with over a 60% win rate. This is based on the Black-Scholes model.",
  "A derivative of black schs that may seem like a tempting trade, but we need to consider all risks. Nothing is mispriced. To protect against a $30 move in Nvidia, stay small.",
  "Staying small is a way to control risk. A short strangle in Nvidia appears to have a typical risk-reward profile. Implied volatility has overstated historical volatility. Reference SPY and QQQ IV and HV for comparison.",
  "average implied volatility in QES was 23, historical volatility for SPY was 20 (3% difference), and for Nvidia was 49 to 47. Risk-reward profiles are similar and in line with the understanding that IVs typically overstate historical volatility.",
  "Comparing Nvidia to diversified indexes, the number and magnitude of outlier moves were nearly identical. It's surprising to see such similarities.",
  "Daily moves exceeding two standard deviations with less than a 5% chance of happening have been consistent in Nvidia, SPY, and Q's since 2017. Outlier moves seem to predominantly occur in Nvidia. This highlights the idiosyncratic nature of Nvidia's trading behavior.",
  "idiosyncratic risk in trading single stock names is significant. It is surprising that the SPY and QQQ have similar occurrences and average deviation moves exceeding two standard deviations. Why is Nvidia perceived as riskier to trade than the SPY and QQQ?",
  "standard deviation and overall risk of both the index and Nvidia are nearly identical. Despite this, trading Nvidia may seem riskier due to its higher implied volatility. Let's explore this further.",
  "The answer lies in the velocity of implied volatility, which represents the speed at which implied volatility can spike on any given day. This is measured by looking at the average and standard deviations of historical daily implied volatility increases.",
  "daily implied volatility can increase rapidly, especially for individual stocks like Nvidia. Compared to indexes like SPY and QQQ, Nvidia's implied volatility can expand by 57% more and has double the range of potential expansion. This difference in volatility movement is important to consider when trading.",
  "The QQQ IV has less potential than Nvidia. The minimum Maxi daily increases are almost identical, but Nvidia has higher historical daily implied volatility increases. Selling the same strangle in Nvidia yields about three times more capital than in QQQ.",
  "When trading, choosing stocks with higher historical daily volatility can result in increased risk and potential for higher returns. This applies to any stock, not just Nvidia. Higher volatility means higher potential rewards, but also higher risk.",
  "When trading single stocks like Nvidia, there is more risk and potential reward compared to trading ETFs. This is because of the potential velocity of IV expansion.",
  "Single stocks tend to have more outliers than ETFs. In Nvidia's case, the main risk is IV expansion."
]