[
  "Iron Condors should typically be around 10-20 points wide. Tony Batista suggests finding a width that fits in between these ranges. Iron Condors are popular among new traders and those with smaller account sizes. The key is to find a balance between risk and reward.",
  "In today's segment, we will explore the optimal width for different underlyings when trading iron condors. By adjusting the width span of iron condors, traders can optimize their risk-reward balance and improve profitability. Smaller wings may not receive enough credit, while larger wings may be too expensive with a lower return on capital. We will consider five underlyings of different prices: $100 stock, $200 stock, $300 stock, and $400 stock.",
  "We compared stocks at different prices ($100, $200, $300, $400, $500) with similar IVs. We analyzed Microsoft, Visa, IWM, and XBI across various price ranges. Average P&L, return on capital, and trade outcomes were calculated for different wings. Trades were conducted at 45 days to expiration with 16 Delta short strikes managed at 21 DT over 1,000 trials from 2013 to 2025.",
  "From 2013 to 2025, $5 wide wings on a $500 underlying like the Q's did not have a positive return on capital, while every other WI did. It's interesting because one might think it would need to be wider. The 2030 $50 wide iron condor would have been necessary. This is telling.",
  "It is difficult to predict the optimal choice among these options. However, it is clear that $5 Wide Wings are not ideal for trading $500 stocks or ETFs.",
  "For a $400 underlying like Microsoft, the majority of the return on capital was positive. The best return on capital was with $25 wide wings. Even in a $400 stock like Microsoft, $5 wide wings were not profitable. It's important to avoid going narrow in iron condors.",
  "seems that tight iron condors are the best strategy for smaller accounts to achieve profitability. Using $20 wings has been the most successful approach.",
  "From our research, playing zero day options with $20 or $30 wide iron condors has proven to be the most profitable strategy. In the $200 stock range, $5 wide wings like IWM did not work well, while $15 wide wings were more successful. This highlights the importance of choosing the right width for your options trades.",
  "When trading iron condors, it's important to have a wide stance for stability. Just like in sports, a wider stance allows for better grip and control. This is why going naked without a wide stance can be risky.",
  "NASDAQ is up 11 points. The $5 Wide Wings strategy is no longer available. The $10 wide wing was the most effective in this case.",
  "The study results show that widening strikes can increase returns on used capital and average P&L for higher-priced underlying assets. However, the average P&L increase per $5 change in width decreases after reaching the optimal wing width. It may be challenging to consistently use wider Wing Iron Condors for lower-priced underlying assets.",
  "wider Wing Iron Condors offer more buying power and lower return on Capital. For smaller accounts, stick to narrower wings like $10 wide for iron Condors. Wings should be between 10 and 30, increasing in $5 increments for every $100 increase in price. Adjust for your own risk-reward strategies while ensuring potential return on Capital and pnl remain in check.",
  "The research team established price ranges based on stock value: $100 stock - $10 range, $200 stock - $15 range, $300 stock - $20 range, $400 stock - $25 range, $500 stock - $30 range. This strategy helps keep profits and losses in check.",
  "$2 stock with a $20 wide Iron Condor is not ideal. Larger stocks, like a $400 stock with a $40 wide Iron Condor, are better. Incremental increases of $5 work well. The S&P is up 20, NASDAQ up 13, Russell up 24, and the Dow up 260. Volatility is up by 54 cents. Square is now XYZ.",
  "I no longer trade stock XYZ because there is now a stock XYZ."
]