[
  "discuss the Black-Scholes model and its value in framing trading strategies.",
  "In trading, the goal is to create a financial model that accurately predicts how prices behave in order to determine the cost of an option. The Black-Scholes model is commonly used for this purpose.",
  "The goal is to focus on returns rather than values at the end. Splits should not affect things, it has to be in terms of returns. Calculate returns by dividing the current price by the previous price and the future price by the current price.",
  "To calculate the future price divided by the current price, you need to multiply the returns one year from now and the returns between one and two years from now. Taking the logs helps simplify this calculation, which is why log returns are important in trading.",
  "Log returns allow us to use the central limit theorem, turning multiplication into addition. This simplifies calculations and leads to a log normally distributed outcome.",
  "We will discuss log returns and the weak efficient market hypothesis, which states that there is independence over joint time intervals. The false assumption is that underlyings are time homogeneous and always behaving the same way.",
  "If we have independence over discrete time intervals, the central limit theorem would apply. This is because we can break it into many small pieces, each of which is the same and independent. As a result, the total would be normal.",
  "The central limit theorem states that log returns evolve as Brownian motions, leading to the Black-Scholes model. This results in a convenient closed form expression for the fair price of an option.",
  "Formulate the fair price of an option based on the strike price, time until expiration, current spot price, and volatility parameter. The volatility parameter represents the fluctuation of the Brownian motion driving log returns.",
  "Per unit time, the formula is strictly increasing in terms of implied volatility. By inverting the formula using market prices, we can derive implied volatility. This is where we extract the most value from using the Black-Scholes model.",
  "The Black-Scholes model simplifies pricing by converting a price into a volatility parameter. However, market prices often do not align with this model, as volatility should be inherent to the underlying asset.",
  "Options on the same underlying can have different implied volatilities, which are not flat but typically increase as you move away from the spot price and further out in time. This creates a volatility surface where different strikes and expiration times have different implied volatilities. This contradicts the assumption of a flat plane in the Black-Scholes model.",
  "The black trolls model is not accurate. We continue to use it because there will never be a perfect financial model as desired. When using a physical model, such as a ball, there are limitations.",
  "have a physical model for how a ball flies through the air. We can write down formulas to predict its trajectory, observe the ball's flight, and assess the accuracy of our model. In social sciences, The Observer Paradox hinders accurate modeling as people may alter their responses when questioned.",
  "Questions change answers when people know they're being watched. Financial math faces a deeper issue known as the Describer Paradox, where models influence trading behavior and prices. This creates a cycle where the model impacts its own output. In 1987, the Black-Scholes model was popular among traders.",
  "The Black-Scholes model was highly favored until the 1987 market crash, which revealed its flaws. The crash led to the introduction of skew to adjust for the model's inaccuracies. Traders realized the need for a more nuanced approach to pricing options.",
  "The market's appetite for downside protection has changed, leading to the presence of skew. The tradition of throwing paper in the air on the last day of the year or during significant market moves is false.",
  "I kept all my receipts and reconciled them in the morning. It's important to keep track of trades to avoid discrepancies. In the early stages of building a product, small inefficiencies and inaccuracies can be compensated for by the wide markets.",
  "inefficiencies and inaccuracies were common in trading before decimalization. Creating a pricing model helped streamline the process as the business grew more efficient and measured.",
  "Black shells improved significantly as traders became more efficient and accurate in their strategies. Eventually, traders sought downside protection without the aid of computers, relying on manual calculations and weak handheld devices.",
  "The trading model was efficient and successful because it allowed for customization and served as a solid foundation for everyone. However, disagreements among users eventually led to its downfall.",
  "disagreeing with it and then it stops working suddenly because we tried multiple models on the platform, but in the end, only the black shoals model mattered. The black shoals model isn't true but is a useful frame of reference as we move forward.",
  "The ancient Greeks were skilled astronomers who observed and recorded the positions of stars, planets, and the sky. They used math to predict future positions of celestial bodies, such as Mars.",
  "The formulas for how planets move can be complex. Mars mostly moves around Earth in a circle, but also does loop-de-loops as they both orbit the Sun in stable ellipses. Focusing on Earth creates a geocentric model with a complicated formula for Mars' motion.",
  "The motion of Mars was once calculated using a complicated formula until it was realized that shifting the center of the solar system to the sun simplifies the equations into stable ellipses. This eliminates the need for defer and epicycle measurements between planets.",
  "By choosing the right frame of reference, understanding how an underlying behaves becomes more straightforward. The Black-Scholes model may not accurately represent how an underlying behaves, but it can be a useful tool for describing its behavior.",
  "When comparing an underlying asset to a Black-Scholes model, look at the implied volatility surface to determine differences. Heavier tails indicate a different underlying. This is a more direct way to analyze properties.",
  "Most people are familiar with the normal distribution due to the central limit theorem. Normal distributions are common in trading, with 68% falling within one standard deviation, 26-27% within two standard deviations, and outliers beyond that. The Black-Scholes model can help interpret these moves and serve as a baseline for comparison.",
  "judging the current market prices of the underlying using the Black-Scholes model can provide a more reliable interpretation. By analyzing the implied volatility surface, one can gain a clearer understanding of the market's sentiment towards the underlying asset. For example, GME shows call skew, indicating potential upward movements in price.",
  "trading world. The Black-Scholes model may have its flaws, but it serves as a solid foundation for understanding trading dynamics. It helps decipher the complexities of option prices, making it easier to navigate the market even for those with less experience.",
  "The Black-Scholes model provides a clear picture for modeling trading dynamics. It is more helpful to start by looking at the sun (underlying price) and then measure the position of Mars (options pricing) from there. The model may not be perfect, but it is a useful tool for understanding price dynamics in trading.",
  "The model affects the system itself. Using the black of the Baseline can make viewing the market more intelligible. Just as heliocentrism simplifies astronomy, thinking about the Spy moving as a put skewed underlying is clearer than thinking about it as an unintelligible randomly moving object."
]