[
  "I started trading at 11 by doing lawn cutting for $10 to $15 a lawn. I aim for base hits to build wealth, with an 87% success rate over 30 years. I have generated a 25-30% return for the last 7 years.",
  "This is another rising star, John. Welcome to Tasty and the rising star shoot. I met you once before in Atlanta at the Varsity. Let's get started.",
  "We have stayed in touch over the years through emails and have followed each other's trades. I have a good idea of who you are, but we will introduce you to the Tasty Nation. Your story is interesting.",
  "the only person I've met who has actually hunted a crocodile. I live in the city and don't have crocodiles here, but it's something I've always wanted to do. It's a risky project, but I thought it would be fun.",
  "python but you're not willing to take risks in investing. It's an interesting contrast.",
  "time so I think that's pretty cool. Let's focus on the trading aspect and how we can manage risk effectively.",
  "We have both been trading for 44 years. You started at 11, which I find incredible. I started in my early 20s. The real story here is longevity. I often speak at seminars and events about trading and entrepreneurship.",
  "a small difference between success and failure, with longevity being the key aspect of success. Many claim to trade for only 30 minutes a day and drive luxury cars, but that is not realistic in the real world.",
  "I focus on trading for consistent gains rather than aiming for big wins. I trade small and frequently, aiming for base hits or doubles rather than home runs. My approach is similar to that of a 100% trader.",
  "An options trader traded options before online trading was available. They would go through the newspaper and look at stock and option prices. They also used value line books that were a few months old.",
  "At 11, I mainly bought calls and sold covered calls. In my early teens, I did lawn cutting for $10-$15 per lawn or sold covered calls to make $80-$100 with less work. I did both to maximize earnings.",
  "I enjoy trading cover calls and cutting grass. I became a Series 7 broker at 18. I have undergraduate and graduate degrees in finance and accounting.",
  "I have a degree in finance and accounting. My professional career has been in financial accounting and business consulting, focusing on process improvement. I have worked on the East Coast and overseas for the past few decades, specializing in tax consulting.",
  "You primarily trade in US markets and have a unique perspective on market structure and business operations globally.",
  "A free market is preferable to businesses operating in non-free markets. Regulations, such as those enforced by the SEC in the US, provide necessary disclosures and protect individuals while maintaining marketplace integrity.",
  "Integrity prefers fewer regulatory limitations in trading. There are differing opinions on this issue. Tokenization is becoming more prevalent in the industry.",
  "When trading, focus on stocks, futures, and various products. About 5-6 years ago, I discovered Tastytrade while seeking ways to enhance my trading. Despite an 87% success rate over 30 years, it's important to note that success rate doesn't equate to returns.",
  "I aim for a 3% return per trade, with a goal of 40-50% annually. I focus on high probability trades for consistent success.",
  "I am risk adverse when it comes to Futures trading, as I am more comfortable with commodities and stock options. I have traded on all continents except Antarctica and plan to trade there later this year.",
  "I have traded in over 100 different countries on all seven continents. It's impressive that you have also been to 100 countries. Do you have anyone in your world who does what you do? I have a few people I know, but it's a small universe.",
  "in the trading world is dealing with the skepticism from others, especially from family members. It can be challenging to explain the intricacies of trading to those who are not familiar with it.",
  "One of the toughest things in trading is to remain unemotional. It's important to manage your emotions when a trade goes against you, especially if you've taken a position that's too large. Stay even-keeled and avoid letting emotions dictate your decisions, even when the market is volatile.",
  "On Monday, the market opened down 40 points in the SVS due to some anxiety in the Futures on Sunday night. It's important to watch the market but also maintain boundaries with trading hours.",
  "Business hours for trading are from Sunday night at 5:00 until Friday at 5:00. Mentally, trading is a 20-hour a day commitment. Anyone can learn how to trade successfully.",
  "I focus on long-term trading success and longevity. I spend six hours a day in front of my screen, which I enjoy.",
  "I have been trading for 40 years and wonder how many more years I can continue. It's a strange thought, but I try not to dwell on it.",
  "One of the original members of the CME, in his mid-90s, was carried up the stairs to continue trading at our office.",
  "I started trading in '95 and was inspired by a fellow trader on the desk who was actively trading futures on the CME. Despite his age and health issues, he was still actively trading and it motivated me to do the same.",
  "I was doing the same thing as him, yelling at the screen while trading. I am teaching my 80-year-old mom how to trade uncovered puts and sell covered calls. She is making money and is happy. Trading in full markets can make geniuses out of us.",
  "Geniuses make money in the market. Does trading lead to other hobbies or occupations? Trading helps with consulting work and allows for quick decision-making based on data.",
  "analyzing data quickly to make informed decisions is essential in trading. CPAs are typically not risk-takers, focusing more on the analytical aspect. Understanding the probabilistic side of trading is easier than the speculative side.",
  "Trading requires a shift from analytical to emotional when stepping into the real world. It's important to be able to interact with others in a normal way after a day of intense trading. I recall trading during the crash of 1987.",
  "I remember trading on the day of the 1987 crash. It was one of the wildest days of my life. After the trading floor closed at 3:00 central time, I went upstairs to the office. It was like a ghost town. I drove home, stopped at a hot dog stand, and everyone seemed normal. It was surreal.",
  "Does anyone know about the stock market crash? It's funny you mention that because I use it as a litmus test. If it's not being talked about in the normal world, it may not be a big deal. But if it continues for multiple days, people and the news media will start discussing it.",
  "When news media picks up on a trading topic, it may become a bigger deal. I use this as a reality check to not get too worried or excited. With experience trading in over 100 countries, I have a unique perspective on currencies, precious metals, and trading.",
  "I focus on trading financial instruments like currencies and precious metals. Culturally, I appreciate diversity in foods and people, but when it comes to finance, it's all about the numbers. Recently, my worst trade was shorting Tesla.",
  "I was short on Tesla, which is one of my best trades. Tesla is my biggest trading vehicle because of the liquidity. Tesla is the second most liquid underlying to trade, after Nvidia. Currently, I have strangles on Tesla.",
  "I currently have strangles, a call butterfly, and naked puts on Tesla. I plan to buy the stock and sell at-the-money covered calls for the week to capitalize on the premium. This strategy typically yields about a 3% return per week. It may not be the most efficient approach, but it works for me.",
  "If a covered call in Tesla doesn't work, consider rolling the calls down to get more premium and higher Delta. This allows you to keep the premium and the stock won't be taken from you.",
  "Stocks can be unpredictable, but I plan to hold onto mine and sell covered calls on Monday. Is there any aspect of trading that still confuses you?",
  "Take full accountability for your decisions and be prepared to live with the outcomes. When a trade goes against you, analyze the delta, profit/loss, and consider rolling down or out. Adjust your position size as needed.",
  "When trading, it's important to consider what percentage of your net worth you are using. Keeping it under 35% is generally recommended. Increasing contract size gradually over time is common as traders aim to trade larger amounts.",
  "Many traders have a get-rich-quick mentality, leading them to trade too big. It's better to start small, prove the concept, and then scale up. For example, I am comfortable with a $50 per spread or 25% risk approach. I understand the importance of managing risk in trading.",
  "I trade all day as long as it's a positive number, whether it's $50 or $500. Let's discuss how someone can trade for over 40 years. John's account is in the six figures.",
  "a targeted return of over 25-30% for the past seven years, which is impressive for building wealth. Let's dive into the specifics of your trading strategies.",
  "During our chat, you mentioned making between 10 and 30 trades a day, with the possibility of hitting 50 on busy days. About 80% of your trades are in the equity world, which is typical for a trader like you.",
  "I focus on trading futures, bonds, currency, corn, and wheat. I primarily trade spreads and use various strategies and mechanics for different products.",
  "I started trading futures about 15 years ago and found the nuances of different markets intriguing. I appreciate the simplicity of the Small Exchange and look forward to its return. Watching you trade has shown me that I don't need to know every detail, I can just focus on trading the product.",
  "I trade different products using the same methodologies as I do with options and equities. I am increasing my trading in zero and 1 DT options. Currently, with the VIX around 18, I adjust my trading style accordingly.",
  "The key is to adjust your trading style based on market volatility. When there is high volatility, consider selling premium. When volatility is low, consider using debit spreads. Have a go-to strategy for different market conditions, such as trading earnings or zero DTE options.",
  "I trade those assets frequently, utilizing various strategies based on market trends and volatility. I also incorporate a 513 EMA to guide my trading decisions.",
  "513 um 5 day 13 day charting. As a CPA, I focus on market perception and strategy. I am primarily a premium seller, always covered.",
  "Do you always trade covered or do you sometimes trade naked? I probably do about 70% naked, but sometimes I have to cover for capital reasons. There are unique SEC rules around that. For example, you might have to cover a trade that could result in a $120,000 loss on one lot. I mainly trade in the SPX, and sometimes I do debit spreads based on studies that suggest the best time to buy is at 10:00.",
  "At 10:00, initiate a debit spread at the money. Overlay when the 513 crosses for added confirmation. Focus on core equity strategy and consider potential earnings impact, like with Apple.",
  "My go-to strategy for trading Apple involves looking at the stock's IVR, volume, bid-ask spread, Delta, Gamma, and Theta. I analyze these factors multiple times a day before making a trade.",
  "When trading, I look at charts to determine if I am bullish, bearish, or delta neutral. For example, with Apple, if there is enough premium, I would go delta neutral 15 or two times the expected move of $9. This helps manage risk in case the stock moves quickly.",
  "Expecting a $18 move, the premium was about 75 total. I rank it in the 70s or 80s. I had a $5 spread on with 8 or 9 Delta on each side. IBM can be traded upside down.",
  "When trading IBM, expect a move today. Start by checking your existing positions before creating new ones.",
  "When reviewing existing positions, do you focus on Delta or P&L? I prioritize P&L first to identify issues, then adjust Delta accordingly. I primarily trade strangles, but may use calendars or debit spreads if IVR is low.",
  "If the IVR is low, I might do a debit calendar. IVR drives my trading decisions. If a position goes against me, my first objective is to adjust or reduce size, not increase it.",
  "To increase my position size, I look for opportunities to capitalize on market reversions, such as after a big move up or down like with Nvidia. I may sell more puts or hold my position if I believe the move is overdone. Long-term returns are key.",
  "If you believe your trading journey should be shared with Tasty Nation, we'd love to hear from you. We are always looking for the next class of rising stars. Email us at risingstars@tasty.com for a chance to inspire others with your story."
]