[
  "The four most recognized US equity benchmarks are the S&P, NASDAQ, Russell, and small cap index. Many traders are interested in small caps, such as the Russell, for trading strategies.",
  "US equity benchmarks include the S&P, NASDAQ, Russell, and Dow Jones. The S&P is favored by traders for its focus on large cap companies. The Russell 2000 index consists of approximately 2,000 companies.",
  "The Russell 2000 is a crucial benchmark for US small cap stocks, providing insight into the economic contributions of emerging enterprises. Despite its importance, it has seen less discussion in recent years compared to other indexes.",
  "other indexes have outperformed the Russell, including the Dow Jones. The question remains: are small companies losing momentum, or is there still an advantage to trading in the Russell?",
  "When investing or trading in the Russell, it's important to consider the nature of the small cap index. Stocks in the Russell have a significantly smaller market cap compared to other indices. To be included, a stock must have a closing price of at least a dollar and a total market cap of at least 30 million.",
  "The stocks in the Russell have a market cap of at least 30 million. The top two weighted stocks are MSTR at 92 billion and CVNA at 50 billion. Most stocks are smaller, less than 10 billion. The minimum requirement of 3.9 billion may seem high.",
  "The total market cap of the S&P 500 is around 50 trillion, while the Russell is around 5 trillion. Microsoft alone has a market cap of 3.5 trillion, compared to the entire Russell at 3.4 trillion. This could mean Microsoft could buy every stock in the Russell 2000.",
  "The Russell 2000 is not significant despite the smaller size of its component companies. The IWM is the seventh most actively traded equity index based on option trading notional value, following SPY and QQQ. Nvidia and Tesla also trade actively.",
  "Big Nvidia and Tesla trades are always at the top in option volume. The Russell 2000 offers several compelling opportunities, including growth potential and pricing inefficiency. They are less liquid and more sensitive to domestic factors.",
  "Small cap stocks are more sensitive to domestic economic conditions and have less wiggle room. Despite recent underperformance, the Russell 2000 has outperformed the Spy 14 times, the NASDAQ 11 times, and both together 10 times in the past 25 years. This trend is being relied upon for current trading decisions.",
  "The median Ender return for the Russell is about 12.5%, surpassing the spies of 11.2%. This is shown on a graph we just created for the past 25 years. The Russell 2000 offers exposure to a wide range of small cap stocks.",
  "A broad range of small cap stocks across various industries offers diversification and growth opportunities. Tasty is a publicly traded small cap stock in the Russell 2000 index, which has performed well over the long term. It is also a good pairs trading vehicle, currently being traded against the S&P 500.",
  "Trade SMPS versus NASDAQ at any ratio you prefer."
]