[
  "Today we are evaluating Vega, which measures the change in an option's value when implied volatility increases by 1%. Most of our trades are short Vega, meaning we profit when implied volatility decreases. Selling premium gives us theoretical opportunity from IV contraction.",
  "opportunity from IV contraction and risk from IV expansion. The most common short volatility trade is a strangle. The Delta of a strangle determines the wager risk. A larger Delta means more risk or opportunity from an implied volatility move. Bigger credits mean more money can be made. Higher probability of profit is associated with more credits. The goal is to find the Delta that offers the most theoretical profit.",
  "How can we optimize this trade to maximize theoretical opportunity while minimizing realized risk? Consider a Delta closer to 50 rather than 27.5.",
  "conducted a study from 2014 to present, analyzing 16, 20, 30, and 40 Deltas at 45 days to expiration. The goal was to find the Delta with the most theoretical opportunity while minimizing risk.",
  "In analyzing different Deltas for expiration dates ranging from 16 to 40 days, we observed historical volatility of profit and loss with management in 21 days and current Vega in the Feb 21st cycle. Higher Delta strangles offer greater theoretical risk and Vega opportunities, but also come with higher realized risk. Choosing the right Delta can maximize Vega opportunity while minimizing actual risk.",
  "At 16 Deltas, there is a smaller Vega and volatility risk due to wider strikes. P&L volatility is also lower. At 20 Deltas, risk increases slightly, and at 30 and 40 Deltas, it increases further. P&L risk is about three times higher at these levels.",
  "Three times as much across the board. It's hard to see an advantage anywhere. Regardless of the width of our strikes, the amount of Vega we are short per unit of historical risk remains the same. This indicates that historical realized risk and theoretical risk opportunity are consistent.",
  "Realized risk and theoretical risk opportunity increase proportionately with Delta. When looking at SPY back to 2005, the realized risk per unit of theoretical risk (Vega plus volatility of P&L) remains consistent regardless of the strike used. This suggests that options are priced theoretically perfectly and scale symmetrically across different strikes.",
  "Vega is a Greek that can be used as a proxy for theoretical risk reward. The risk versus opportunity is the same across different strikes. 16, 20, 30, and 40 Deltas are all equal in this context.",
  "Vega can be used as a proxy for theoretical risk reward when comparing it to realized risk. The ratio of Vega to realized risk remains consistent regardless of the strangle sold, indicating a direct proportion between theoretical and actual risk. This suggests that traders can choose strikes based on their desired probability of profit.",
  "Your probability of profit is directly related to how you manage risk and reward."
]