[
  "I saw the opportunity as a risky trade. My favorite strategy is the yield grinder, which has generated returns between 10-20% over the last few years. If someone is selling a catering business, and you know nothing about it, it may not be a wise investment.",
  "Welcome back to another Rising Star segment. Today we have Gary, who has been trading since his early 20s and is now 39. He has been trading since 2007-2008 and works for Tasty.",
  "Yeah, I got into trading because my dad introduced me to it. I like being surrounded by people who are knowledgeable about the market and the players involved. It's a good feeling to be part of this community.",
  "He started trading Futures in cattle, hogs, and corn, despite not being a farmer. He got into cattle trading through friends who are farmers. It makes sense for someone living in Iowa to trade cattle.",
  "People in Iowa can easily get into trading cattle and hogs. When starting out, consider spreads like buying five cattle in one month and selling in another. Calendar spreads can involve live cattle and lean hogs. Remember, it's normal to experience losses when starting out.",
  "I lost $250 trading live cattle in a calendar spread. Trading commodities takes practice and it's not as easy as it seems. My background is in mechanical and manufacturing engineering.",
  "is that trading played a significant role in shaping your mindset and approach to business. Your experience in manufacturing engineering likely provided you with a unique perspective on risk management and decision-making, which has influenced your trading strategy. It's interesting to see how different experiences can intersect and impact one's professional journey.",
  "always wanted to start my own business. I decided to take a risk and purchase a catering business from a retiring gentleman, even though I had no experience in cooking or being a chef.",
  "I saw an opportunity to buy a catering business even though I had no background in cooking or being a chef. I believed in my wife's cooking skills and knew she could run the business successfully.",
  "She decided to leave her job as an analyst and take a risk with her partner. They invested all their savings into a catering business. It was a risky move, but the numbers made sense.",
  "risk, the numbers made sense. I looked at it like a trade and thought, \"I don't know anything about catering, but it's a hard business physically.\" The funniest thing was when you said you clean a lot of dishes, coming full circle from engineer to trader to dishwasher.",
  "started trading while washing dishes. You began trading in 2007-2008, at the start of your business career.",
  "You have been trading consistently for the last 15 years, with a brief break for school. Over the last five or six years, you have been actively trading every day while also running your own business. Let's focus on how you manage your trading in conjunction with your business responsibilities.",
  "focus on the trading aspect of running your own business. Trading gives you the confidence to grow and build your business while managing your family and other responsibilities. You are able to handle sales, marketing, and networking while running a small business. Trading multiple accounts helps you stay busy and successful in both areas.",
  "You trade multiple accounts, mostly focusing on your six-figure IRA account. Over the last four to five years, you have consistently generated returns two to four times higher than risk-free rates.",
  "Risk-free rates typically range between 4% and 5%, meaning potential returns could be around 10% to 20% annually. This consistency is what we look for in traders, especially in IRA accounts where capital efficiency is lower.",
  "favorite trading strategy is to focus on consistency and active participation in the market. One interesting point you mentioned is your frustration with your wife's old 401k investment choices, specifically targeted date funds and bonds. This inconsistency drives both of us crazy. Let's discuss more effective trading strategies.",
  "My favorite strategy in my IRA is the covered call. It is my biggest position in the Russell. I mainly stick with ETFs for this strategy.",
  "I prefer ETFs but also trade Commodities. Yesterday, I took a position on Silver, either through an ETF or Futures. I look for price extremes to generate trade ideas.",
  "I noticed that bonds and silver were oversold, so I went long on bonds and kept my size in check. I also trade strategies like the zebra, poor man's covered call, and poor man's covered put.",
  "I usually lean towards long trades, but it varies. As I become more successful, my trading has become less emotional and more mechanical.",
  "I have transitioned from emotional trading to a more mechanical approach. I focus on the mechanics of my trades, such as adjusting calls and taking profits by rolling them up or down. Initially, I would panic and close positions as soon as they were slightly down, but now I keep my positions small and trade iron condors and verticals.",
  "How aggressive are you with existing positions? I look for a 50% move before making adjustments. If a position is up close to 50%, I'll roll it down. If a position is up 20% the next day, I might take a profit. I typically carry 3-4 positions at a time.",
  "I typically have four to five contracts in my IRA and smaller Tasty Bites account. I use a significant portion of my capital in my IRA, primarily buying shares. In an IRA, it doesn't matter if you sell puts or buy shares, it's the same thing.",
  "Buy ships or pursue futures to own shares in your account. Do you get mad at yourself when you lose? My dad watches Tasty.",
  "When trading, how do you decide when to close out positions? I typically aim to take off 50% of the position. If a stock goes against me, I focus on ETFs and don't stress about it.",
  "I invest in these ETFs without worrying about them going to zero. I hold and manage them, focusing on rolling the call down until they ultimately go up. I have a long-term perspective of 20 years, assuming they will be okay by then. I don't like that approach, but can't think of alternatives.",
  "Living in an area with expertise in various commodities, such as cattle, hogs, corn, wheat, and soybeans, can provide a trading advantage. Seeing these crops and livestock firsthand can help traders understand market trends and make informed decisions.",
  "Watching the corn grow in the cattle makes me think about the markets and where the products are headed. It makes me consider trading full-time. It seems like a more straightforward path.",
  "Limiting capital is a key consideration when trading. It is important to leverage steady and consistent gains to create wealth over time. Consider how to transition from current trading strategies to long-term wealth building.",
  "In the next 10 years, I plan to continue growing my GR ER. I have spent my entire career focusing on this goal and I am happy with my progress. Eventually, I plan to sell the business and retire.",
  "How do you decide on your next trading move? Do you focus on existing positions or different strategies?",
  "In my IRA, I have a core strategy of selling calls on stocks like the Russell or the S&P. The size of my position depends on whether I am long or short.",
  "It depends on whether I'm long or short. I use zebras to keep capital and reserve cash. Capital efficiency is key, especially in an IRA. It allows you to do whatever you want. Zebras are a great way to get long something by mimicking 100 shares.",
  "Do you have specific capital limitations per trade, or do you trade based on what is available? Do you trade differently in your margin account compared to your IRA account?",
  "I have a $7 stock that I sell calls against in my personal margin account. I also own some ethereum. In 2025, I plan to use Futures more instead of the Russell ETF like iwm for better capital efficiency.",
  "I prefer trading stocks over micro futures because it is more efficient and cost-effective. Using the bigger contract may lead to notional inefficiency. I do not trade exotic spreads.",
  "I have been experimenting with exotic spreads, mainly involving Ethereum. I have been buying Ethereum and selling micro Futures Contracts for fun. It's a small play, but I enjoy trying out different strategies.",
  "are more customer-friendly to trade? I prefer the Russell because it is priced at $200 per share, making it more reasonable for buying shares compared to the SPY at over $600. The Russell also has higher volatility, providing better value for your investment. This makes it a good option for covered calls. Do you have any other ETFs in mind that you recommend?",
  "I find TLT and SLV interesting ETFs. I was also in XLK last year, the technology sector. It moved in my favor, so I took my profits and exited.",
  "When establishing a position, do you ever add to it? What are your discipline strategies? For example, in my IRA, I like to own shares for a while. In December, during the big sell-off in the Russell, I made money on my calls.",
  "I made money from call options and used some of the premium to buy more shares in the Russell to average down. I take what the market gives me and reinvest accordingly. This is my way of dollar cost averaging.",
  "Advice for someone interested in trading is to start small and get hands-on experience. Reading books and watching videos can only take you so far - the best way to learn is by actually getting involved in trading.",
  "Watching Tasty Live was helpful, but actually putting on trades was challenging at first. It was difficult to translate theory into practice. I was emotional and didn't always understand why trades went against me.",
  "I closed the trade at a small loss, which was key to staying in the game and learning from it. It's important to start small and gradually increase size as you gain experience. This lesson was valuable even before trading with Tastyworks.",
  "The trading strategy I focused on was using spreads to minimize risk. I have never traded cattle before and only tried lean hogs once. I don't have much experience with these commodities.",
  "The commissions and fees on those exchanges are higher. The expirations are weird and there's a lot of strange stuff, so I stay away from that. Do you review your returns at the end of the fiscal year?",
  "like what you're doing with tracking your returns and setting specific goals for yourself. It's important to have a clear plan in place to improve your performance each year. Keep up the good work!",
  "appreciate the consistency and steadiness you bring to trading. As a trader, it's important to capitalize on opportunities and turn trading into a motivation to be an entrepreneur. I am always looking for opportunities and remain indifferent to where they may arise.",
  "I want to capitalize on any trading opportunity that comes my way. If I had not been involved in trading, I may have dismissed the opportunity due to not being a chef. But I approached it with a different mindset and saw the potential for success.",
  "I believe trading different assets presents various opportunities. Thank you for sharing your story, Gary."
]