[
  "past few years to see if this method holds up in real-world scenarios.",
  "significant moves and major names in the trading world over the past year. Let's compare these moves to the realized moves in the S&P. The expected impact on a stock can be estimated based on various factors.",
  "Stock can be estimated based on the expected return for one stock and the correlation between two stocks. For example, if stocks A and B have a correlation of 0.8 and stock A is expected to move 5% around earnings, the expected impact on stock B would be 4%.",
  "In trading, you can beta weight by dividing the volatility of the stock you're interested in by the expected move. This is similar to beta weighted notional IV for expected move considerations.",
  "This is for calculating the expected move of a stock in relation to another stock. To extend this logic to an index, multiply the formula by the weight of the holding in the index and sum them up. This gives a weighted sum of all expected moves. For example, if Apple is expected to move 5%, calculate it accordingly.",
  "When a stock is expected to move 5% after reporting earnings, we can calculate the expected move in the index by analyzing the correlation between all the index holdings and the stock. This formula helps determine how much the S&P should move based on the expected stock move. Let's review some data to see how accurate this method is.",
  "It is challenging to backtest due to limited significant market moves. I analyzed the top holdings of the S&P: Apple, Microsoft, Nvidia, Amazon, Meta, and Google. These assets have rotated within the top six spots over the past few years.",
  "On days when assets moved more than 5%, what was the expected index impact? There were few such moves in this period. Historical weights of the S&P over the back test period are not easily accessible. Limited data, but looking for any interesting insights.",
  "In 2024-2025, we analyzed Apple, Microsoft, Nvidia, Amazon, Meta, and Google for moves greater or less than 5%. We compared their moves to the S&P's expected and actual moves. This analysis is based on the formula shown on the previous slide.",
  "When holding in the S&P has a large move, the index is expected to follow suit. In a limited data set, moves of plus or minus 5% resulted in the S&P having the same daily return 100% of the time. If a holding moves 5% up, the S&P should be positive that day.",
  "The S&P is expected to be positive that day based on the previous slide's expected return. This makes sense as we anticipate large moves, such as a 20% increase in MEA leading to a positive movement in the S&P.",
  "expect the S&P to move in the same direction as the company with significant movements. Let's move on to the next slide.",
  "When analyzing the actual moves, we noticed that the direction aligned with the expected move, but the numerical values differed significantly. We observed 36 data points of big moves in six holdings over the past year. The hatched bar represents the expected move, while the solid bar represents the realized move. Green indicates a positive move, while red indicates a negative move.",
  "say about the S&P's movement?",
  "I noticed something unusual that inspired this backtest. Let's move on to the next slide to discuss a few interesting examples from February.",
  "On February 2nd, Meta jumped over 20% after earnings, exceeding the expected move in the S&P of 3%. On August 5th, Nvidia dropped over 6%, while the S&P dropped almost 3% due to concerns around the Nikkei crashing over 12%. External factors can significantly impact trading outcomes.",
  "External factors can sometimes cause markets to deviate from expected moves. However, 89% of the time, the signs of expected and realized moves are the same. For example, even if Nvidia dipped, the actual move in the S&P may not align.",
  "The S&P move may not always align with the expected value, but it usually does about 89% of the time. It is unusual for the index move to not match the sign of one of the major holdings. Overall, the expected and realized moves were in line.",
  "On January 30th, Microsoft dropped 6% after earnings. On February 5th, Google dropped over 7% around earnings.",
  "The S&P saw unexpected gains of over 7% despite anticipated drops around earnings. This phenomenon has occurred recently with companies like Google, Microsoft, Nvidia, and Apple experiencing significant moves.",
  "It's unusual to see moves greater than 5% in top S&P holdings like Apple and Tesla. Recently, Tesla dropped 30% while the market was rising. These abnormal moves have been happening more frequently.",
  "There have been recent unusual moves in the market, specifically two significant drops in Microsoft. It's worth monitoring this trend over the next few months to see if it continues.",
  "noticed a shift in market dynamics after the big drops in Microsoft and Google. It seems like there may be a shift away from Tech or AI, leading to more optimism in the market.",
  "drops happened were weird. I wanted to do a study to show why Apple could drop 3% or Tesla 4% and the index still end green. But when Microsoft drops 6% and Google 7% and the S&P is expected to drop almost 2% in both cases, then ends up green, that's unexpected.",
  "The market behavior deviates from what was expected based on the data from the last year. It appears to be broad-based, making it challenging to draw actionable insights. The back test was difficult due to the reasons mentioned.",
  "found interesting. I have noticed significant discrepancies between individual stock movements and index movements in my portfolio. This analysis was my attempt to quantify this observation.",
  "There have been some individual stock moves today, possibly related to earnings. It's hard to draw conclusions with limited data, but the indexes seem more resilient to these fluctuations.",
  "movements. This trend of stocks being more insulated from market moves is worth monitoring as volatility continues in 2025. The potential impact of a single stock on an index can be estimated using historical price movements.",
  "An index can be estimated using historical price data and a detailed list of index components and component weights. A limited back test suggests that major stock movements can impact the direction of the index. Earnings-related moves may have a smaller impact on the index compared to market or sector-wide events. Further research is needed for confirmation.",
  "More research is needed to validate any potential trends in trading. As of now, the data is not sufficient to measure any significant changes. However, it may be worth monitoring as we approach 2025. Trading has felt unusual and challenging to quantify, but with new testing methods, we may gain more clarity on any emerging patterns."
]