[
  "The tool in the platform is a stress test for positions. Clients can assess the risk of their positions by simulating market movements such as a 5% market drop, a 10% stock increase, or increased volatility.",
  "Assess the risk and determine if you are comfortable with it. Use the positions tab to stress test current positions and explore hypothetical scenarios like adding a Iron Condor to offset potential losses.",
  "test and adjust metrics for open positions, create what-if scenarios, and determine risk levels. Features include adjusting inputs on the risk analysis tool.",
  "The risk analysis tool allows you to input all of your positions, add new positions, and utilize the span margin feature for Futures trading. This tool provides insights into both upside and downside scenarios in the market.",
  "the market's direction and implied volatility percentage changes. To analyze this, go to the positions tab on the desktop app, click on the cap wreck button, and then select risk analysis. Let's move on to the next one.",
  "Jump to the next one to change time inputs for price, volatility, and time. These inputs can be adjusted for the entire portfolio, new positions, or specific positions. You can change inputs specific to one position using an option pricing model.",
  "calculated based on the current price and time to expiration. The model generates potential gains or losses at different price points, such as up 6% or down 15%. For example, if JB Morgan stock goes down 15%, I would lose $6,000 but make $1,600 on the puts. This allows for a clear understanding of potential profit and losses in trading.",
  "portfolio or you can exclude certain positions to get a clearer picture of your overall exposure. This allows you to make more informed decisions when trading.",
  "In the portfolio tab, you can include all positions or specific ones with check marks before moving to the risk analysis tab. You can update prices and IV yourself by refreshing. Make sure to click on positions after making a trade to ensure it is added to the risk analysis.",
  "Ensure positions are updated by clicking on buttons in the upper left, such as price and IV. This automatically refreshes the information with up-to-date data. Moving on to the next slide, we will focus on analyzing Greeks and how they change in different scenarios.",
  "Delta Theta helps you visualize how your positions change in different market situations. By hovering over each step, you can see how your specific position is affected. Each step represents a 5% move, so you can assess your risk and reward as the market fluctuates.",
  "The reward is on both sides of the market, showing changes in Greek exposure. Steps should be equal distance to each other. The Greeks are calculated for each position based on the current implied value.",
  "Implied volatility, offsetting Greeks, and aggregate Greeks for each position are important factors to consider when trading, especially with portfolio margin accounts. Understanding how buying power can change with market and IV moves is crucial for managing risk.",
  "The Japanese Yen unwind caused significant changes in buying power for those with bullish positions in the markets. This can be used to anticipate similar or more dramatic moves. Inputting these factors into an option pricing model can help determine potential prices.",
  "Here's the price for the calls and puts based on the option pricing model. It calculates theoretical prices to determine potential gains and losses. Transparency is key in displaying this information.",
  "It is important to stress test a Monte Carlo model with 10,000 simulations to ensure its accuracy. Clients can view all simulations and conduct their own risk assessments.",
  "To determine comfort with risk, traders often discuss hedging strategies. For example, during the Japanese yen unwind earlier this year, margin desk conversations likely focused on mitigating risk from short puts or bullish E Min Futures positions. Hedging strategies can help expand buying power while managing risk.",
  "If I buy a put two weeks out for further out of the money, how will it affect my position and buying power? Adjust the Greeks to analyze the impact. You can add up to four legs in trades for maximum order routing.",
  "The maximum order routing allows you to add simulated trades or trades prior to getting filled to see how it will affect the risk parameters in your portfolio. This tool is useful for hedging your portfolio against a 10% down move or a 10% down move with a 20% pop in volatility.",
  "In times of volatility, you can use a risk array tool to simulate potential losses and gains. This is helpful for clients contacting the trade desk to assess their risk exposure. For example, if a hedge is expiring, the tool can help determine the best course of action to offset the risk.",
  "offset the risk by replacing your hedge if you are not comfortable with the potential losses. This will show you how the cut reduces your theoretical losses. Next, let's discuss price percentage changes.",
  "You can have uncorrelated symbols, meaning everything is down 20% across the board. Beta weighting to SPY explains how this functions.",
  "When trading, understanding beta is crucial. A high beta stock means it is more volatile compared to the market. For example, if the SPX goes up or down by 10%, a stock with a beta of two would move by 20%. Beta acts as a multiplier for market stress, helping traders anticipate potential movements in their investments.",
  "If your beta symbol drops 20%, the stress test will reflect those losses by considering the correlation of all your positions, including gold and silver with a low beta. This feature prevents a blanket 20% loss and allows you to assess your entire portfolio.",
  "Take your portfolio as a whole and analyze it using beta weighting. This helps in managing risk. You can see betas on the left side of the risk array and adjust them as needed.",
  "In beta trading, you can adjust price moves and implied values independently. Clients have the ability to make their own changes for increased functionality and scalability. You can edit anything and be very detailed in your adjustments.",
  "You can analyze specific scenarios by adjusting position values and volatility levels in different options series to see how it impacts the option pricing model, especially when using the beta weighting feature.",
  "You can change the beta weighted symbol from Spy to QQQ to analyze potential market movements in the tech sector. Next, we will discuss IV changes and the difference between points and percentages.",
  "When adjusting IV, you can either use percentages or points. For example, if you want to shift IV by 20%, each option's IV will move by 20%. If you want to shift IV by 7 points, use the IV shift function to move each option by 7 points.",
  "When the implied volatility shifts by seven points, each individual option's implied value also shifts by seven points. For example, if the implied value is 30, it will go to 37, and if it is 40, it will go to 47. There are various ways to program these implied volatility shocks, either for the group as a whole or for each individual option.",
  "Points refers to the movement of the entire position, affecting all options in the same way. For example, if Apple's implied volatility moves seven points, all options related to Apple will also move seven points.",
  "trading portfolio. The Tastytrade Risk Analysis Tool provides traders with comprehensive insights to be effective Risk Managers. It helps you understand how various scenarios affect your portfolio.",
  "Understanding how different scenarios impact your trading portfolio allows you to make informed adjustments to optimize your risk-reward profile. Let's jump into the platform to demonstrate this feature. Feel free to ask any questions in the YouTube chat.",
  "David is asking about the current Apex 40% down Market multiplier, whether it is 5% or 6% of an account. About a year and a half ago, the OCC came out with stressing clearing firms.",
  "Clearing firms require firms to put up 40% of their capital. This impacts clients, who must also adhere to a 40% portfolio rate based on their net L exposure. The current ratio is around 6 or 7.",
  "On the platform's portfolio page, click the Capital Requirement button in the upper right corner to view your risk arrays.",
  "Select the positions you want to include in your risk arrays. You can choose specific positions or include them all. Let's have some fun and use all the positions. Show me a scenario and how to input it.",
  "To adjust for a 10% price change and an increase in IV from 15 to 25, go to the override tab, click on uncorrelated, and adjust to 20%.",
  "We will decrease everything by 20%. We can also shift the IV points by 7 points relative to the VIX, which is a 50% move. This will result in a 10-point increase.",
  "Move all implied values up by 10 points on each symbol, or a 20% move. Consider a 50% increase for a larger shift.",
  "Each individual implied volatility moves by 50%. For example, if you have a 30 implied volatility, it will increase to 45%. This affects the profit or loss of each position. It provides insight into both sides of the market, whether it's an up or down move in implied volatility.",
  "In an up move, there is no specific percentage given. Volatility may stay the same or decrease. Adjusting to a 10% decrease would change the risk profile. The risk analysis shows both directions of market movement based on your inputs.",
  "When trading indexes, you have the opportunity to profit from both upward and downward movements. You can make adjustments based on market trends to maximize your returns. Create your own strategy based on what you believe is a reasonable approach for the day.",
  "What do you think is a reasonable one-day move in trading? Maybe a 5% or 7% move. Also, consider the implied volatility when making decisions. Next, we will incorporate historical data like the 2020 Covid day or the 2008 banking crisis into our risk analysis.",
  "will be able to simulate how your position would have performed during historical market events such as the 2008 banking crisis. This tool allows you to analyze risk and volatility, providing insights into potential scenarios like an OPEC crash or a COVID crash. It is a powerful tool for traders.",
  "This tool is complex and requires time to learn. It is powerful because it can help anticipate market movements, especially in uncertain times like when unexpected announcements are made.",
  "Market volatility can be managed by using historical benchmarks like the covid crash or financial crisis to adjust position sizes and hedge risks. Simulating trades on the platform can also help in preparing for potential market scenarios.",
  "changing the date of the situation to early January. The platform will adjust for positions like the expiring Natty gas position. It will simulate changes such as removing expired positions and accounting for time changes.",
  "We are plugging inputs into the option price model to calculate theoretical values for calls and puts. Let's pick a position, add a new position like an AMD put spread, and simulate how it would adjust.",
  "I placed an AMD put spread this morning. I will isolate the position for a risk analysis. The trade will be added to the upper right corner for easy tracking. No need to send the trade.",
  "When sending a trade, create it in a risk analysis tool to review before sending. This will show potential risks and profits. For example, adding a short put spread may have downside risk but upside profits due to long Delta.",
  "If I add on this put spread, I need to recreate it. By adding a put spread to my already long Delta position, I am increasing my downside risk. You can adjust all the inputs in the trade.",
  "Change the input by hovering over any part of this section to adjust the price of the underlying. You can manually change the price to 97. Adjust the implied volatility of each option individually or for all options at once. Customize as you wish.",
  "We want a dynamic platform where clients can make their own changes and interact with predetermined levels. We welcome client suggestions for enhancing our models, especially in risk analysis. Let us know if there are specific features you would like to see.",
  "In risk analysis, it's important to understand the market sentiment. I have a micro Euro and a Natty gas butterfly in my portfolio. I will add a short put in ES to see how it impacts my portfolio and explore span margin scenarios.",
  "I will add my entire position and include a short put. This will have a significant impact on my overall positions. The short put in ES is much larger than my other trades. Let's look at the span margin scenario and add the new position.",
  "hovering over the initial margin requirement, you can see a breakdown based on the span model. Let's put on a wide out-of-the-money put spread to demonstrate this.",
  "When placing a money put spread, navigate to the positions tab and click on report to refresh. Hover over the initial requirement M to see where it's coming from. SPAN has 16 different scenarios based on volatility and price.",
  "Volatility in trading refers to the fluctuation in prices. For example, if the ES moves 5% in a day, traders may break this movement into thirds and apply a 40% implied volatility shock. This helps them anticipate potential price changes and make informed decisions.",
  "Scenario 15 and 16 involve a 5% price move, which is multiplied by three to become 15%. A third of these losses is required as a risk analysis input for margin requirements. This allows us to mirror the margin requirements for trading.",
  "In Scenario 14, we saw a full 5% move. Let's recreate that to identify the risk. I'll make this a naked position to observe extreme changes, including limit up and limit down moves. Circuit breakers are in place. I'll make the position as wide as possible.",
  "I want to remove the black model of span and replace it with risk analysis for better transparency in calculating trades with limited capital.",
  "Margin calls can be issued immediately on this account. I have a wide put spread in ES. Looking at the far right where the arrows are can provide more information.",
  "Arrows indicate direction of movement. Scenario 16 involves a price increase of 300%, with losses limited to a third of that as margin. This translates to three consecutive 5% moves, totaling a 15% increase in the market.",
  "If losses increase from 5% to 15%, it is important to cut them quickly to meet margin requirements. This is crucial for those selling puts in mini Futures to understand the true size they can handle based on their leverage and notional value.",
  "If you experience a one or two-day move where the market is down 10-15% and you are unable to absorb that, it may be problematic. Conduct a risk analysis to determine if you can handle this level of risk. Focus on analyzing the ES for capital requirements.",
  "Take off the irrelevant details and focus on the trading context: We are looking at a 15% move down with no volatility shock. We will adjust for margin requirements by cutting about a third of the 55% move.",
  "The yellow box indicates the largest loss on the risk report. It helps the client identify where the large loss is coming from. This is useful for monitoring positions like AMD.",
  "AMD position is at its maximum when spread trades or long call spreads drop to zero, limiting further losses. This color-coded heat map approach helps visualize trading positions.",
  "we want to ensure that clients can easily see and read the information."
]