[
  "When choosing the long for a poor man's covered call, the ideal Delta is around 26-30.",
  "For the long strike, I'm looking at the short 70 Delta as my default. A covered call involves selling a short out-of-the-money call while holding 100 shares of stock. This strategy generates additional revenue compared to just holding shares, except in the case of a sudden spike in the underlying where there is still exposure to a loss.",
  "Capital efficiency is a key consideration when implementing a poor man's covered call (PMCC). This strategy involves using an in-the-money long call instead of shares to recreate a similar profit and loss dynamic. When selecting the long call and short call to use, aim for a 65-35 split in favor of the short call to maximize premium collection. This approach can help increase capital efficiency while still benefiting from potential upside in the underlying stock.",
  "Collecting premium increases your probability of profit by capping your upside. It requires no additional capital and provides a higher probability of success. Consider placing a long in the money call to maximize gains.",
  "analyzed 15 years of SPY data for different covered call strategies with 45 days to expiration and 30 Delta short options. The 30 Delta short options are recommended for this strategy.",
  "30 Delta is where Tony and I typically aim for long calls, with strikes at 60, 70, 80, and 90 Delta. We consider expirations at 60 days, 120 days, or one year. Positions are closed when the short option expires. We also use rich man's covered calls with 100 shares of SPY instead of the long option.",
  "Using 100 shares of SPY instead of a long call at the same time frame is known as a rich man's call. The deltas range from 60 to 90, with the bigger deltas showing a marginal change when using the underlying stock.",
  "If you buy the stock, you'll do slightly better. The average P&L is virtually the same regardless of where you enter. Using $188,000 capital for the same profit doesn't make sense. A 70 Delta is likely ideal for the average P&L.",
  "Your average P&L is 27 and your capital is on the lower end. The key is capital efficiency and reaching a decent number. The rich man's covered call wasn't much more impressive. We compared the long call.",
  "We compared the long call options at 45 days and 60 days to expiration. The numbers remained consistent across both durations.",
  "we took it a step further and went to the sixth month long call, also known as leaps. The win percentages and average P&L did not change, but the capital requirements increased compared to shorter time frames.",
  "60 days is more profitable than at 6 months. The win percentage remains consistent across different time frames, including one year, 6 months, 60 days, and 45 days.",
  "P&L remains consistent over one year, but the capital required increases with longer timeframes. For example, 45 days requires $800, 60 days requires $1,000, six months requires $1,500, and one year requires $2,500 using a 70 Delta long call. The longer the timeframe, the more capital is needed, affecting capital efficiency.",
  "The capital efficiency of a trade is affected by the cost of the call option. The buying power requirement remains the same regardless of the option's expiration date. Calls with longer expiration dates are more expensive than shorter-term calls.",
  "pay for 45 days on the long call. Writing covered calls on SPY has been a successful strategy over the past decades. Poor Man's covered calls were able to.",
  "Poor Man's covered calls can replicate the success of being long stock with less capital. Choosing a long call with a 70 Delta and 60 days to expiration offers a balance of capital efficiency and profitability. Compared to Rich Man's covered calls, Poor Man's covered calls are more reliable. Expect higher current SPY costs due to the length of the study.",
  "Current SPY costs are expected to be higher, but the relative differences between strikes and expirations should remain. A key takeaway is to sell around a 30 Delta strike and buy a 70 Delta strike for the best results. Focus on finding the most reasonable duration relative to the credit you receive.",
  "The most reasonable credit collection period for capital usage in trading is 60 days. Extending to a year does not offer any difference, just tying up more capital. This in-depth study of the Poor Man's covered call is personally very helpful."
]