[
  "Market volatility, specifically the VIX, is a mean-reverting asset with an average of 18.9 over the past years, including 2020. The nuances of volatility from a distributional perspective are important to consider.",
  "The VIX in 2020 is 18.9, higher than expected. It is considered mean reverting due to its mathematical nature, unlike price-based assets like stocks and futures.",
  "When volatility is high, it tends to decrease, and when it is low, it tends to increase. It can be costly to hold onto assets during extreme volatility, as they typically revert to their mean. It may seem impossible to predict when this reversion will occur, but it is inevitable. Averaging out volatility levels can be misleading in assessing how often it reaches certain levels.",
  "volatility levels can be analyzed by looking at its distribution, which shows the probabilities around all possible values. Previous research indicated that volatility would increase about 10% of the time and decrease about 20% of the time.",
  "10% of the time, the market goes down, 20% of the time it stays the same, and 70% of the time it remains in a low state. The distribution of daily VIX values since 2017 shows a long right-skewed tail, with many large values having low probability. The average VIX value of 18.7 does not accurately represent the distribution.",
  "The VIX distribution is skewed, with a higher likelihood of being below average (60%) compared to above average (40%). This is shown by the yellow line on the left side of the graph. The median is at the 50th percentile.",
  "The VIX is currently at 16.4, which represents the median or 50th percentile. This means that half the time the VIX is above 16.4 and half the time it's below. Understanding volatility from a distributional perspective is nuanced. Let's move on to the next slide to discuss the chances of falling into the tail of the distribution.",
  "The distribution in this case, defined by a VIX value greater than 30, is just under 7%. Rarely do we see a VIX over 30, meaning that 93% of values are below that. The current VIX is at 16.1 as of the close on Friday, February 7th.",
  "In analyzing a graph from 2024, it is important to consider values beyond just the average when looking at assets like volatility with non-normally distributed prices. The median provides a more accurate representation of the typical value to expect, taking into account the magnitude of each value.",
  "When considering the number of occurrences in normally distributed data sets with no skew, the median and average are typically the same. This indicates a low chance of the VIX going over 30 in the long term.",
  "There is a high chance of the stock trading below the $16 level."
]