[
  "Welcome to Option Trades Today. I'm Tony Batist with a trade idea for February 18th, 2025. The S&P is up $9, NASDAQ up 13, Russell up 10, and Dow down $70. Volatility is up by 16.",
  "focus on the high option volume stocks without considering earnings. Let's move on to the trade of the day.",
  "Today's trade is on SMCI, which is currently up over $5. The stock has a significant call skew and has recently surged from $20 to $50, approaching its previous highs of around $120. This could be a key factor to consider in trading SMCI.",
  "I recently made a trade as a flyer, holding it through expiration with the hope that the stock will go higher.",
  "I normally don't trade this type of ratio spread, but when I looked at the options, there is still plenty of premium available even at higher stock levels. Selling naked options for 50-60 cents doesn't interest me.",
  "I bought the 97 call at 10 Delta and sold two 115 calls for an $18 wide spread. I was able to do this for a 5 cent credit.",
  "currently at 89 cents. This is a rare occurrence, especially for a stock priced at $50. The last time this happened was with GMC. It is uncommon for a low-priced stock to triple in value and still allow for a small credit. The trade is $18 wide, resulting in a maximum profit of $1,800 plus the credit received. The break-even point is.",
  "I broke even on this trade as the price is above its previous high for the year. My break-even point is at $132. I am planning to do a 1 by 2 ratio spread in Tesla to collect the credit. I am taking a chance on SMCI by placing a bullish trade.",
  "I will use $1,600 in buying power for a flyer with a 99% pop. It's important to consider call skew and the possibility of a stock closing around 115, which could result in a large call spread that we will be long.",
  "We have a long call spread with a 9715 call and an additional 115 call that we are short. With an extra $1,800, our break-even point is at the old high from a year ago. This is a speculative trade, so you should have $1,600 set aside that you won't need for the next 31 days. It's best to hold onto this position until expiration.",
  "Choose an expiration where the stock slowly rises to your target price, allowing you to profit $200-$500 on $1,600 in buying power. Consider a closer strike for higher credit but lower probability of profit. For example, buy a strike at 80 and sell at 100, aiming for a $20 spread.",
  "We need to go $100 down to do a 1 by 2 trade with a small debit. The out-of-the-money calls are priced at $895 for a $15 wide spread. This trade will have a similar probability of profit and buying power. The break-even point will be lower at $110. I prefer far out, wide trades for speculative plays like this.",
  "Consider trading SMCI with March options, aiming for prices between 100-120. Ensure you have $1,600 in buying power and are comfortable with the upside risk. Next trade will focus on Tesla.",
  "On the podcast before my break, Tesla's implied volatility Ivy rank was still relatively high at 36, down from when we put on the bullish trade at around 330. I caught the movement back up and will do the same trade, staying more mechanical. I'll go out to April with the stock down at 174.",
  "Today, with the stock down at $174, I am looking to trade Tesla options. I am slightly bullish and will buy one 280 put while selling two 270 puts. This trade allows for a $10 wide spread.",
  "It's already 2:45. The stock was down around 60 cents and has since dropped by about a dollar. The delta is long six, so for every dollar move, it should shift around six dollars. The volatility in Tesla is currently down 2%.",
  "The stock is down 2% since the trade was placed, with high IV rank at 36%. This is a directional trade on a stock that has not participated in recent market movements. Tom's Cherry Bomb today was not favorable to Elon Musk and Tesla.",
  "We will take a contrarian role and put on a slightly bullish trade in Tesla by buying one 80 put and selling two 270 puts. This trade is capital intensive, using almost $5,800, with a 90% probability of profit. The goal is for the stock to increase in value.",
  "Tomorrow, I am looking for the stock to go higher in a big way. I want it to stay above my break-even point of $245 for a high probability profit of 90%.",
  "If you're watching this podcast later in the day, visit the follow page for real-time trade updates. I made a small trade on SMCI, trading at half my normal size. This is a risky trade with potential for a takeover.",
  "Takeover call skew targeting 115 with a stop at 100. In Tesla, a 1 by 2 omnidirectional bullish trade. Consider the flyer in SMCI.",
  "Move your account to Tasty Trade, the top brokerage firm in the Galaxy. Our trade desk is ready to assist you. Your business helps us keep the lights on and continue providing great content on Tasty Live."
]