[
  "predefined intervals available on the new back testing tab on Tasty. This feature allows users to analyze different times in market history, including significant events like the pandemic sell-off.",
  "The software helps you remember certain things. The update will be released on the software version of the platform by early next week.",
  "think by early next week. Choose your intervals to back test a bullish strategy during a bear market. How much have you experimented with the new back testing platform we built? Our research team uses it regularly to validate our strategies.",
  "The main purpose of this segment is to demonstrate how to effectively stress test data before making any trading decisions. It is important to know which data to rely on and how to properly stress test it. This includes knowing which events to consider and how to accurately test for potential outcomes.",
  "It is important to backtest a bullish strategy during both bear and bull markets to see how the results differ. This will help you understand the potential outcomes and make informed decisions.",
  "It's best to backtest a bullet strategy during a market stress test to maximize tradeoff. A study was conducted on a bear market from January to October 2022, with a significant selloff. Using a 30 Delta short put strategy on SPY with 45 days to expiration.",
  "spy 45 days to expiration 30 Delta short put, 50 Delta short put, and the 20 30 Delta short put spread. Testing bullish strategies in a bear market without early management. Easily modify and manage with backtesting software.",
  "Manage a 50% profit. Let's move on to the next slide. The results of the strategy in tough market conditions show a short 50%.",
  "market conditions are unfavorable, with short positions showing negative total PnL. For example, shorting 50 ports results in nearly $4,500 in losses, while shorting 30 ports leads to $2,300 in losses. A short put trade with a delta of 20 and 204 protections results in almost $100 in negative PnL. These losses reflect the challenging market conditions throughout the year.",
  "combine everything in this market interval, you will see the total and average per trade. The new features added in backtesting show your percentage drawdowns.",
  "If you sold a put spread with the 30 Delta long and 20 Delta short, you lost $224 per trade. However, if you sold the $3 put, you only lost $165 per trade. Despite the loss, it feels like a win considering the return on capital was only -22% compared to almost -40% for the other trades. This is an interesting takeaway.",
  "Let's move on to the next page. This is the post-pandemic surge in the bull market. Now let's look at the exact opposite. On the next slide, if you look at the return on capital, you will see that Data Put is over 100, Delta 30 is 69 or 70, and with a 20 for protection, it will be 136% return on capital.",
  "It will be a 136% return on capital in a bull market. S&P is up nine points now. Hasda is up 97. Selling 30 Delta puts performed better in a bull market than in a bear market.",
  "You performed poorly in the bear market. The strategy is to sell 30 Delta puts and hold without management. The losses were a fraction of the gains, highlighting the importance of this approach.",
  "The back testing tool shows both bullish and bearish market scenarios, helping users evaluate trading strategies using historical data to identify successful strategies.",
  "Traders can build resilient portfolios by using strategies that perform well in challenging conditions. By considering both typical and extreme market scenarios, traders can gain a comprehensive view of a strategy's potential effectiveness. In a bear market, losses may occur, but in a bull market, gains can be three times higher.",
  "It's free for everyone with a Tasty TR account."
]