[
  "a history of scary moves. Where do you think the team's going with this one, Mr. Batist? I have no idea. Unless they're looking at the five to 10 percent moves, I don't know. It is Thanksgiving themed, so let's see where the boys are going with this one. For new traders, large moves in the underlying can result in short premium nightmares. Like a 50 point up move at S&S today.",
  "50 point up move at S&S today after being down 100 yesterday. Experienced option traders know that unexpected moves are really scary. Strike placement is determined by implied volatility times the square root of time until expiration. Expected moves at any time scale can be calculated. The reliability of expected moves depends on the time frame.",
  "The reliability of expected moves in trading is around 75% or higher. The accuracy depends on the time frame, with shorter time frames being more accurate.",
  "The accuracy of trading predictions decreases the further out you go. The best approach is to find a balance, such as around 45 days. We conducted a study using 20 years of data to analyze realized returns on the SPY at daily, weekly, monthly, and annual intervals.",
  ", weekly, monthly, and annual scales, we used VIX-derived expected moves to analyze how often the realized moves exceeded one, two, or three times the expected move. In Black-Scholes Theory, these frequencies would be 32, 4.6, and 0.3 for one, two, and three standard deviations.",
  "The daily moves are 32, 4.6, and 0.3. Comparing this to the weekly moves of 20, 1.9, and 0.3, the realized moves and frequency of expected moves are lower for daily moves. This aligns with our strategy of selling daily premium to capitalize on the difference. Transitioning from daily moves to weekly moves.",
  "In the weekly trading world, the numbers improve significantly. Moves decrease from 32 to 17, 4.6 to 1.6, and 0.3 to 0.4. Realized moves are a fraction of the expected move on a weekly basis. Monthly moves show less significant changes.",
  "Monthly moves are similar to weekly moves, which are also similar to daily moves. At 16, 1.5, and 0.4 daily, weekly, and monthly all make sense for the tasty methodology. Outliers may occur, but that is normal in the trading business. Annual moves should be considered as well.",
  "When looking at annual moves, predicting outcomes becomes more challenging compared to shorter time frames. The difference between theoretical and actual numbers may not be significant, with expected differences between 4.6 and 2.4.",
  "You typically don't see moves that exceed two times the expected move, which is the regulatory threshold. Most trades are set up around the one-time expected move, with deltas around 16 or 20. This is why some argue against trading short premium in leaps, as there may not be a significant advantage.",
  "Volatility can change quickly, reducing any advantage. Daily moves are less attractive compared to weekly and monthly moves. Monthly moves are the most attractive option for trading.",
  "When trading on Tasty, focus on the monthly options as they provide the best numbers and lowest frequency. Avoid yearly options as monthly options are more favorable.",
  "If you see an opportunity to sell premium further out, consider taking it. It may not always be the easiest path, but it can be more economical in the long run. Focus on the key takeaways from the discussion and apply them to your trading strategy.",
  "John analyzed the daily and weekly levels of the VIX, which consistently overestimated market moves. The VIX is compiled from 30-day option prices, so outlier monthly data in 2008 and 2020 showed moves surpassing expectations. In annual time frames, the market closely clustered around theoretical IV levels.",
  "The market clustered closely around one expected move, breaking it only three times in early 2008. This makes long-term leaps unappealing for retail sellers as they generate little Theta for their buying power. Strikes at the expected move lack significant implied volatility, with only 30% instead of 32%.",
  "30% instead of 32 and the other ones were down to 16. This study shows the importance of being less rigid to be successful in trading. Good job on navigating through those slots."
]