[
  "As we enter the new year and more traders start to enter the market, it's important to look at how to start trading with a smaller account. Many people ask us how to get started. Today, we have three pieces of research to help with this topic. Unfortunately, Chris Beio is not available today as he's on the road for the holiday.",
  "the industry. Our videos, including ones with our family members, provide valuable information on how to get started in trading. We have a vast amount of content available to help beginners in this business.",
  "With over 14 years of experience, we have created more option content than anyone else. The stock market has seen significant growth in the last few years, with the S&P nearly doubling, the NASDAQ more than doubling, and the Russell increasing by about 800 points.",
  "The Russell has increased by about 800 points. As asset prices rise, new traders may find themselves more capital constrained due to increased capital requirements to trade options. This is a common challenge in the trading business as market prices go higher.",
  "Trading is based on a percentage of notional value. To keep capital requirements low and probability of profit high, focus on finding underlyings and strategies to trade. In December 2019, the cues were at 211 and are now at 531. Meta (Facebook) was at 200 and is now at 600. Netflix was at 300 and is now at 900. McDonald's was at 200 and is now at 300.",
  "McDonald's stock has grown from $200 to $300 in the last five years, showing significant growth. Despite being a large company known for steady dividends, its stock has increased by 30%. Adding long wings to a short strangle may not be advisable.",
  "Consider the impact of price increases on trading strategies like short strangles. Fixed width spreads or iron condors may see reduced profit potential in this scenario. To maintain similar profit potential, adjust the width of your wings accordingly. For example, an IWM iron condor with 20 Delta wings should be $20 wide. This may make it less feasible for smaller accounts.",
  "It is feasible for smaller accounts due to added skew in the market. The probability of profit for an IWM iron condor in December 2019 was 69%, compared to 61% five years later. This represents a 15% reduction in probability of profit.",
  "key. The study found that the probability of profit is the same for the same trade, regardless of the product being traded. This concept of product indifference is central to Tastytrade's approach to trading. As long as the product is liquid, the specific type of asset being traded is not a concern.",
  "The key to successful trading is finding liquid products with tight bid-ask spreads. Company names are less important than the risk-reward of the trade. Look for assets with high implied volatility and IV Rank, as well as high liquidity. Consider iron condors or strangles for smaller accounts.",
  "Traders with smaller accounts can consider trading inexpensive stocks like FXI, EWZ, GDX, and SLV. These stocks have good liquidity and are suitable for strangles with a capital requirement of around $300-$500. Positions are currently held in GDX and FXI.",
  "Small accounts are often limited by capital when it comes to undefined risk trades. Tasty Traders tend to prefer defined risk trades for this reason. Strategic choices like strangles, short puts, or short calls can make undefined risk trades accessible to smaller accounts while still maintaining their benefits. Implied volatility plays a significant role in this strategy.",
  "Implied volatility for both low and high IV underlyings using a defined risk strategy will cost between 20-40% of the credit received. For example, comparing Delta Airlines and CMG, Delta has a higher IV and CMG has a lower IV. Delta provides more credit due to its higher IV.",
  "You received a larger credit with Delta on a one standard deviation strangle and iron condor due to higher implied volatility. This resulted in a bigger credit with high implied volatility. The Delta and price remained the same.",
  "When using undefined risk trades in low implied volatility stocks, there is a significant increase in buying power required. However, in high implied volatility stocks, the percentage increase in buying power is much less, allowing for more undefined risk trades. For example, comparing a strangle to an iron Condor in Delta and CMG stocks.",
  "Iron Condor utilizes the same amount of money as a one standard deviation strangle in CMG. The strangle in CMG requires more buying power due to a lower credit received, resulting in a 58% change compared to 36%.",
  "The percent change is 58 compared to 36 in CMG, indicating higher implied volatility. Iron condor strategy offers defined risk with consistent outcomes. Higher implied volatility results in more credit and lower requirements. Popular assets have more than doubled in price recently.",
  "Assets have doubled in price over the last 5 years, making it challenging for new traders with limited capital. Define risk strategies cost 25 to 40% of the credit received. Trading undefined risk in high IV stocks offers a better credit divide. Prioritize high liquidity for smaller accounts.",
  "High liquidity, moderate to high implied volatility, and high probability of profit with low capital requirements are key factors in trading. This study covers a wide range of valuable information on prioritizing these factors over specific asset names."
]