[
  "Options trading has given me the chance to shape my future. I believe it's a path for me to retire comfortably through trading options.",
  "It's great to see the turnout at live events and realize you're not alone. I was surprised by the large crowd at the event, had to go upstairs to find a seat.",
  "started trading stocks. It's been 25 years since then. Our first events were small, with only a handful of people attending. Now, we host larger events in bigger venues. My first live show was at a small college in Chicago, with about 12 people in attendance.",
  "This Rising Star segment is designed to give insight into retail investors who have discovered self-directed finance, derivatives, and strategic investing.",
  "In addition to owning your own business as a mortgage broker, how much time do you have to trade in the morning?",
  "Options trading has created an opportunity for me to determine my future. I dedicate as much time to it as I do to my mortgage brokerage business. I see it as a path to eventually retire as a successful options trader. I have watched almost every Market measure for the past decade and continue to do so.",
  "started to recover from the financial crisis.",
  "During a discussion about the stock market crash in September 2008, I took a stance against investing in stocks, calling it a scam. My classmates were surprised, but I stood by my belief that I would never own any stocks.",
  "remember my first stock trade vividly. It was during the 2008 financial crisis, a time of extreme volatility in the market. Despite the fear and uncertainty, I took the plunge and made my first trade. It was a nerve-wracking experience, but it taught me valuable lessons about risk management and staying calm under pressure.",
  "Do you remember your first stock trade? I remember mine - I paid $9.95 in commissions to buy two shares of a cheap stock, which raised my cost basis significantly. I couldn't have broken even even if I wanted to.",
  "I initially purchased two shares with $9.95 commissions each. A friend advised me to spread out the commissions over multiple shares to lower my cost basis.",
  "introduced to options trading by a friend who showed me his trades on Facebook. I learned about strike prices, expiration dates, and other metrics associated with trading derivatives. This led me to start trading options myself.",
  "I started trading options and was losing money buying calls and puts. Learning from my losses was a valuable lesson in trading. Strategic investing requires perseverance and learning from mistakes.",
  "start trading options in 2017 and began buying calls and puts. I was learning about decision-making, leverage, and derivatives but was not profitable.",
  "I took a break from trading to focus on my mortgage business. A friend introduced me to a show about options trading, which sparked my interest again.",
  "I realized you could take the other side of the trade, and that's when the Tasty Trade way started in September 2022. During a five-year period, I held mostly Canadian Bank stocks and sold covered calls against them.",
  "Buying Bank stock and selling covered calls can be a good trade to reduce your basis and learn about market structure and risk-taking. In 2022, I started watching Tastytrade and delved into market measures discussed by Tom and Tony.",
  "I started absorbing information and became intent on learning and making something good out of it. When I started trading in a tasty style in 2022, I was 34 years old with an account size of about $60,000.",
  "Did your wife think you were crazy for investing $5,000 or 200,000? She thought I was crazy, but she believed in me because I had a track record of taking risks and succeeding. For example, transitioning from a salary to 100% commission in the mortgage business was a risky move that paid off. Betting on yourself can lead to success.",
  "In 2022, I had a short stint and was still learning, so I wasn't doing well. It wasn't until May 2023 that things clicked, and I realized I needed to do as many trades as possible and let the law of averages work for me.",
  "In 2023, the numbers worked in my favor and I saw a 100% return on my investment. It gave me confidence in my trading abilities.",
  "If I double my money every year, I could reach a million dollars in four years. However, trading doesn't always work that way. It's important to be aware of the risks involved. In 2023, I made at least five trades a day on average.",
  "On average, I make between 13 and 1,500 trades a year. It's more than the average trader but less than some. It's a significant amount compared to when I first started trading in 2015.",
  "I will be making 1500 trades. One valuable takeaway from this is feeling in control of your own outcome. No blaming others or feeling manipulated. Just you and the stocks.",
  "Sometimes stocks win, but recognizing market structure is key to self-determination. Control what you can, like order entry. I don't spend much time managing defined risk positions.",
  "I spend a lot of time managing positions, especially naked ones. I would say my positions are split 50/50 between defined risk and naked. I am very mechanical about managing early, typically around 21 days. I try to avoid getting tested and will adjust my strikes if needed. I am proactive about rolling positions when necessary.",
  "I prefer to trade based on volatility and mean reversion. I am indifferent to the stock's direction.",
  "The stock has been performing well in 2024, with a straight upward trend. Despite some challenges, there has been a positive return on investment.",
  "On August 5th, I learned the importance of having dry powder on hand after experiencing margin calls. I now have a trading plan with three key metrics: 50% buying power unused, 50% cash on hand, and...",
  "I don't trade as often as I would like, even though I have the buying power. I am trying to limit my use of it. I plan to add more capital to my account. Sometimes you need a scary event to put things into perspective.",
  "Top 10 trading moves of the last two decades were short-lived, with one day of activity followed by a significant increase. Certain strategies, like the broken wing butterfly, are preferred.",
  "I prefer trading on the call side with short strangles and spreads. I enjoy selling naked puts as well, which is how I started in the market. It has been successful for me.",
  "naked puts are a tried and tested trading strategy. Covered calls can be capital intensive and inefficient. It may be worth considering focusing more on selling naked puts.",
  "As you look ahead, consider that trading is a long-term commitment. Opportunities and risks will always be present. When running your own business, it's important to carefully assess and manage these risks.",
  "understand the risks of running my own business as an independent mortgage broker. I need to find my own customers, make deals, and stay active in the real estate market. Despite the risks, I enjoy my work.",
  "I enjoy helping clients find financing for homes and trading options. I hope to eventually trade options from an island without having to deal with real estate transactions.",
  "I believe there is optimism in the trading industry. Many people in banking, mortgage, and financial services may not fully understand the intricacies of bonds.",
  "knowledgeable about the bond market and trading derivatives like Bond Futures, options, notes, and ETFs such as TLT. This gives you a unique perspective on interest rate risk compared to other mortgage brokers.",
  "I check the bond yield daily and monitor the TLT to see how the bond market is reacting. This helps me explain market movements to customers seeking the lowest rates.",
  "explained to me that the bond yield had dropped, so we were able to secure a lower rate for the building purchase. It's important to stay informed about the bond market to take advantage of potential rate decreases.",
  "I was discussing interest rates with someone from the commercial lending mortgage side. I mentioned that I have traded around 200 bonds that morning. I told them not to explain it to me as I already understand how it works. Just give me the numbers.",
  "It is important to understand that markets are efficient and mortgage rates move tick for tick. It is not rocket science, they move literally tick for tick.",
  "ticks as possible in the trading market. I will focus on improving my strategies and staying ahead of the game. In 2025, I aim to continue growing and adapting to market changes. My goal is to maximize profits and minimize risks.",
  "My game plan is to get as many people into trading options as possible. I have been a lonely options trader for a long time, with no one to share wins or losses with. I hope to eventually get my kids trading options too.",
  "I trade options and my oldest is eight, a girl. My kids think I'm crazy for watching Tasty Live all day. Girls give you hope at that age, boys not so much. Building communities is important.",
  "Building communities is tough for traders, but I see more widespread adoption slowly happening. Those who discover it and embrace it become big fans and bring others into it. For example, my friend Sam got into trading less than 6 months ago and is now crazy about options, reading charts and discussing strategies.",
  "He is passionate about options trading and believes it is important to have control over your own decisions in active investing. The hope is that the finance space will embrace this self-determination aspect of trading.",
  "This has helped me with my decision making as you have to make quick decisions. It helps process everything in your brain much faster. It's a huge win for you. Thank you, Dennis, for being our Rising Star. I'm Tom Snoff, and I hope you enjoyed this."
]