[
  "Part two: Understanding premium decay. In part one, we showed that the realized premium decay curve is very close to the theoretical one for at-the-money SPY options. Since most traders sell out-of-the-money options, does the actual out-of-the-money decay also follow theoretical? Let's move on to the next slide.",
  "Theoretical decay for out-of-the-money options decreases approaching expiration. Historical data will show the importance of managing out-of-the-money options at 21 days or 50%.",
  "We focus on managing at the money options at a 25% decay rate to minimize risk. Selling in the money options disrupts our mechanics, so we prefer out of the money options. A typical study shows non-movement in 16 Delta puts at 45 days to expiration over 10 years of data.",
  "puts recorded the non-movement in Curren's stock price, which is less than half a percent away from the original stock price. Just like the theoretical curve, the out-of-the-money Theta tapers off approaching expiration due to the low probability of an option being in the money. When an option gets cheap, it tends to just sit there.",
  "the in-the-money options. This means that the options with lower Delta values will experience faster Theta Decay compared to options with higher Delta values. It is important to consider this when trading options with different Delta values.",
  "the further out of the money options decay faster than at the money options. At the money options decay slower. In the money options would show an inverted pattern, making it confusing. This graph shows the speed of at the money options versus the 50 Delta option.",
  "We manage the 50 Delta differently than the 16 Delta. Over the past 10 years, further out-of-the-money options tend to reach 50% of their max profit more quickly. Consider the differences in premium between out-of-the-money options.",
  "The premium difference between out of the money and at the money puts is significant. For example, the at the money put has $750 in premium, while the out of the money put with a 16 Delta has $23. The average profit per trade and return on investment are lower with out of the money puts. However, when managing trades with a 21-day trend of exiting with profits exceeding 50%, the results are similar.",
  "In trading options, the at-the-money options collect more premium per day compared to slightly out-of-the-money options. This is due to the symmetrical nature of options trading - more risk equals more potential profit.",
  "Taking more risk without being adequately compensated for it can lead to unfavorable outcomes. By controlling for Delta, we can measure the impact of theta on a trade's return on investment. Out-of-the-money options tend to reach their 50% profit target faster than at-the-money options, which is why we manage strangles at 21 DTS or 50% and straddles at 25% of their maximum profit.",
  "Sell in the money options at 50% and straddles at 25% of their max profit. Manage based on trading premium, not intrinsic value."
]