[
  "Intraday seasonality analysis for S&P 500 using 15 years of market indices and Futures ETFs. We convert 5-minute price and volume bars into intraday percentiles and calculate the average for each symbol.",
  "Analyzing percentiles for each symbol reveals intraday, monthly, and overall strength. Market indices are typically lower in the morning and stronger in the afternoon. VIX tends to be higher in the morning and weaker in the afternoon. Lower risk as time passes.",
  "In bull markets, prices typically open lower in the morning and rise higher in the afternoon. This trend is the opposite in bear markets. Over the past 15 years, we have been in a bull market, leading to lower morning and higher afternoon prices. This phenomenon is worth studying as we move forward.",
  "best time to buy the dip or manage a short position is around 10:30 to 11:00 Eastern Standard Time. The market is weakest during this time. The heat map shows weakness in the morning and strength in the afternoon for market indices, while the VIX shows the opposite trend.",
  "The Greener the higher the price of the day. It's a heat map for all market indices and VIX Futures. The average 5-minute percentile crosses around 12:55 Eastern Standard Time, with the VIX surrendering around 1:00 Eastern Standard Time due to being inversely correlated. Be cautious with zero DTS and the upside risk in Bull markets when being long.",
  "In Bull markets, trading volume typically follows a U-shaped curve throughout the day. Volume is lowest in the middle of the day, decelerating from morning to noon, then re-accelerating in the afternoon. It is best to trade during the busiest times, such as the morning and close. However, with advancements in technology, timing may not be as crucial.",
  "Technology has changed trading dramatically. The theory behind buying the dip in the morning is that it is a bull market phenomenon. Lighter volume may also make accumulation easier.",
  "Volatility tends to peak in the morning and decline in the afternoon. Fear is often overstated, and as the day goes on, people become less fearful. It's like riding a roller coaster - you may be scared at first, but once you're on the ride, you realize it's not so bad.",
  "This is a correlation heat map showing the average price percent over time, confirming a weak or strong PM in a bull market pattern. It may not last indefinitely, but so far, it's looking good.",
  "The market has been bullish all year, but in December we saw some two-sided action with the VIX and market behaving differently. The market has been down slightly in the last couple of weeks, indicating a choppy December.",
  "vix tends to be strongest around 10:15 eastern time and gradually declines by 12:25. January is among the highest volume months due to leap options and traders returning with a clean slate.",
  "By 12:25 in January, the VIX is overtaken by major market indices and moves in the opposite direction. February, along with November, is historically one of the best months to buy the morning dip. These months often see the VIX's early morning volatility fade.",
  "VIX morning volatility fading, creating trading opportunities. Historically, end of January and early February have shown market weakness followed by strength. Strongest average VIX five-minute bars between 10-11am EST. Bullish trend post-2008 financial crisis in 15-year bull market.",
  "trading during a bull market involves buying the dip and understanding monthly trends. Each month has its best 5-minute bars and low AM high PM phenomenon. The VIX has shown an inverse pattern from September to December, making these months the best for trading.",
  "September to December are the best months for buying morning dips. February, May, June, and November are particularly favorable."
]