[
  "Market measures part three zero DT timing 24 marked our first full year of gathering the zero DT data. We will review our best research of 24 and explore the importance of timing in zero DT trades. Our study used one year of data on zero DT SPX options collected every 10 minutes for 15 years.",
  "We analyzed selling strangles with 20 Delta legs at market open and 45 days expiration. The data shows the hourly performance as a percent of the initial credit for zero DT trades and the weekly performance for 45-day expiration trades.",
  "Weeks vs. hours: 4-5 days to expiration strangles. First two weeks average P&L change 11%, second two weeks 24%, third week -2%, final week +16%. Standard deviation of change: 6% manageable, 12% manageable, 28% and 53% challenging.",
  "return on the Zero DTS strangles varies throughout the trading day. In the first two hours, the return is 19%, in the second two hours it is 34%, in the third two hours it is 56%, and in the final hour it is 153%. It is important to note that the average return in the first two hours is not significant.",
  "In the first two hours, there is potential to make money. It is not advisable to hold until the end of the day. The Zer GT and 45 de St expiration trades had more stable prices early on.",
  "Thank you for managing winners and capturing early success. The zero DTS strategy allowed for more opportunities for traders to succeed using their own style and risk tolerance. Traders could choose to stay in losers and hope for recovery before the close, leading to success later in the day. Trading with zero DTS may be a good idea even if you missed the initial opportunity.",
  "Consider trading zero DTS even if you missed the market opening. Using 20 months of data in the SPX, zero DTS is a viable option for those with smaller accounts looking to trade without pattern day trading rules. This strategy can also be applied to ES options, which have the same underlying products. Selling zero DTS can be a profitable approach for traders.",
  "We analyzed selling Zer DT strangles using 20 and 30 Delta strikes at market open times of 10 a.m., noon, and 1:30 p.m. (CT). All trades were managed with a 25% loss threshold. Trades that did not reach 25% were allowed to expire. All trades were assumed at mid price. Next slide. Here are the 20 Delta strangles on Zero days at market open, resulting in an 89% win rate.",
  "At market open, you achieved an 89% win rate by placing trades at 10 a.m. The timing of your trades mattered more for profitability than the win rate. Putting trades in early in the day resulted in significantly higher average PNL. The first two hours are crucial for trading, as the majority of P&L is generated during this time.",
  "Since trading Zer TTS in 23, they have been consistently profitable for short premium traders who take profits early and choose strikes by Delta. The trades automatically adjust for current volatility levels and time remaining in the contract, providing consistent success probabilities. Zero TT trades have had more success stories for those who hold on through expiration than 4-5 day trades. Retail traders can expand into new arenas with confidence.",
  "Placing new trades late in the day or late in a cycle can be detrimental."
]