[
  "Welcome to the life cycle of a trade series where we discuss trade entry, management, and closing orders. Today, we will cover a strangle position in DraftKings. DraftKings has a 38 IV rank, a recent rally, and high implied volatility. It has been range-bound for the past year, making it a stock of interest in this portfolio.",
  "I trade DraftKings in my portfolio because I use the product. The stock has high implied volatility, currently at 55%. This makes it a great trading opportunity.",
  "Based on option prices, the stock is expected to either increase or decrease by 50% over the year, indicating high implied volatility. The price action has not reached these extremes yet, with a current Ivy rank of 37. This suggests a high premium and warrants consideration for a position.",
  "I'm looking to enter a position for October 18th expiration, which is a monthly expiration. The volume is relatively low.",
  "Volume is low this morning, but open interest on these options is high, in the thousands on each strike. Bid-ask spreads are narrow, with weekly options having less volume and open interest.",
  "With less open interest, options have wider bid-ask spreads, making it harder to buy and sell at the same price. For example, selling to open an option at the 33 strike at 82 may require buying it back at 110.",
  "To buy back, it might trade at A110 due to wide markets with low volume and open interest. Tight bid-ask spreads are preferred for fair pricing. Looking at DraftKings options for October monthly.",
  "You can see Penny wide markets here, which is normal. I am looking for a strangle to get short premium. I aim for a 20-30 Delta and like to sell at least a dollar of premium. I would lean towards the 34 strike at a 26 Delta on the upside.",
  "I want to collect about a dollar short the stock has rallied significantly in the last couple weeks leaning into the 40 strike call at $2 and change. Stock price is in the 30 handle at 36 and change with high implied volatility.",
  "consider when trading these types of options.",
  "This stock is good for beginners as it doesn't require a lot of capital and has high implied volatility. I have traded it successfully before. Trying to get filled at 214 for a strangle position.",
  "We are short the 3440 strangle in the October monthly expiration. DraftKings has rallied above $40, requiring an adjustment to our position. We received a $214 credit for the delta neutral strangle we put on the 11th. The stock is currently trading around $37.",
  "The stock was trading around 37 when we placed our trade. Since then, it has rallied about 4.5 to 5 points. Our Delta neutral strangle in October is currently in the money on the call side, with a loss of about 50 to 60 cents despite the stock's 10-12% increase.",
  "The stock is up 10-12% since that time frame. We have 23 days until expiration. We could consider rolling this out to the November expiration, which is projected to have earnings in early November (not yet confirmed). Volatility is 57% versus 43% in the front October expiration.",
  "I will avoid trading around earnings and roll up the 40 strike put to create a 40 straddle for a credit of about $1. This will move my break-even point to around $43.",
  "Price is currently at 43. If it goes up, it could reach 43. If it goes down, it could hit 37. I aim to capture another dollar over the next few weeks. I will try to roll up at 104 and adjust if not filled. I got filled at 103.",
  "I made adjustments to the opening order, with the average trade price at $317. Currently, it is marked at $374, resulting in a $55 loss. I have a 40 straddle and may consider taking it out to November if the stock continues to rise. I could either keep it as a straddle or buy the guts and sell the wings.",
  "Sell the wings by buying the at-the-money premium, selling an out-of-the-money strangle for a small credit to adjust break-even points. The outcome depends on stock movement and volatility. A pullback could benefit the position, potentially leading to a profitable exit in the next few weeks if there is sideways action.",
  "If we can see some sideways movement, we can roll out our DraftKings position to November. We initiated this trade on the 11th, and it has experienced some ups and downs since then. Currently, we are back to where we started, and we have adjusted our put spread accordingly.",
  "We rolled up the put spread from the 34 to the 40 strike for a $1 credit. Our total credit is $3.17, marked at $3.09, resulting in a scratch P&L. The position is now a 40 straddle after rolling up during a recent up move. The stock has since dropped $4, but the rolled-up put has not significantly impacted our position.",
  "We initially paid $1 for the roll up, costing us around $100. Currently, the position has an intrinsic value of $0.60. With 10 days until expiration, the position is trading at over $3. If the stock remains at $27.51, the position would decrease to $2.50 as the put would be $2.50 in the money.",
  "The put is $2.50 in the money, while the call would expire worthless, leaving only 50 cents more of value to be gained from this position. If the stock rallies to $40, both options would have minimal extrinsic value at expiration, potentially leading to a bigger win. However, the outcome is uncertain and not something we can rely on.",
  "I will take a long position and roll it out to November. Earnings are expected between November 1-15, but I am not worried about that. I am leaning towards a long position up to the 40 handle.",
  "I will roll this position as a straddle for a net $293 credit. Rolling short options does not require additional buying power and maintains the same risk level. Collecting premium reduces overall risk and increases potential value.",
  "By rolling forward the risk, we are not adding any additional risk. The position will lean directionally long, reducing our directional exposure. We will have 20 long Deltas instead of 60, resulting in a net 20 Deltas long.",
  "We are adjusting our directional exposure and rolling our position to try to get a $29.50 credit. We were filled at $22.90 on this roll.",
  "Filled at $22.90 credit on rolling to the 40 straddle in November. Net credit now $6.7, break-even at expiration in 38 days will be $6 below the 40 strike put, putting us at around 34. Profit expected anywhere between 34 and 56 over the next 30 days. Managing strangle to straddle, rolling out in time.",
  "I could have adjusted the strikes, but I chose to be at the 40 strike straddle. We have a position to manage with a closing order for our DraftKings position. E-mini S&P 500 futures are up 100 points this morning due to election volatility.",
  "the trading context, Futures are down almost 7% to start the session. We have a DraftKings position on a straddle at the 40 strike, which we started as a strangle. We rolled up the puts and extended the expiration from October to November for a $67 net credit. The position is currently marked at $458 going into earnings tomorrow after the close. Today's move up 4% is favorable for us.",
  "We entered this position on September 11th around 34-35. The stock went up to 43, then back down to 36. Currently, it is in the middle of that range, so we are taking our profit and closing the position. We may consider a new position in a future video.",
  "We will close out the position for a $151 profit at 456. If not filled, we will adjust to 454. We got filled at 460 for a $147 profit in the Johnny portfolio.",
  "We used a couple hundred dollars in total buying power on that position, making it a nice trade for us."
]