[
  "Traditionally, traders believed a strong currency would negatively impact the stock market. However, the US dollar has been strong while the stock market remains near record highs. The correlation between the US stock market and currency has not followed this belief.",
  "The US stock market and US currency have not shown a strong correlation over time. Currency plays offer a unique trading opportunity, but so far, shorting the dollar has not been successful.",
  "If the US Dollar's value is rising, the stock market is generally expected to trend downward. This has not been the case until the last three days. A strong dollar combined with high interest rates could potentially slow trading.",
  "High interest rates could slow economic growth and reduce investor confidence. Companies with global exposure may face reduced competitiveness as a strong dollar translates foreign revenues into fewer dollars, impacting overall earnings. Capital may shift to bond markets or other high-yield investments instead of equities.",
  "Investors are turning to yield investment vehicles over equities for higher yields in the debt market. Lower stock prices and a strong dollar are driving this shift. The US dollar is currently at its strongest point in the last two decades.",
  "The dollar is nearing its highest level against the Yen in two decades and its second highest level against the Euro. The US Treasury yield has also reached its highest level since 2007, surpassing most developed countries.",
  "S&P 500 companies. Japan has consistently had interest rates in the 1% range, while the US and UK have rates around 4.5%. Foreign revenues account for 28% of the S&P 500's total revenues, with over 3,000 US companies involved in foreign production.",
  "Many large multinational corporations have more than half of their sales outside of the US. For example, Intel generates 78% of its sales internationally, while Coca-Cola is at 68%. Traders from around the world using Tasty Trade generate around 20%.",
  "Using Tasty Trade generates around 20-23% of our revenue. We wanted to analyze if a strong dollar negatively impacts stocks. We track the US Dollar Index (USDX) based on exchange rates between the US dollar and six major currencies.",
  "strong negative correlation between the S&P and the US dollar. This means that when the dollar strengthens, the stock market tends to weaken.",
  "market.",
  "between the dollar and stock market performance is not as strong as some may believe. In certain years, such as 1997, 2005, 2014, and 1992, the market saw positive returns despite a strong dollar. This suggests that a strong dollar does not necessarily lead to negative market performance.",
  "The correlation between the dollar value and stock market performance is negligible. In the weakest years for the dollar, the correlation is slightly stronger but still weak to moderate. Overall, there is no strong pattern between dollar value and stock market performance over the long term. The stock market tends to go up consistently.",
  "The S&P is up while the US dollar is down. The correlation between the two is low at 0.2 or 0.3. The US dollar is down 16% this year while the stock market remains unchanged.",
  "Dollar's value and the overall market. The correlation is negligible and stock market returns are mixed and random. Evidence shows a weak correlation over the long term.",
  "There is a weak correlation between the US dollar and stock market returns. The relationship is so random that it is impossible to predict if a US dollar sell-off will cause stock market movements."
]