[
  "Welcome to the life cycle of a trade series where we discuss trade entry, adjustments, and closing orders. In this video, I will show you how to turn a broken wing butterfly into a risk-free butterfly on Tesla. I am looking at a broken wing butterfly on the call side for a small credit, targeting the 295 level. My first long strike is at 265.",
  "265 is my first long strike. I'm selling two of the 280s and buying one of the 305, creating a 15 by 25 long to short spread with a $1,000 max risk. There is a small 37 cent credit with no risk to the downside. Playing for a potential v Crush or bounce from current levels. Tesla has dropped significantly in recent weeks. We put on a butterfly trade on the second to take advantage of the price movement.",
  "The stock price has dropped from 243 to 219. We had a wide butterfly trade using more capital than usual. We were long the 265, short two of the 280s, and long one of the 305s. The long spread was 15 points wide and the short spread was 25 points wide. We used about $1,000 in buying power for this trade at a 37 cent credit.",
  "A 37C credit is currently marked at about a 30C credit to close this position. The far out-of-the-money call spread has become cheap, with the long option retaining some value. This is a case where a broken wing butterfly trade can be entered and closed for a credit.",
  "We can close out the at-the-money long spread for a credit of around 30 cents, resulting in a profit of $66 or $65. Earnings are coming up on the 23rd.",
  "Earnings for Tesla are on the 23rd, leading to heightened implied volatility and potential big moves in the stock. Consider buying in this risk to potentially profit from any wild price action. This can be done through broken wing butterflies and ratio spreads.",
  "One way to manage risk is to buy in the spread. For example, with a 15-point wide long spread, the risk would be around 95. The maximum profit could be $1,500 if the price reaches 275.",
  "Buy at 275, risk at 295. Sell at 305, buy at 295 to free up capital. Butterfly at 265, 280, 295 for a 15-20 cent credit with a potential profit of up to $1,500.",
  "I bought at 15 cents and my average trade price is 22 cents, locking in 7 cents of profit. I freed up capital by selling at 22 cents. The stock is now trading at 220.",
  "220 is a low probability strike, but we can quantify the probability by using the Delta. To estimate the probability of touch on a strike, double the Delta. For example, a Delta of 11 would give you a 20-22% probability of touch.",
  "There is a 20-22% probability of reaching 265 in the next 25 days. The current trading price is 44 cents. Leaving this position open could result in up to $1,500 in potential profit with a 20% probability.",
  "The stock is approaching $265, close to where it was a few weeks ago. Hoping for a pop on earnings to around $240-$250 for a potential profit of $1-$2. Risking 40 cents for a 20% probability trade.",
  "Closing our Tesla broken wing butterfly position after earnings. Tesla reported a $36 move, much higher than the expected $4 or $15. Time to take the shot for big bucks on little Johnny's account.",
  "The stock has moved beyond the expected range of $4 to $15 leading up to earnings. We are now back to our original position. Time decay has worked in our favor, resulting in a profit of about 65 cents on our initial trade at 15 cents.",
  "have already made a profit of 22 cents on this trade, covering all fees and commissions. The net on the position is currently around 60 to 65 cents. The decision to hold or close the position is subjective.",
  "I took profits of $160 from a trade that saw a significant increase in value overnight. If you choose to hold onto the trade until expiration in 22 days, the risk moving forward is just the profits you have made.",
  "looking to take off the table.",
  "I'm ready to take profits and move on to new trades, possibly in Tesla. To execute this order, you would buy two of the 280s and sell out of the 295. The spread is currently 20 to 30 cents wide.",
  "Stock is moving slightly, aiming for $160 and then $158. Closed out of a butterfly trade for a credit of $159, netting $181 profit in 21 days.",
  "21 days, a successful trade with earnings boosting profits. Looking to replicate in the future. Tune in to Johnny trades every Wednesday at 9:40 a.m. on tasty live."
]