[
  "great opportunity to put on an iron condor trade to take advantage of the expected decrease in volatility after earnings. Let's dive into the trade setup.",
  "I don't have a position on it, but I think it's a good trade for an earnings V crush. There seems to be speculation of a big move in either direction. I'm playing for a neutral outcome, so I'm going to December for a less binary profit or loss compared to the two-day weekly. This trade will provide less instant pain or gain but more stability.",
  "I will make a trade that will provide me with more management options in the future due to lower volatility. With a 61% implied volatility currently, I expect a V contraction of 6 to 10 points by the end of the week. I will trade in December, selecting options with around 20 Deltas on each side and a $10 width on an iron.",
  "On either side, go $10 wide on an iron condor. I'll do the 130 strike on the downside and the 120 to define the risk. I'll go to the 22 Delta at 130 on the upside. Short at 165 and buy at 175 strikes. Trade at around 1/3 the width of the strikes, $325 to $26. $600 in risk. Look at the curve view for an idea of how our trade is performing.",
  "view our risk profile through the end of the week and month to assess profit potential. Without V contraction, profit or loss widens. Examine expiration for binary profit or loss on December 20th.",
  "On December 20th, the break-even point is between $125 and $135, with a potential upside of $165. If there is a significant movement, the trade could reach $150. The expected move by the end of the week is $11, so a $5 to $6 move in either direction could result in a successful trade.",
  "An $8 to $10 move typically results in a 50-70 cent profit. Anything greater may result in a loss or break even, depending on volatility. Let's route this order above the mid price. The market is moving, and we got filled on the iron Condor at 36 with a price improvement of a penny. High frequency trading is in play.",
  "We will be managing this position into earnings. We have a closing order for our Nvidia iron condor trade in the December monthly expiration. Our focus was on volatility and playing an inside move.",
  "We were planning to make an inside move with an expected $12 move. The options we were looking at closed at $45, moving about $7 from the previous day. The straddle price yesterday indicated an expected move of around $12.",
  "The straddle price was trading at $12 yesterday, indicating the expected move through the end of the week. It is now trading at $4, showing a significant decrease. If you sold the straddle, you likely made a profit. The monthly implied volatility is moving in line with the back months, with December at 47.",
  "The implied volatility for this trade decreased from 60% to 47%, resulting in a gain of 13-14 points. The stock remained stable after earnings, making this trade successful.",
  "Stock position was a home run, perfect for us. Taking profits now. Looking at a $100 profit overnight with a 217 or 216 debit. Let's aim for $100 profit. Adjusting to 217 pH, then 218. Markets are moving.",
  "pH 218 markets are moving with volatility this morning. Futures have been fluctuating. We exited a trade at $21997 profit overnight, selling at 60% implied volatility and buying back at 47.5%. Underlying price remained unchanged.",
  "Ivy rank dropped from 45 to 25 post-earnings, indicating low volatility. Delta remained near zero today, with Theta decay decreasing by about $7. Extrinsic value has also decreased, resulting in a successful trade.",
  "A great example of implied volatility and post-earnings report volatility."
]