[
  "am now a seasoned trader with extensive experience in building and managing portfolios. Today, I will be sharing my insights on portfolio construction and the strategies I have developed over the years. Let's dive in.",
  "I was a market maker on the floor of the Chicago Board Options Exchange from the early 80s to 2000, primarily trading in the S&P 100 (OEX) pit. It was the largest pit at the time, with about 4-500 people in a small area.",
  "I have experience in trading since the 80s and 90s, including the dot-com boom. I co-founded thinkorswim with Scott Sheridan after trading together on the floor and running a prop trading firm.",
  "We started Tasty Trade in 2011, a digital Financial Network now called Tasty Live. In 2016, we launched Tasty Works, now known as Tasty Trade, the largest Boutique options and derivatives firm globally.",
  "We are a leading global trading firm with a strong presence worldwide. I have spent my entire career in this industry, emphasizing credibility and validation. I do not sell anything, but aim to help people use our services effectively.",
  "Today, we are focusing on building a portfolio with our brokerage. Our model is based on sharing knowledge to change the world of finance. We have made progress but there is more work to be done. Let's pass the torch to the next generation.",
  "It's Wednesday, 11:00 AM Central Time on Feb 28th. This content is about managing the portfolio. Part two will be on March 27th at 11:00 AM for one hour.",
  "I host webinars to prepare for live trading events in eight cities. Sign up for the events at tasty.com/events. Sessions will be available on the website in about a week.",
  "scroll down to listen to a repeat of the show and access all slides. The same will be available for part two during the live event later this year. Slides from future events will also be accessible for training and educational purposes.",
  "We will be hosting a digital version of the event later this year, allowing for digital collectibles like NFTs. Everything is free thanks to our partners, the Chicago Board Options Exchange and the Chicago Mercantile Exchange.",
  "Both exchanges have stepped up to help with the cost of these expensive events. Sign up for part two at tacylive.com in a month. Get ready for a lot of content coming up.",
  "Today, I will cover a variety of trading topics such as stocks, options, futures, and futures options. This is the first collaboration between option exchanges and futures exchanges. I am product indifferent, meaning I trade anything.",
  "Build a capital-efficient portfolio in 2024 by diversifying across various trading products such as futures, stocks, crypto, options, and ETFs. Focus on the efficiency of each product rather than the specific type.",
  "Today's focus is on capital efficiency and covering all product classes. We will discuss portfolio allocation in the next session. These topics are based on the feedback we receive from 5 to 7,000 emails.",
  "We receive 5 to 7,000 customer emails daily. The majority of questions pertain to portfolio allocation, capital efficiency products, and building a directional case from a professional perspective. Retail traders typically focus on technical analysis and some macro factors, while professionals consider a broader macro perspective.",
  "Today, we will cover building a directional case in trading by incorporating both quantitative and subjective analysis. This includes looking at price, volatility, and utilizing statistical and probabilistic methods to assess a portfolio.",
  "is also very informative. We will discuss various ways to manage a portfolio and provide valuable insights. Check out our upcoming events on tasty.com for more information.",
  "The show will be heavy and educational with six speakers who work for us and are professional speakers on the network. They cover the educational side of trading.",
  "Thank you for joining us today. If you have any questions, feel free to ask Anthony, Brittney, Christian, or our trade desk team in Chicago. I won't be monitoring the chat during the talk.",
  "During this webinar, we have three people available to answer your questions or point you in the right direction. Feel free to reach out to me at Tom@tasty.com. Let's get started.",
  "I will be discussing the combination of various products and strategies for building a portfolio. We will cover stocks, futures, and options. This talk will focus on active traders' interest in portfolio building.",
  "Product diversification is a key concept in trading. It involves more than just investing in different stocks. It's important to consider different ways to utilize buying power effectively.",
  "our account's buying power. We need to determine how to allocate this buying power and what level of leverage we are comfortable with. By comparing the amount of money we are using to a notional equivalent, we can gauge our buying power reduction. Trading in 2024 allows for efficient management of buying power reduction.",
  "Capital management is essential for active traders to balance their net worth and risk. Building a portfolio for active trading differs from a typical portfolio. At Tasty Trade, our breakdown is similar to this approach.",
  "Our business consists of about 80% options, 10% Futures, 10% Futures options, a small percentage in cash, and a small percentage in digital assets. When building a portfolio, about 20% of my active portfolio is in equities. Stocks may not be as effective for buying power in an active trading account, but they still play a role in diversification.",
  "Futures and futures options are typically used for about 20% of buying power, while stocks are also used for about 20% of buying power. Stocks may be preferred for making adjustments to positions or if the underlying is not liquid enough for futures trading.",
  "Be aware that around 20% of buying power is allocated to trading Futures and Futures options. Positions primarily consist of Futures options, with some pairs trading involving two highly correlated Futures - one long and one short, or two offsetting each other. This strategy involves betting on a contraction or expansion.",
  "Betting on either a contraction or divergence from current trading levels in futures and futures options requires about 20% of buying power. Futures are more leveraged than stocks and options, with options requiring about 50% of buying power. This includes ETF options, listed equity options, and index options. The combination of these different option markets can impact trading strategies.",
  "trading context changes. For example, with the stock market at record highs, index volumes have dropped while equity volumes have increased. Equity options currently have higher volatility than index options, but this can change based on market conditions.",
  "We allocate 20% to stocks, 20% to futures and futures options, and 20% to listed option strategies. We also keep around 10% in cash for flexibility in trading.",
  "These are trading strategies with defined and undefined risk, along with a cash position. When putting these positions together, it's important to monitor and understand the capital being used through buying power. This helps in measuring and managing the overall risk.",
  "can measure the risk associated with your trades. As you become a more active trader, understanding what positions you have on is crucial. One way to figure this out is by beta weighting your deltas. This allows you to compare different positions and assess their risk levels.",
  "To compare different positions such as IBM, Nvidia, soybean, bond, and S&P, we convert everything into SPY Deltas. This beta weighting simplifies the comparison and makes it easier to analyze.",
  "In 2024, almost every trading platform uses beta weighted Deltas. This concept was introduced in 2001 and has since been adopted by all platforms. Understanding how non-correlated underlyings are defined is crucial. On the right side of the page, you will find a list of these underlyings. At the top is ES, which represents the S&P 500 futures. Everything is beta weighted towards the SPY, which is equivalent to ES.",
  "The Spy and the ES are the same thing. Beta weighting to the Spy means beta weighting to the ES. Below that are the NASDAQ future and Russell future. Bonds, gold, crude oil, and natural gas are not correlated to stocks.",
  ", we can diversify our investments across different asset classes to reduce risk and increase potential returns. This is because these assets have low correlations with each other, meaning they are not likely to move in the same direction at the same time.",
  "Euro 6E is another underlying that we feel is not correlated. This is important because it can have a positive impact on a portfolio. There are ETF equivalents to Nasdaq futures such as the q's and to rty such as iwm.",
  "The Q's ETF is equivalent to RTY, IWM to ZB, TLT to GC, GLD to NG, and UN to FXE. Having a non-correlated portfolio can reduce volatility by about 35%.",
  "It results in a 35% reduction in portfolio volatility. This means reducing swings in your portfolio by $100, $1,000, or $10,000. To achieve this, create a portfolio with uncorrelated underlyings by introducing Futures.",
  "Introduce Futures and Futures options alongside stock and stock options to reduce portfolio volatility and outlier risk. While outlier risk cannot be completely eliminated, this approach can reduce over 90% of it.",
  "reduces over 90% of outlier risk by having a portfolio of truly non-correlated underlyings. This allows for smaller capital allocation, reducing outlier risk. Creating a diversified portfolio using various underlyings is key.",
  "By using various underlyings, you can reduce portfolio volatility, including intraday and overnight swings, and minimize outlier risk by diversifying your positions. Let's pick up the pace and continue.",
  "If you're new to trading, some of this information may seem overwhelming. Feel free to reach out to me at Tom@tasty.com or attend one of our Live Events. I highly recommend signing up for Live Events as they tend to fill up quickly.",
  "Sign up early to secure a spot in our upcoming trading sessions. By including non-correlated assets in your portfolio, you can reduce overall volatility. This can lead to a 30% reduction in volatility, even when assets are equally weighted.",
  "When combining the daily volatility of the S&P 500 (plus or minus 1.2%) with a bond portfolio (plus or minus 0.7%), a 50/50 split reduces the overall portfolio volatility to 0.72. This demonstrates the effectiveness of diversification in managing risk.",
  "volatility, but on the other hand, you might have something that has a higher volatility. So, when you put them together, you can actually reduce the overall volatility of your portfolio.",
  "On one hand, you have assets with low implied volatility like the Euro at 7-8% and on the other hand, assets with higher volatility like Bitcoin at 45-55%, Nvidia at 45%, and Apple at 25%. You can also use ETFs like SPY or IWM to combine low and high volatility assets for trading.",
  "Combining low volatility assets with higher volatility assets, such as natural gas, can help reduce overall portfolio volatility. This can help minimize outlier risk and intraday swings. Next, we will focus on analyzing the optimal Decay curve for premium selling.",
  "I prefer selling options and spreads over buying them. In the world of options trading, everything is fairly priced, whether it's futures options or listed equity options. When trading liquid products, there is no edge in buying or selling.",
  "focus on trading liquid and diversified underlyings. While there may not be a theoretical edge in buying or selling listed options or futures, you can optimize your trading mechanics to improve your chances of success.",
  "To optimize mechanics, stay in the optimal point in the Decay curve. Managing a portfolio early reduces volatility and outlier risk. The goal is to reduce portfolio volatility.",
  "The portfolio is actively traded to reduce outlier risk. Adding duration beyond 20 days can help mitigate volatility.",
  "increases optionality by extending the duration of the trade. Timing in markets is difficult, so buying longer durations allows for more flexibility and increases the chances of being right in the trade.",
  "longer expiration date which gives me more time for the trade to work in my favor and increases the volatility of the underlying asset. Different durations offer various strategic opportunities and diversification for my portfolio. I can diversify by underlying asset, strategy, implied volatility, and duration.",
  "diversify by duration with a slide showing 45 days to expiration. The optimal point in the Decay curve is where 75% of your profits come from.",
  "The optimal point in trading is during the Decay curve, where you can make the most money. The fastest rate of decay occurs in the first 24 days, while the slowest rate occurs in the last 21 days. This is where you make one quarter of the month's profits.",
  "When people first see this slide, they may be surprised. Calculating expected move is based on volatility, which measures how much an underlying asset is expected to move in efficient markets. Volatility is essentially another word for expected move.",
  "the underlying asset. Understanding the expected move helps traders determine where to set up short strikes and manage their expectations for the market.",
  "knowing the expected move for the next 45 days can help you set a target for selling a stock. For example, if you bought stock XYZ at $1 and the expected move is $11, you now have a target to aim for when selling. This number is hit 68% of the time.",
  "the price target for your trade will help you determine the best exit point. This information is crucial whether you are buying stock, selling a call, getting short a naked put, or implementing other trading strategies. Stay tuned for more details in our upcoming webinar.",
  "In trading, knowing the expected move is crucial. The Delta of an option is a reliable measure of expected move. Professionals use this to make informed decisions.",
  "Professionals use expected move and Delta interchangeably to assess the chances of a trade working. Understanding expected move simplifies the process of determining trade probabilities.",
  "trading industry. With over 700 people in this chat and potentially thousands more listening, everyone here is highly knowledgeable. The key to success in this industry lies in understanding the nuances of finance.",
  "In the trading world, understanding the nuances of finance in futures, options, listed equities, listed options, and index ETFs is crucial for optimizing mechanics and know-how. Professionals use expected move, which is interchangeable with Delta, to gauge reasonable expectations, context, and probability of profit on platforms like Tasty.",
  "On the Tasty platform, we display the expected move for different time frames, such as SPX for zero, one, two, and five days. It's simple and easy to understand. Other platforms may not provide this information.",
  "If a volatility index is around 19%, the expected move for that day is about 1%. This concept is interchangeable among commodity options, equity options, and other trading products. Now, let's discuss capital efficiency across different product classes.",
  "Three people are answering questions, nothing is off limits. Email me at Tom@tasty.com for more questions. Event available in one week on tasty.com events page.",
  "Scroll to the bottom of the page to find archives of past and upcoming events across the country and in London. Sign up early as events fill up quickly. We will compare different product classes for capital efficiency, focusing on beta weighting and buying power reduction.",
  "note is that with the advancement of technology, trading in 2024 is focused on available capital and buying power reduction. Modern platforms handle regulatory compliance and margining systems seamlessly, allowing traders to focus on making informed decisions.",
  "If you have a regular margin account, everything we're discussing today applies. Some may have a portfolio margin, reducing by a third. If trading futures or futures options, use about a third less capital. I recommend using everything when trading equities or equity options.",
  "I recommend trading equities, equity options, and futures. If your brokerage firm doesn't support these options, consider switching to one that does. You should have access to the best product choices and buying power reduction.",
  "We will discuss the importance of a capital-efficient strategy in active trading to reduce risk. This includes managing size early and diversifying as much as possible. Additionally, we will cover the impact of static and dynamic hedging in trading. Static hedging involves using stock or futures against an option position.",
  "Dynamic hedging involves using options against an option position, while static hedging involves using stock or Futures. Using Futures provides six times more leverage than using stock, but also requires adjustments and higher buying power.",
  "Futures may require less capital than stocks, but stocks can be a better hedge. When adjusting options, consider dynamic hedging to avoid additional capital. The key is to make decisions quickly.",
  "The key to successful trading is speed. You need to make quick decisions without overthinking. Anticipate your next move before looking at quotes. Think ahead to adjust bad positions and capitalize on good ones.",
  "Trading in a bad position is difficult. It's important to adjust the position efficiently to improve chances of turning it around and becoming profitable. Focus on capital efficiency and the law of large numbers to maximize results.",
  "The outcome of trading is unpredictable. To be successful, you must consistently apply the law of large numbers. Doing something once or twice is random, but with repetition and consistency, you increase your chances of success.",
  "When trading, the law of large numbers dictates that probabilities will play out regardless of personal desires. It may be unfamiliar to some, but we will cover it in detail during the live show.",
  "The importance of leverage and derivatives in a modern portfolio is to provide the ability for an outsized return using less capital. This is crucial for active management to potentially increase returns.",
  "To make a profit, aim for a return that is higher than the risk-free rate. Manage an active portfolio with the goal of earning two to six times the risk-free rate. Some may be satisfied with a 2x return, while others may aim for 3x or more.",
  "trading at 2x, 3x, or 6x leverage. On the right side of the page, we provided a theoretical example for a stock trading at $100. Buying 100 shares at $100 each would require $10,000 in capital without margin. You can borrow up to 50% of the capital.",
  "Consider a long call on a $1 stock with 30 days expiration and a 50 Delta. Cost is $360 with a 35% probability of profit. Cap reduction is 96%. Alternatively, a 30-day expiration 50 Delta short put increases probability of profit from 35% to 65%.",
  "I've increased my probability of profit from 35% to 65%. My buying power is now $2,300, which is 75% less than the stock. My cap reduction is 77%. The long call has limited risk, while the short put has unlimited risk below the credit received.",
  "has a basis of $100, if I can sell a call option against it for $10, my basis is now reduced to $90. This allows me to potentially profit from the trade while also reducing my risk. Active trading is all about constantly improving your basis to maximize profits and minimize losses.",
  "Reduction means lowering the cost basis of an iPhone from $1,000 to $800. This involves a trade-off between probability of profit and potentially lower profits. For example, starting with a $100 stock.",
  "Here's a $100 stock with a capital requirement of $10,000. If it rallies to $105, you make $500, a 5% return. Buying a long call for $363, you make $137 in 30 days, a 38% return. Selling a short put with less buying power, you make $322, a 14% return.",
  "Short puts can generate almost three times the profit of long calls and nearly as much as owning the stock. The focus should be on reducing basis, as short puts have a 65% probability of profit compared to 50% for long stock. The 105 number is based on the expected move.",
  "The 105 number is from the expected move, which is crucial for portfolio construction. Improving your probability of profit can be done by rolling or reentering positions. Delta and pop can be interchangeable in some cases.",
  "\"Pop and delta are generally interchangeable, but can create different situations. Focus on raising your total portfolio probability of profit. Avoid a 50/50 probability of profit, aim for a higher probability across your entire portfolio.\"",
  "The probability of profit is higher when the Delta is lower, around 65-72%. Selling options with a 22 Delta will increase the probability of profit but result in lower returns.",
  "generating a high chance of profit is important in trading. It's essential to find a balance between maximizing returns and managing risk based on your buying power. The ideal Delta value for this tradeoff varies, so it's a decision that needs to be carefully considered.",
  "The slide provides context for making trading decisions. I aim to provide valuable information without wasting your time or resources. Let's dissect and discuss the content further in future sessions.",
  "Total capital use is a percentage of account value, which is crucial for individual investors to understand. Sensible capital allocations based on different volatility levels can help prevent traders from blowing out their accounts.",
  "One major cause of bad trading is improper capital allocation. While you may be able to overlook other mistakes such as bad diversification or using too many of the same strategies, allocating capital incorrectly can have a significant impact on your trading performance.",
  "When trading, it's important to focus on optimizing your mechanics and avoiding wrong sizing. Utilize different product strategies and correlations to assist with capital allocation. Account size and investment objectives play a significant role in determining your trading approach.",
  "This is an old slide showing the conservative, moderate, and aggressive cases for portfolio buying power based on VIX levels. In the most conservative case, buying power is 25% of net worth when VIX is between 10 and 15. In the moderate case, it's 35%, and in the aggressive case, it's 45-50%. The actual amount varies based on the total portfolio size.",
  "In the most conservative case, with VIX at 40 or higher, allocate 50% of a $50,000 account. In a moderate case, allocate 65%, and in an aggressive case, allocate 75-80%. VIX is typically between 15-30 for 30% of the time, with potential allocations of 32-47-60 in those ranges. Adjust capital allocation based on VIX levels.",
  "Allocate based on the VIX level. Start with a small trade size to avoid trading too big. Set your default size on your platform to the smallest number that works for you. Adjust upwards as needed.",
  "Contracts are set to one and then adjusted upwards for percentage allocation on a per trade and per underlying basis. The goal is to trade with fewer units to maximize credit without necessarily increasing risk. This approach prioritizes fewer units over less risk.",
  "When defining risk in trading, consider allocating 3-5% for defined risk trades and less than 1% for undefined risk trades on a big account. For small accounts, allocate up to 15% but never more than 10-15% in a single trade.",
  "We aim for 10-15% in a single underlying with undefined risk, and no more than 0.5-3% on a small account with defined risk. Be cautious with position size to avoid overexposure. It's better to take on more risk with fewer units than vice versa.",
  "Trading involves navigating nuances and understanding the differences between listed options and Futures options. Futures options offer more leverage, flexibility, and optionality, making them cost-effective. Capital requirements for Futures options may change over time.",
  "Requirements for trading Futures options differ from listed options. Adjusting for Futures and Futures options may require a smaller allocation, ranging from 0.5% to 3% for defined risk and 1% to 7% for undefined risk, with a maximum of 15%. Keep allocations and contract sizes small to manage risk effectively.",
  "Keep your contract size small to reduce risk. Manage early and stay small to effectively allocate your capital. Using stop orders may not be as effective as keeping your contract size small.",
  "Allocating too much capital to a trade is risky. It's better to keep your position size small and manage risk effectively. Using buying power as a measure of risk is a useful tool. It helps in quickly assessing and managing risk in trades.",
  "If you experience a buying power reduction on a trade, it indicates the brokerage firm is using it as a risk measurement tool. Buying power reduction is an effective way to manage risk and compare positions on an individual basis. It is a cheat sheet method that works well for managing risk effectively.",
  "Buying power reduction is an effective tool for measuring risk and comparing different products. Having small, diversified positions is beneficial for traders. Short put or call buying power is important in this context.",
  "Put or call buying power is calculated using a formula. For short calls or puts, it is typically around 20% of the strike price. On the futures side, it is usually around a quarter of that amount.",
  "It's important to consider the probability of profit for your portfolio when trading. Some platforms may show this information, while others may not. It's a reliable indicator to help you assess your positions.",
  "The success of your portfolio depends on the law of large numbers. Consistent actions lead to consistent results. Aim for a probability of profit between 65-72%.",
  "To accurately predict your portfolio's performance, you need a large number of occurrences or trades. This is important for active traders who are constantly monitoring the market.",
  "As trading enthusiasts, I recommend a minimum of two trades per day, totaling around 500-600 trades per year. The average could range from 1,000 to 1,500 trades annually, but could easily reach 5,000 to 10,000 if desired. Aim for at least 500-600 trades on 250 trading days.",
  "On average, a Tasty Trader makes about 1,200 trades a year. It may not always be two opening trades, as adjustments and closing trades are also common. The numbers tend to smooth out over time.",
  "You can see how the numbers smooth out towards the expectation with 10 trades. Your win rate looks good at 70%, standard deviation is low, and P&L per trade is high. Overall, it worked out well in this random case.",
  "In trading, the more trades you make, the lower your standard deviation and the higher your win rate. Repetition helps remove outliers and creates a more consistent trading strategy. To be successful, traders must learn to scale and make their processes repeatable.",
  "To make things repeatable, you need to do them consistently. I apologize for going a few minutes over, but bear with me as I share valuable information. Thank you for your patience.",
  "Being a couple of minutes late, this is my first time packing a lot of information into this session. Building a directional case is about opportunity in the market. There are various ways to analyze market direction, including non-directional or delta neutral plays.",
  "Delta neutrality is considered a directional play. Price capitulation is subjective and not measurable. It is a contrarian play used when assuming the market has topped or bottomed out. Volatility may impact this strategy.",
  "predict potential movements in the market, not the direction. Volatility can indicate future contraction or expansion, but not predict price movements. Option pricing skew can help assess market sentiment and potential shifts, but it does not determine market direction.",
  "Market Direction pricing skew is used to show where the market perceives the velocity of risk. Beta weighted Deltas are as accurate as any measure in the largest Marketplace.",
  "liquidity and correlation impact beta weighted accuracy. The more liquid the underlying asset, the more efficient the markets and the better the numbers. Correlation also plays a role in accuracy, as more liquid underlyings lead to more accurate results.",
  "When hedging beta weighted Deltas, consider using indexes, individual stocks, or Futures. The choice between Futures, indexes, or individual stocks for hedging is up to personal preference. For example, when trading crude oil options, consider using other crude oil options for hedging. Similarly, when trading Nvidia, consider using Nvidia options for hedging.",
  "I use Nvidia options to hedge my position. For example, if I am long the Japanese Yen, I sell a Japanese Yen call to hedge. If I find myself short 2,000 deltas on SPY options, I will use S&P futures to reduce my risk by 1,000 deltas. I am indifferent to using either S&P futures or SPY options for this purpose.",
  "I will sell if I'm long a thousand or buy if I'm short 2,000 Deltas. I may buy two S&P futures, 1,000 shares of stock, or use at the money spy calls. I use Dynamic Hedges with individual underlying assets, sometimes using Futures or indexes.",
  "individuals have various choices available when it comes to trading, including factors like Delta and Theta. Delta represents the change in an option's price with a $1 increase in the underlying price, while Theta reflects the sensitivity of an option's price to changes in time speed.",
  "What contributes more to your P&L, Delta or Theta? Delta is more important if you're directional, while Theta is crucial if you're delta neutral. It's essential to be cautious with portfolio Theta and avoid being too large.",
  "When trading, it's important to stay small to avoid potential failures. A reasonable guideline for portfolio Theta is typically 1/10th to 3/10 of a percent based on your net lick. The same guideline applies for daily Theta. All discussions today are based on net lick, including buying power reduction. It is possible to manage Delta risk based on notional equivalent.",
  "equivalent. It is possible but not efficient. Manage Delta risk against net lick or Theta numbers, notional equivalency is complicated. Measure risk through beta weighting. No such thing as a product expert anymore.",
  "Experts in the industry can discuss various macro factors and provide second derivative Greeks, but ultimately, traders are involved in all markets as they are efficient auction marketplaces and the frontier of capitalism. Trust in theoretical pricing is essential.",
  "Trust in theoretical pricing and efficient markets is crucial for successful trading. Strategy diversification is just as important as product diversification. Liquidity is key for product indifference. Account type and size also play a role, requiring a margin account for trading.",
  "It is possible to trade in an IRA account, although it may be more challenging than in a cash account. You cannot pay someone else to trade for you. Account size does play a role in trading flexibility, with larger accounts offering more options. Different individuals have varying amounts of money to invest, and this is respected.",
  "Your current life stage will influence your trading decisions."
]