[
  "We asked the research team to analyze streaks in Zero TT trades. The efficient market hypothesis suggests that recent market information is already reflected in current prices. Despite this, we noticed a trend of following losing short premium positions with long premium positions.",
  "conducted a study on 20 months of zero DT SPX option data. We looked at short premium positions compared to long premium positions to improve performance. We focused on 20 Delta strangles, closing winners at 25% of the initial price and leaving losers alone.",
  "25% of the initial price. We examine results from four approaches: always selling strangles, always buying strangles, following a winning short strangle with another one, and following a losing short with a long strangle. This is called \"flipping the cards\" or \"what worked yesterday.\" The opposite is being contrarian.",
  "The opposite is reversing, being contrarian. Expect big swings. Let's review what we're looking at. Beth, go back. Beth showed us the cup the ball was under. Always selling strangles, always buying strangles. Following short strangles.",
  "Yesterday, we discussed following winning short strangles with another one or following losing short strangles with a long strangle. You can also reverse this strategy by following winnings with a long strangle and losses with a short strangle. Remember to exit all trades without wings to maximize profits. Let's move on to the next slide.",
  "Short strangles had a 93% win rate compared to 66% for long strangles. This is because profits were taken at 25%.",
  "25% intraday, these are zero DTS. No flipping cards, just closing at 25%. What worked yesterday came out at 90%.",
  "If you manage 25%, it almost doesn't matter what strategy you use - short strangles, long strangles, flipping over, or doing the opposite of what worked yesterday.",
  "trades are successful and how often consecutive losses occur. Trading more frequently with a focus on high probability trades can lead to consistent wins. Let's analyze the success rate of our short and long trades.",
  "We will analyze the frequency of consecutive winning days for short and long positions with managed winners. We will also examine how often losers follow losers and winners follow winners to identify streaks in trading patterns.",
  "We will be analyzing short strangles over consecutive days. The slide shows frequency on the left and consecutive winners on the bottom.",
  "Consistent winners in consecutive short strangles show impressive results. Short strangles involve more risk but offer significant rewards.",
  "Next slide: Long strangles are different but still positive. Frequency and consecutive winners show that managing early is key. Regardless of strategy, managing early keeps you in the fight. Next slide: Data for nearly the past two years.",
  "Short strangles have been profitable for retail traders, with nearly 50% of two-week periods resulting in 10 out of 10 winning trades. Trading at market opening has shown success in zero DT strangles.",
  "For short strangles, nearly 50% of the two-week periods were 10 out of 10 winners. Long strangles, on the other hand, rarely went a week without a loss but had gentler losses as measured by siar.",
  "Measured by SIAR, profits were close regardless of which side you took. The key is to capture profits rapidly, as holding positions too long can lead to losses. It's important to recognize when a trade is failing and be prepared to reverse or close positions quickly."
]