[
  "Today, we will study the likelihood of a reversal from open to close in the market. We will analyze the probability of closing opposite to how we opened using conditional probabilities.",
  "open up and close down, or open down and close up. This analysis helps us understand the likelihood of certain trading patterns based on historical data.",
  "In analyzing 20 years of data, we found that the probability of SPY closing up after opening up is approximately 70%. Additionally, the chance of SPY closing down after opening up is derived from the conditional probability table.",
  "Today we are discussing the probabilities of the market closing up or down based on the opening price. The chances are as follows: 35% of closing down if we open higher, 58% of closing down if we open lower, 42% of closing up if we open lower, and 67% of closing up if we open higher.",
  "I apologize for missing that. We have been in a bull market for five years. The statistics show a positive drift over time.",
  "If you focus on the statistics, there is a 7% edge in being long when the market opens down. Conversely, there is a 9% edge in being long when the market opens up. So, I am short because I see a potential opportunity.",
  "I am shorting because I like a challenge. I am buying back Nasdaq futures. The chance of closing up is higher than closing down due to positive drift. These are the conditional probabilities of a reversal situation.",
  "In a reversal situation, there is a 35% chance of closing down after opening up, and a 42% chance of closing up after opening down. Based on the figures from the last slide, it is roughly 60-66% more likely to not have a reversal on a down opening, and 91% more likely to not reverse on an up opening than to reverse on each respective opening direction. These statistics can help explain trading outcomes.",
  "Bad trades are often a result of not paying attention. By opening in a certain direction from yesterday's close, there is a higher chance of closing in the same direction due to positive drift.",
  "Positive drift, as Tony mentioned, indicates a higher chance of closing higher than lower on any given day. In a bull market, this trend is even more pronounced. In a bear market, the likelihood of prices ticking up is rare."
]