[
  "The back testing feature is now live for Tasty account holders on the web-based platform at my.tastytrade.com. Simply click on the back testing button on the left side panel to access the beta version. This feature allows you to back test option strategies without any risk.",
  "Option strategies allow you to test performance over a specific period for a chosen ticker symbol. Customize entry and exit parameters on the first page by selecting your ticker symbol. More selections are being added regularly.",
  "suggest using the selection of options data available for customization on the calendar. Let's replicate a trade on SPY with the date set to January 1st, 2023.",
  "Can I do my own trade on January 1? You can select a strategy like a debit spread or iron condor, or build your own. I kept it simple with a short put in SPY, but you can customize it with up to four legs and change buy/sell options.",
  "You can customize your trades by buying or selling, such as selling a put spread to buy a call spread. I made adjustments to a short put in SPY by changing the Delta from 30 to 50 at the money. I disabled the exact DTE because SPY has weekly options.",
  "DTE is important because SPY has weekly options. I want to keep trades running smoothly. I limit the number of active trades to one at a time to manage parameters effectively. This ensures only one contract is open at a time.",
  "Only have one trade open at a time. Close at 50% profit. Trade a 50 Delta put closest to 45 days. Roll at expiration if still open. Close and open a new one if it reaches 50% profit.",
  "Close and open a new trade with adjusted quantity, Delta, and expiration. Use Delta instead of strike for simplicity, as strike prices vary significantly over time and price levels.",
  "When using Delta, it accounts for differences in relative value and ensures you don't miss specific strikes. The 50 Delta is essentially at the money regardless of the stock price. This makes it easy and quick to get results.",
  "The orange line represents your back test results with all parameters entered, while the gray line shows the performance of simply buying and holding SPY. The profits are not correlated, as the price of SPY fluctuates.",
  "Spy is currently at 567, resulting in a profit of 8 Grand. Short put in spy performs well, even in a bullish market. The biggest drawdown was likely during the August cycle when spy was dipping.",
  "The stock was aggressively dipping but made a comeback. The summary tab shows trade metrics like total profit, average profit or loss, max drawdown, and return on capital. The details tab provides more trade information.",
  "On the next tab, you can view detailed trade-by-trade P&L metrics, including the biggest losers and winners. The right-hand side shows the August meltdown and quick recovery. The last tab, logs, allows for a granular analysis of every line item by trades, orders, or transactions, which can be downloaded for further review.",
  "Orders transactions can be downloaded for analysis on Tastytrade's website, my.tastytrade.com. This feature allows users to analyze data independently.",
  "I will be writing a piece on this trade. For more information, refer to the help center article on the Tast Trade website. Stay tuned for the embedded video in the article."
]