[
  "Separating reality from fear is crucial in trading. Selling premium and high implied volatility can be advantageous as volatility tends to contract. Volatility is mean-reverting, so when it rises, it will eventually come back down. While it can stay high for extended periods, it typically lasts for five to six days.",
  "How serious is the risk of implied volatility expansion when selling low volatility? Volatility tends to increase quickly and decrease slowly. What is your assessment of the risk of volatility exploding?",
  "Volatility is a risk in trading. Let's move on to the next slide for more information on the Spy and Tesla. Tesla is consistently one of the most actively traded stocks.",
  "Nvidia and Tesla are currently the most actively traded options. We are focusing on selling 16 Delta triangle 45 days to expiration, managing in 21 days. The VIX range is currently below 15.",
  "When the trading range is below 15, between 15 and 30 (current range), and above 30, it is important to note that being above 30 is rare, occurring around 7% of the time. The range is typically between 15 and 30 about 40 to 50% of the time, with the remaining balance below 15.",
  "The balance was below 50 in the last calendar year, only three or four times. Change \"b o l w\" to \"E\" for accuracy. The price of the Spy 16 Delta strangle will be higher when implied volatility is higher, resulting in a loss for the seller.",
  "When volatility increases, premium sellers lose money. If implied volatility is 15%, you collect $335. At 25%, you collect $505. At 35%, you collect $735. Selling 16 Delta strangles when volatility is cheap results in less profit compared to when volatility is higher.",
  "The key takeaway is that a negative return on investment occurs when volatility is low. IV rank helps determine when to enter positions, as higher implied volatility is preferred. IV rank provides context for individual stocks.",
  "To provide context, higher implied volatility leads to better buying power and probability of profit. Average P&L and ROI are also higher with increased volatility. When analyzing volatility expansion risk, we look at the frequency and magnitude of expansions by comparing the VIX on day 1 and day 45.",
  "45-day period since 2017, showing low implied volatility for SPY. 75% of periods saw VIX change of less than 3.7 points, indicating rare significant changes. Timing the market is emphasized as unreliable.",
  "Timing a VIX expansion is difficult. It is risky to hold long VIX positions when the VIX is below 15, and less risky when it is above 30. Timing the VIX accurately is unpredictable.",
  "Upside in the VIX occurs when it is above 30. Timing this can be challenging, but there is less risk long-term when the VIX is above 30 as it tends to contract. When the VIX is between 15 and 30, it also contracts. However, when the VIX is below 15, it expands. For individual stocks like Tesla, when implied volatility is low, 75% of 45-day periods saw the VIX exchange less than 3.8 points.",
  "VIX exchange of less than 3.8 points is very similar to the SPY, with only a tenth of a point difference. Significant changes by the end of these periods are relatively rare. Betting on implied volatility going higher in Tesla only happens from very low levels of implied volatility, not when the VIX is above 30. It's interesting to see how close the VIX and the SPY are when looking at this data.",
  "Let's move on to the next slide. The main factors that drive profit and loss of a short premium trade are Delta and Theta. Profit often comes from time decay (Theta) and price movement (Delta) more than volatility. Selling premium in low implied volatility is a common strategy.",
  "Selling premium in low implied volatility can be profitable, but it's important to mitigate IV expansion. When IV is low, reduce the number of contracts and maintain a short Delta to offset the risk of volatility expanding, which is more likely in a downward market."
]