[
  "Welcome to Option Trades Today. I'm Tony Batist. Today, the market is down with the S&P down 90 handles and NASDAQ down 445. Here are two trade ideas for you.",
  "The market is down over 2%, with the Russell down 26 points and the Dow down 426 points, representing a 1% decrease. Volatility has increased by 118 points, a 6% move not seen in quite some time. The market reached around 2050 on October 8th and September 6th. Volatility has been increasing over the last couple of days, as discussed in the podcast on Tuesday.",
  "The market was expanding and going higher until two down days yesterday. Today, bonds are down 22 ticks, indicating a possible flight to quality as rates go higher. Typically, people buy bonds to minimize risk in the equity market, but with rates rising, this trend may change.",
  "Rates are currently increasing and there is no indication of a rate cut. Bitcoin is at 73,071 and oil is the main mover to the upside. Volatility is up 1.5% to $696. One trade to consider is Microsoft (MSFT), which is down $24 today post-earnings.",
  "Microsoft is down $24 today after earnings were released, with significant selling off throughout the day. The IVX 5-day change remained unchanged, with an IV rank of 46.",
  "I plan to do a defined risk trade in Microsoft at $416. The volatility is still high post-earnings, so I see an opportunity for a defined risk trade. This is because Microsoft is a $400 stock and would require a lot of buying power otherwise.",
  "I will use defined risk trades to avoid using a lot of buying power. I will choose the 365 puts with a Delta of around 15. The open interest is high, so I will focus on the Delta for a better probability of being in the money. The in the money probability and the Delta are similar, typically around one or two.",
  "I am looking to sell the 365 puts and sell the 455 calls, both with around 13-14 Deltas. This is a straight Delta play with a $44,000 trade for my account. I want to define the risk.",
  "I'm defining the risk by widening the trade to $15 wide, using the 340 put and the 470 call. I placed the order at 296, slightly under mid price. This changes the buying power to $2,200.",
  "Changing your buying power to $2,200 gives you two long deals instead of being completely delta neutral. The short strikes are the same. The dotted line represents the standard deviation to the upside. The green line shows our break even, which we are outside of to the downside. There are 50 days to expiration, with a preference for closer to 45 days.",
  "I prefer trading monthly options with around 45 days until expiration. Weekly options are not of interest to me. With 15 days left until November, the trade has $6 per day in Theta Decay for the $2,200 at risk. It has a 76% probability of profit, which meets my criteria of over 65%. This trade benefits from the stock staying within its expected range.",
  "Stay within the expected range, which is just under $30 in this elevated IV and Ivy rank. Break evens are under 265 and over 455, with 455 near the highs and 365 near January levels. This is a post-earnings trade with high implied volatility.",
  "High implied volatility is driving my iron condor trade on SPX. Volatility is expanding in the overall market, including SPX. I am taking a risk on day one of this trend.",
  "advantage of this high volatility by adjusting my broken wing butterfly strategy. The market has returned to levels from about a month ago. I will be skewing my strategy to capitalize on the bid wings and increased volatility.",
  "I plan to widen my SPX trade compared to my usual approach. I typically prefer monthly options around 45 days out, and in this case, I will choose December options with around 49 days until expiration. The liquidity in SPX allows flexibility in choosing the desired month for trading.",
  "I will be demonstrating a broker wing butterfly strategy by buying one spread and selling another spread twice as wide. I will be targeting around the 15 Delta and will be looking at the 5300 puts with a 17 Delta.",
  "I'm buying the 5300 puts and selling one of the 5250 puts to create a broken wing butterfly spread. This strategy involves buying one spread and selling another spread. I have already placed the order to buy the 5300 puts.",
  "I am buying the 5300 puts and selling the 5200 puts. Next, I will sell the 5250 puts once to create a ratio spread. I am increasing the width to $100 and taking on more risk by buying the 5150 puts. These spreads typically trade around $3.15 to $3.00.",
  "I'm going to take a bit more risk here and go long on this slightly bullish spread. The buying power is $46,700 with a potential profit of $5,350. The spread is cash settled, so no stock is involved. If the stock closes under $52.50, there is no need to come up with money at expiration.",
  "If the market closes under 5250 or at 5250, there is no need to worry about exercise or assignment. The spread you are long would be worth $5,000 plus the $35 premium received. To take on more risk, consider moving the 5150 put down to 5100 to increase the credit received to around $310 or $35.",
  "I received $310, increasing by $35 to $620. This trade has an 89% chance of success with $8 Theta Decay. Buying power increases to $9,300. This is a large trade, so watch your size if $10,000 is too much buying power for you.",
  "If the buying power is too high, consider using the 5150 put. If you're bullish, consider this spread. Full disclosure, you can potentially get a better deal on the follow page.",
  "I will share my recent SPX trades with you to show how quickly this spread moves. I executed this trade at 9:33 when SPX was trading at 5738 with an IV rank of 34. You can review my past month or last 30 trades to see my performance.",
  "Trade at 5738 with an Ivy rank of 34. The Ivy rank has expanded, indicating a wider spread. Filled at 590 and 605 despite SPX moving only $2, the spread moved by 15 due to volatility expansion. Consider waiting for volatility to decrease before entering the trade. 91% probability when the trade was initiated.",
  "The probability of profit has changed to 89%, with the price at 650. I have placed a sell order at 645. If filled, I will post an update. I traded half my usual size. If you are a one-lot trader in SPX, consider a different spread or risk 2 to make 1 trade.",
  "When trading, it's important to manage risk by adjusting positions to maintain desired Delta levels. For example, rolling down calls can help reduce Delta exposure. This strategy was recently applied to trades in Apple and Goldman Sachs to maintain short Delta positions.",
  "I adjusted my calls to manage my Deltas in Microsoft. I rolled a spread with little volatility change after earnings. I placed a post-earnings $15 wide iron Condor. You can view these trades on the follow page with a tasty trade account. I also executed two SPX trades with slightly bullish positions.",
  "omnidirectional slightly bullish trade in SPX and TSM. Rolling down the untested side to manage long Deltas in other products. SPX is 10 times the size of SPY, so be cautious.",
  "Transfer your account to Tasty Trade, the number one trading platform."
]