[
  "Your return in 2020 was 160%. What happened suddenly?",
  "Eight or nine years ago, I threw a pop-up dinner in Washington DC after giving a speech at the CIA. You were one of the invitees. Thank you for coming in, I look forward to hearing your story.",
  "I look forward to hearing your story. You mentioned teaching at Georgetown, which reminded me of a previous conversation. You started watching Tasty in 2012, so we have had a 12-year relationship. It feels like we are family in a way.",
  "I have a civil engineering degree from Virginia Tech and a Master's in finance from Georgetown. I am also the proud owner of a number Cherry pin.",
  "You are an engineer, entrepreneur, and educator at Virginia Tech and Georgetown University. Let's discuss your trading results and strategies.",
  "I spend about 3-4 hours watching the markets every day while also managing my trading account.",
  "I have an account to watch trading. I don't trade actively, but it's important for my work. In a graduate course, we learn about finance basics like NPV.",
  "The NPV formula is essential for understanding the time value of money and interest rates. It is important to know where interest rates come from and who determines them. Many students lack context in the bond market and are unfamiliar with spreads.",
  "Spreads are set by the bank based on interest rates. It's important to understand where rates are headed. Trading the markets can be beneficial for students.",
  "Trading back then, I wish professors would trade and inform students about it. In a class, a student mentioned Tasty Trade and Tasty Live, showing interest in options trading.",
  "key aspects of trading in real estate is understanding the context and environment in which you are operating. Master's classes focus on providing this perspective to help navigate the challenges that may arise.",
  "Selling a building now is possible due to the liquidity in trading markets. Real estate, while appealing, may lack liquidity, making transactions difficult. Having the best building is irrelevant if you cannot transact.",
  "You are dependent on unlisted financial markets. Regardless of market conditions, there is always a bid and an offer somewhere. Liquidity is a foreign concept to many when considering trading.",
  "When considering risk, it is important to provide context in teaching. Trading has played a similar role in entrepreneurial ventures and engineering. Trading has taught the ability to make quick decisions.",
  "Making quick decisions based on the information and risk involved is a daily part of owning and running a business. Some people struggle with decision paralysis, but it is essential to assess risk and make instant decisions in trading.",
  "In business, it's important to make decisions rather than not making any at all. Just pick a direction and figure it out later. You'll likely be right most of the time.",
  "I started trading when I opened my first account with TastyWorks. Before that, I had a stock brokerage account with Fidelity when I turned 18. I have never been a day trader.",
  "I didn't day trade or speculate with options at that time. I only bought stocks when trading commissions were $10 per trade. My dad, who was in finance, introduced me to trading. He has since retired.",
  "I used to work in higher education finance as an administrator. My dad, who was also in finance, didn't believe in stocks, so it was challenging for me to transition into trading. My first venture into trading was a learning experience.",
  "Your first venture into trading was traditional passive investing in mutual funds. You set it and forget it, hoping for long-term growth.",
  "I am not bothered by sleeping at night with a passive account from a risk perspective. I worry about what will happen in 20 years.",
  "I started watching Tastytrade in 2012 and began paper trading options. My first introduction to options was during my academic program.",
  "I learned how to draw option payoff diagrams by hand and understand how to quantify and hedge risk. It clicked that I could compartmentalize and manage risk effectively.",
  "I first heard about Tasty Trade through a friend while on a golf course. I started watching the live show with you and Tony and eventually understood the chaos. It took a few episodes to make sense of it, but now I'm hooked.",
  "I have been paper trading and recently opened a Tasty Trade account to venture into listed options. I had previously been approved for options trading on my Fidelity account after a lengthy process.",
  "I traded options on my Fidelity account with limited permissions. There was some friction during execution.",
  "You may be restricted from certain trading activities without realizing it. Restrictions can be confusing, such as needing an interview to trade your own money. Tasty works launched a trading platform at that time.",
  "I started trading in 2017. I opened an account but didn't do anything for a week or two. It's like getting a new car and not driving it.",
  "When you get a new car, you don't drive it right away. You want to admire it and figure out a plan. With a $2,000 account, you can't have many positions. It teaches you how to deploy capital and size positions with risk in mind.",
  "When sizing a position, consider the risk you are willing to take on. Focus on learning how to win consistently rather than making money right away. Teach and show others how to understand probabilities in finance.",
  "In finance, derivatives are often associated with gambling or high-risk investments. However, they can be practical and not completely theoretical. Warren Buffett once referred to them as \"weapons of mass destruction,\" but this is a misunderstanding. Derivatives can be used for buying or selling positions.",
  "trading with leverage involves taking on risk for the potential of high returns. It is important to understand the risks involved in trading with leverage and to carefully manage your positions to avoid outsized losses.",
  "I've heard your wife tell you that many times. You had various reasons to trade M, not just to make a lot of money. You were focused on learning how to win, rather than turning a small account into millions.",
  "I am teaching myself how to win in the financial markets by gaining knowledge about trading strategies. This will help me in my businesses and risk-taking endeavors. I first met you around the time you opened Tastyworks and saw you trading.",
  "We were trading and I remember you mentioning using some of the material in class. I thought it was great that professors are incorporating new content into the curriculum.",
  "changing the curriculum to reflect current trends and advancements in trading is essential. The first couple of years may feel like treading water, but staying informed and adapting to new strategies is key to progression.",
  "I ended the day down about $100 on my $2,000 trading account. I was focused on managing risk and couldn't afford to take on larger positions. Looking back, I realize that trading Snapchat when it was around $8 per share may have been a more affordable and strategic move.",
  "Making the best decisions and managing positions effectively takes time to learn. Anyone can manage a winner, but it's the losers that present a challenge. The early years of trading teach humility and the importance of second-guessing oneself.",
  "It's humbling when you realize the market doesn't care about your intelligence or education. It will go right through your position.",
  "PhDs will go right through, learning to operate in a big trading environment. It may take a few years of ups and downs to figure out what went wrong in losses.",
  "The market just went against me. Was it too big of a risk or did I have the wrong position? Sometimes stocks win, even with the best position. Probabilities are key.",
  "Probabilities are what they are. You could be playing poker and have two Aces, but still lose the hand. It's like sitting on 21 at a blackjack table and pushing. When did you start turning the corner?",
  "Did you figure out how to manage risk in trading Futures options?",
  "Are you trading single stocks, ETFs, futures, or futures options now? If you've been trading for about three years and still have a small account, consider it a learning experience akin to a graduate degree. While you may not be seeing monetary rewards yet, there are other benefits to be gained.",
  "I think I'm up a couple hundred bucks, maybe $1,000. I've learned a process, similar to a graduate program. You don't remember every detail, but you start to know what position and strategy to use in different environments.",
  "In trading, winning is essential. It doesn't matter the size of the win, what matters is consistently coming out on top. In 2020, my return was 160%, so what changed to make that happen?",
  "In 2020, the pandemic caused sudden changes in the financial market. Despite the uncertainty, I was prepared and experienced in trading. I observed IV spikes across the market, but remained cautious, knowing that market reactions are often exaggerated.",
  "Time in the market is crucial. Three years of trading practice allows you to deploy your tools effectively. In 2020, focus on strategies like wide iron condors to take advantage of market volatility.",
  "There was high volatility in the market, making it uncomfortable to trade undefined. It's important to set guard rails for safety while still allowing for some flexibility to reduce downside risk.",
  "In 2021, the return on defined risk strategies was 82%, down from 160% the previous year. Moving forward, I shifted towards more undefined risk strategies. What percentage of your trades were defined versus undefined?",
  "What percentage were you defined and undefined prior to 2021? I'd say probably 90% defined. What about 2021 transitioning through the pandemic? I probably came into 50/50 and now maybe are in the 60/40, with defined being the bigger part. Is that the primary change in 2021? Yes, that's the primary change, along with accommodating market conditions after the meme stock situation in 2021.",
  "After the meme stock incident in 2021, there was a period of volatility contraction for the rest of the year. In 2022, I lost money due to getting too big in the Futures market.",
  "I believe that learning from losses in the Futures Market is crucial. I once sold on a downtick in a falling market, only to see it rise after I sold. It can be emotionally challenging, but it's all part of trading.",
  "Many traders believe they sold the bottom multiple times, but it's hard to know for sure. It's common for everyone to think they know when the market will turn. However, experiencing a 42% loss in a year can be humbling. It's important to stay humble and learn from mistakes in trading.",
  "I wasn't cocky after being up 250% in the prior two years. The market is humbling with enough losers even when you think you're right. I trade 2-3 times a week by 2022 with limited capital, mostly watching and managing trades carefully.",
  "Do I need to manage this trade or should I wait and see? Do you get discouraged by losing trades in 2022? Absolutely, losing trades can be discouraging. Take a step back and analyze the reasons for the loss. Was it due to having all the wrong positions or having too large positions that went down?",
  "In 2022, there was a significant selloff in the S&P 500, with most losses occurring in March. It's common to question your trading strategies during such downturns.",
  "Given your age and experience, if you had never seen a bear market until 2023, making a 25% comeback for the year is impressive. Has anything changed in 2023? It seems like you perform better when the market rallies. I typically trade market neutral with some positive Delta, usually around plus 10.",
  "In 2023, I focused on sticking to what I know and avoided playing in bigger markets. I also stayed away from some Futures trades. My ratio of defined to undefined risk remained similar throughout the year. I found that getting out of my own way was the easiest thing to do.",
  "In 2024, I have expanded into undefined risk and Futures options trading, primarily focusing on the ES market. This shift has resulted in a 73% increase for the year.",
  "What kind of strategies are you using primarily in Futures options? I primarily use ratio spreads, such as one by twos or two by threes. The ratio spreads are very capital efficient in Futures compared to equities. My goal is to keep the buying power in check, typically around $2,000,000 per position.",
  "Futures are more volatile than equities. What do you focus on in the equity markets? I am indifferent to the product as long as it is liquid. What improvements do you plan to make this year?",
  "One way to improve is to react quicker when putting on a position. Sometimes overthinking the best strategy can lead to missed opportunities. It's important to put on the first position and adjust if needed. Avoid hesitating too much and act decisively.",
  "How aggressively do you manage your losing trades? I hate hesitating because it often leads to regret. I've learned to improve by not waiting for the market to come back. I aim to close trades aggressively to avoid potential losses.",
  "are not my main focus. I prefer to close trades aggressively, especially if I have a winning position that I don't want to risk losing. For example, I recently closed a winning position on Tesla before it reached 50% profit due to potential market volatility. I occasionally trade binary events, but they are not a priority for me.",
  "I occasionally trade binary events, but they often hurt more than help. One of my biggest losers this year was a bond position around a binary event. Despite having defined risk, it still hurts to lose. Thank you, Michael, for a great talk. It's a bonus for Tasty Nation to get to know you.",
  "Thank you for sharing this bonus trading story."
]