[
  "Skew indicates how prepared traders are for a significant downward movement. It is a measure of how many people are buying protection.",
  "The skew closed at 162.78, indicating high out-of-the-money put and call buying.",
  "we are analyzing the skew trade in the current high market volatility. Despite initial assumptions, recent research suggests the skew may actually be lower than expected. Let's dive into the analysis.",
  "Log returns are not normally distributed, with a heavier downside tail indicating negative skewness. The Skew Index, published by CBOE, follows a similar methodology to the VIX but with a higher weighting for out-of-the-money option prices. A high skew suggests a higher probability of large downside moves in the market. Can large skew values anticipate outlier events?",
  "I anticipate outlier events based on skew. When skew is low, we tend to have more outlier events. Using SPX, VIX, and skew data from 2011 to present, we analyzed outlier down moves.",
  "SPX experienced outlier down moves based on the VIX DVE expected move at the 30-day, 7-day, and overnight timeframes. Over 13 years, the mean and median skew values were 130 and 128, lower than the current 162. The skew value preceding these outlier moves serves as a baseline for analysis.",
  "There are a limited number of cases to study, but it is statistically significant. It may be challenging to find enough occurrences due to the rarity of large down moves. The mean and median values are important to consider.",
  "The mean and median values were 130 and 128, currently at 162. This does not rule out a down move, but suggests a higher likelihood of a significant down move due to the high skew. A week ago, the skew was not as high, so the options were not as impacted.",
  "Out of the money options are higher, indicating increased buying of protection. This could suggest that expectations may not materialize.",
  "In the context of trading, we are examining outlier moves over a 30-day period. These moves are two times, two and a half times, and three times the expected move. These occurrences are considered outliers and happen theoretically only 2% of the time for two times the expected move.",
  "The frequency of skew in these cases is around 1.5%. The mean skew is consistently around 130 for two, two and a half, and three times the expected move on a 30-day outlier move projection.",
  "In analyzing the projected moves over seven days, it is noted that the actual move was three times higher than the expected move. This discrepancy stands out as an outlier compared to the other data points.",
  "The skew is currently at 128, with no instances of a crash occurring at a skew of 162 or higher. The third line shows a discrepancy between the theoretical and actual expected move, with the actual move being 4.4 times higher. This indicates a potential outlier move.",
  "For a big outlier move, you're more likely to see it at three times than at two times. Two times is usually less than theoretical, while three times is greater. Looking at the one-day chart, the skew continues to drop, from 130 on the 30-day to 128 on the 7-day to 126 on the one-day chart.",
  "The SKS are currently at 127 or 126, significantly lower than the current level. Downward moves are typically less frequent than expected, except when they reach three times the expected move. This study highlights that greater than expected moves occur less frequently until reaching outliers like three times the expected move.",
  "Outliers are rare events that occur less than 1% of the time. They have a low skew and are not currently present in the market, allowing for a comeback. The S&P is up 21. Let's move on to the next slide for more takeaways.",
  "Next, we will review the key takeaways. The VIX and normal distribution statistics accurately predicted 2X and 3X expected moves but underestimated the frequency of three times skew values before outlier downside SPX moves. Skew values appeared slightly lower than usual for short-term outlier moves, indicating market participants may not have been fully prepared.",
  "Skew measures market participants' preparedness for outlier down moves. Outliers often occur when least expected, especially when skew is lower. Bad outlier moves happen more frequently than they should, while all other outliers happen less often."
]