[
  "bias. It involves selling a call spread and a put option on the same underlying asset. The key to success with Jade lizards is managing them effectively, especially in a bull market. Failing to do so can result in turning a winning trade into a breakeven or a loss. It's important to monitor the trade closely and make adjustments as needed to protect profits and minimize losses.",
  "For traders with a neutral to slightly bullish directional assumption, a Jade Lizard strategy involves selling a short out-of-the-money put option and a closer in out-of-the-money call spread. The distance between the call strikes should be less than the credit received to avoid upside risk. It is recommended to exit short premium positions well before expiration to manage risk effectively.",
  "Before expiration, early management has had a positive effect for a persistent seller of Jade lizards. A study using 15 years of options data in various stocks showed that selling 45-day lizards at every monthly expiration using a 20 Delta short put and a 40/30 Delta call spread was profitable.",
  "The 40 Del 30 Delta call spread may not cover the width of the spreads. Back testing on Jade lizards requires using Delta. There may be some upside risk, but I like it. I appreciate the coverage of bases in this study, focusing on big liquid products. Next slide, over 15.",
  "Let's move on to the next slide. A study over 15 years compared holding positions through expiration with closing them at 21 days. It's interesting because typically, you may close your Jade lizard when it's nearing your call spread. In backtesting, you can choose to close at a certain day or profit percentage.",
  "When trading, consider closing positions at different profit percentages, such as 50%, 30%, or 20%. Analyze the percentage of winning trades, net average P&L per trade, and conditional value at risk (CVaR) at 21 days to expiration (DTE). This setup helps evaluate outcomes effectively.",
  "Let's quickly analyze the win rates of SPY, IWM, and Triple Q's. SPY has a 79% win rate, IWM has a 68% win rate, and Triple Q's has a 7% win rate. The average P&L for IWM is 2.55. I will now pull up the parameters for SPY to see what it looks like.",
  "This data spans 15 years, including the COVID era. Some strategies took a hit during this time but have since recovered. Closed at 21 DTE.",
  "Closed positions at 21 days to expiration show higher average P&L, with M performing significantly better in IWM and triple Q's. SPY has a slightly higher average P&L. The conditional value at risk for SPY decreased by two-thirds when closing positions at 21 days. All trades have over an 80% win rate.",
  "I usually do not let my trades go until expiration. I manage my Jade Lizards by either closing and reestablishing them elsewhere or managing them without rolling up a put. In these trades, you can roll down the calls if needed due to their wide Delta parameters.",
  "When comparing average P&L, IWM is a good candidate due to its lower price and less buying power used compared to SPY and QQQ. The conditional value at risk isn't significantly higher than SPY. Consider trading in Apple.",
  "Here's a comparison of holding options through expiration for Apple and Google. Apple is losing money while Google is showing significant gains. The win rates for these options are higher than expected, around 70%.",
  "Around the 70th percentile, I would choose IWM for its low capital usage, especially if closing at 21 days. With the recent splits of SAR, Amazon, and Google, they are now around $150 each.",
  "When managing trades, it is important to close them within 21 days to avoid high fees. Expensive products like Amazon can be risky to hold for too long. The main takeaway is to never let trades go past 21 days. This strategy is supported by back testing and the zero DTS method.",
  "21 days, zero DTE, and weekly options are different trading strategies. For example, a jade lizard trade is closed at 21 DTE. It's important to differentiate between these strategies when discussing trading approaches.",
  "Weekly options typically show the best results when closed at 21 days to expiration. This strategy works well with products like Jade lizards and other larger options. Consider combining Jade lizards with stock positions for added benefits.",
  "premium and take advantage of directional bias. The Jade lizard strategy offers downside protection with no risk to the upside. It involves selling a call spread and a put option to benefit from a potential market move. Consider this strategy for profitable trading opportunities.",
  "Trading Jade lizards on neutral to slightly bullish assumptions in ETFs and equities can be profitable. Traders saw improvements in trade metrics by closing at 21 days. Holding out through expiration resulted in more money but fewer winners. Identifying good candidates to sell premium is key.",
  "When considering a good candidate to sell premium, a jade lizard option strategy may be a suitable choice. It is important to remember to manage early, as this can lead to better results. From my experience, managing at 21 yields better outcomes than waiting until 50%. It is crucial to stick to the plan and not deviate from managing early for optimal results in the long run.",
  "believe that managing at 21 days is crucial for maximizing profits in trading. It's important to prioritize making more on the put than losing on the call spread in a jade lizard strategy. The 21-day mark is more significant than aiming for 50% profit.",
  "Mark is more important than the 50%. I don't think you'll hit 50% before 21 days till expiration. Just keep it simple."
]