[
  "For the past year, I have not had a losing month. I trade naked short, following the same strategy on each trade without having to think much. This approach has been successful for me.",
  "Jim, a trading expert with 44 years of experience, joins us today. He is also a physics professor at Boston University since 1988. Welcome, Jim.",
  "I have been in the trading industry since 1988, starting as a 10-year professor in physics. I have a background in finance and statistics, promoting a more quantitative and probabilistic approach to trading.",
  "I have been a trader for over 10 years. We both experienced the 1987 crash and have learned a lot about markets and trading since then. Our methodologies have evolved over time.",
  "As a physics professor at a research institution, I work at the Large Hadron Collider colliding protons to study the smallest distance scales ever probed. We discovered the Higgs Boson, which is the origin of mass in the universe.",
  "I am currently working on the Dark Energy Spectroscopic Instrument, measuring 50 million galaxies to create a 3D map of the universe and understand its expansion. This research is very exciting and will help us understand the equation of state of the universe.",
  "I find quantum computing fascinating but I'm not ready to discuss it yet. How much time do you have for trading? I try to streamline my research and focus on trading full-time.",
  "I focus on energy trading to maintain a disciplined approach. Energy markets are always volatile, making them ideal for an options trader.",
  "As an option trader, let's go back in time and discuss your experience over the last four decades. What have you been doing as a trader and investor during this time? Share any notable stories or strategies you have used.",
  "I used to regularly sell puts with a friend, and it was successful until it wasn't. I learned that selling puts with low deltas is riskier than with high deltas. Size matters in trading.",
  "Size in trading ultimately comes down to the number of units traded. Every trader learns the lesson of understanding the scale of $70,000 in futures contracts. It is important to grasp the concept of how big or small a position really is, and overcoming the challenge of navigating market fluctuations.",
  "You have been trading derivatives for almost four decades. The complexity of derivative models is relatively simple.",
  "I used to struggle with finding options information in the past by buying the Wall Street Journal. It was difficult to access timely data. However, technology advancements in the early 2000s, including platforms like Tasty, have made trading options much easier and more efficient.",
  "Tasty offers cool, easy-to-use technology for trading. It provides all the data you need at your fingertips, allowing you to trade Futures and Futures options successfully.",
  "I mainly focus on equities and options on equities. I started by investing in stocks of companies I was familiar with, like computer companies. I later discovered the benefits of options trading, such as selling calls on stocks I own.",
  "You can boost your return by selling a call on a stock. I primarily trade options on Futures, with some conservative investments in my retirement account.",
  "When trading options on futures, it is important to flatten out from an assignment or settlement. If a position is in the money and needs to be rolled at the last minute, there may be a spread to avoid paying. In this case, letting the option expire and then zeroing out the position by buying or selling the contract is a common strategy.",
  "buying or selling contracts. The challenge of being successful in trading is important to you because of your passion for competition and motivation to succeed. Over the last two years, you have honed your strategy to focus on this goal.",
  "Focus on trading strangles in crude oil, one of the top three most active Futures options contracts. Keep an eye on 10-year notes in ZN and ZB, as well as gold, but crude oil usually takes the lead in trading volume.",
  "Crude oil is subject to numerous world events that can create volatility, providing trading opportunities for traders.",
  "Crude oil has been trading in a narrow range for the past few years, fluctuating between the high 60s and low 90s since the crash in 2020.",
  "Crude oil has been range-bound in the 60s to low 90s for almost three years. Liquidity and volatility play a significant role in trading. Gas pump prices react quickly, impacting trading positions.",
  "You are trading CL mostly options, focusing on Monday, Wednesday, and Friday short-term options. The demand for oil seems constant, making it a reliable trading choice.",
  "I can only trade a product once a month because there aren't enough trades in a year. I need to trade every week to reach 150 trades a year. With three trades per week for 50 weeks, I can reach 150 trades. Futures have daily expirations, while index options have a daily expiration.",
  "Index options have daily expiration, while other options like crude oil may have Monday, Wednesday, or Friday expiration dates. Futures options settle into the future and expire at 2:30 PM EST. The platform may not reflect this until the next day around 5:00 AM.",
  "At 5:00 AM, knowing what happened at 2:30 is crucial for understanding your position. The time difference between Eastern and Central time can affect trading nuances. It's important to be aware of futures expiring that day and how prices may vary in subsequent months.",
  "Crude oil is usually in contango, but occasionally goes into backwardation where prices decrease. Currently, it seems to be in backwardation. Volume is good on Monday, Wednesday, and Friday.",
  "When setting positions on Sunday night at 6:00 when the market opens, I sometimes find the spread on options to be wide. In those cases, I prefer to wait until the next morning to trade. I have not experienced any difficulties with fills when rolling positions.",
  "I roll trades if I'm in the money and patient with it. If I don't get the trade, I let it expire in the money and correct it with a future purchase. Jim has been trading a $50,000 account for over a year without a losing month.",
  "The previous year had a positive NP. The rising star segment is based on the last 12 months, which is statistically significant with 150 expirations on Monday, Wednesday, and Friday.",
  "trading strategy involves naked short strangles. I adjust the strangle by skewing it towards the lower portion of the range to have a little negative Delta. I start with a specific Delta when setting up my trades.",
  "When setting up my trading routine, I choose a strike price that is $1 away from the current price per day to expiration. I adjust for half days or quarter days by interpolating the strike prices accordingly. For example, if trading on a Sunday night for Monday expiration at 2:30, I select the appropriate strikes.",
  "Monday expiration at 2:30, I'll choose strikes plus and minus a dollar. This allows me to let volatility determine the Delta for me. If volatility is low, the Delta is small; if volatility is high, the Delta is big. For Monday afternoon expirations on Wednesday, go two strikes wide. For Tuesday expirations on Wednesday, go one strike wide.",
  "If you go one strike out of the money on Wednesday for a weekly expiration, it could bring in around $200 per one lot, totaling $600 for both sides.",
  "Both sides together equals $600 a week, totaling $30,000 a year. It may be asymmetric, with one side at a quarter and the other at 75 cents. Regardless, focus on a dollar on each side. The strike price and premium may align around a dollar.",
  "There are two main factors to consider when trading options: the stock price (STK price) and the premium. These are the standard, most actively traded options, not micro options. The maximum time frame for trading these options is typically two days.",
  "The maximum you can make in two days is $30,000. If you make $2 per trade on Monday, Wednesday, and Friday, that adds up to $30,000 per week. However, not every trade will be profitable.",
  "I made about $188,000 on trades this year, which is roughly a 40% return on my net capital. I typically use $5,000 to $7,000 per trade on a one-lot basis.",
  "I am considering increasing my trading volume from one lot to two lots. My win percentage is higher than usual for this type of trade. My worst loss in the last year was a few hundred dollars, never thousands. If there is an outlier, I would reassess my strategy.",
  "If there is an outlier, I would continue rolling for credit. For example, if oil prices increase significantly, I would roll my position to a higher strike price. By consistently rolling my position, I can eventually catch up with the price movement.",
  "you roll your options to protect your position as the market moves. If you roll up your call options, consider rolling up your put options as well. This can result in a net credit, especially if the options were previously in the money.",
  "If the option is in the money, keeping the same strike will be worth more further out in time. You can always roll it for a credit, meaning both the new put and call together must be better than the previous credit.",
  "The new call must be better than the old call that was in the money. Stay disciplined in moving the put to control the trade. Zeros can lead to a significant change in Delta quickly. Be prepared to adjust accordingly.",
  "It's important to consider how things could go wrong in trading. If oil continues to move significantly in one direction, it could pose a risk. The average daily expected move for oil is less than a point, around 60-65 cents.",
  "The price fluctuates between 60 and 65 cents. Looking at the crude oil chart, the steepest part can increase by $10 in 14 days. On average, it is around 70 cents. There have been instances of $2-3 moves in a single day, with the largest being over $3 last year.",
  "Last year, there was a significant price drop in one day, but it eventually recovered. The majority of the time, the price stays within a reasonable range. Is there a profit target to close early, or is it best to let it expire?",
  "If an option is close to expiring and only worth a small amount, it may not be worth closing it to capture that remaining value. Typically, when opening a position, one side will be out of the money. This is often the case due to the time decay and lack of movement in the underlying asset.",
  "On most days, there is minimal movement in oil trading, requiring little action. Only about six days in the past year had significant enough moves to necessitate action. It is worth considering if this trend is consistent historically or a recent occurrence.",
  "oil market opens you're ready to go and you're ready to trade. It's important to stay cautious and not assume that past behavior will predict future outcomes. Make sure to manage your risk and be prepared to act when the market opens at 1:30.",
  "At 1:30 when the crude oil market closes, you have to flatten out your position. If you're within the Str sure di them done, you have to flatten it out if you're on the wrong side of the money. I usually put on the next trade in the afternoon before it closes at 5:00.",
  "trade based on specific rules and are disciplined in your approach. You reset the trade each time and hope for oil to move in your favor. This allows you to reenter the trade comfortably.",
  "and you'll be comfortable not be caught in that trend. Some friends of mine got me interested in options, starting off by collecting dividends.",
  "Are you collecting dividends? Consider selling some calls. I mentioned following my trades, and he advised checking the position.",
  "is important to regularly monitor and potentially adjust trading positions, especially when they are being tested. In this case, I had to roll my position when the stock went below my strike price. It's crucial to stay proactive in managing trades to minimize risk and maximize potential profits.",
  "I had to close a big Delta position due to an early flight the next morning. I didn't want to risk it while traveling, so I closed it before leaving.",
  "often close and reenter trades to make adjustments for balance. It's a strategy I feel compelled to follow. Are there any other nuances to this approach that you can share?",
  "I analyzed the range and determined the dollar value. I appreciate that it adjusts for volatility automatically. When I look at the crude oil graph, it reminds me of a statement by Charlie Munger.",
  "When the markets hit a high, things aren't as good as people think. When the market hits a low, things aren't as bad as people think either. The oil curve will turn around, but it won't go to $1,000 a barrel or zero.",
  "We have seen some unusual exceptions in crude oil trading. The chart is important for identifying oversold or overbought conditions, but your strategy is not based on technical or fundamental analysis. A $1 move per day is significant.",
  "There is no technical or fundamental analysis involved in my trading strategy. I focus on macro geopolitical factors. I have a rule to not overthink trades and just execute them. Overthinking can lead to hesitation and mistakes.",
  "When trading, it's important to find a tradable asset that is range-bound, liquid, and requires minimal adjustments. Start small and have fun with it. Thank you.",
  "Thank you for being a part of Tasty Live for over a decade. We are always looking for inspiring stories of traders teaching themselves new skills and experiencing success. If you want to share your trading journey with Tasty Nation, email us at risingstars@tasty.com for a chance to inspire others.",
  "Share your trading journey to inspire others."
]