[
  "Zero DTE trading involves a variety of strategies, with a focus on stop orders. Stop orders are a popular topic among traders, so let's dive into how they can be used effectively.",
  "If you combine stop orders with smart management, you can use stops effectively for protection. Simply relying on stops without management is risky. A stop order is not a set-it-and-forget-it solution; ongoing monitoring and adjustments are necessary for successful trading.",
  "A stop order can complement early trade management but won't make money on its own. Using cheap far out-of-the-money long options allows for selling zero-day premium. Market volatility has been low, limiting opportunities for zero-day premium trades.",
  "When trading at record highs, consider using stop losses or stop limit orders for risk management. Stop orders were popular in the past but may not always be reliable. Utilize buying power control when buying long positions.",
  "Tony and I have discussed stop orders once a year for the past 14 years, but we have never recommended using them. Managing losers may decrease our winning trade percentage, but how does it impact our net profitability? What stop loss levels have been most effective for zero DT trades? These are common questions. Let's move on to the next slide where we will discuss our study findings.",
  "In a study of 50 Delta straddles or 30 Delta strangles at market open, the effect of stop loss orders ranging from 25 to 200% of the initial credit was explored. This means stopping out at $1.25 or $3 if selling for $1. Managing winners at 25% of the initial credit was also considered.",
  "The initial credit is our target and research shows it is optimal. All trades assumed to be executed at mid price. Wings cost extra money and stop orders may not provide good fills. Moving on to straddles, the win percentage is a bit iffy.",
  "Straddles can be risky due to low returns. Setting stop loss at different percentages (25%, 50%, 100%, 200%) may limit losses, but average P&L is still negative. Using stop loss orders locks in losses as intended.",
  "Using stop orders to lock in losses can be detrimental over time. By implementing a straddle strategy with profit targets at 25%, 50%, 100%, or 200%, you can improve your win percentage significantly. Analyzing two years of data shows that combining a straddle with a 25% profit target can turn all PNLs positive. This strategy is particularly beneficial for traders with zero DTE.",
  "Is anyone trading zero DTE using stop orders? Groundbreaking research shows no statistical evidence that stop orders at a certain percentage work for making money trading zero DTE. If you want to make money trading zero DTE, avoid using a stop loss at 25%.",
  "If you have zero DTS and want to use a stop loss, set it at 25%, 50%, 100%, or 200%. To make a profit, aim for a 25% profit target. Consider using bracket orders for managing trades effectively.",
  "When using a one cancels the other order, manage the trade by setting a 25% profit target and stop loss. This applies to all trades. For 30 Delta strangles, using a stop loss order can result in win percentages of 33, 41, 50, and 57.",
  "Adding a stop loss turns losses into wins. Numbers increase from 30s to 60s and 80s. Optimal stop loss is around 50%. Use a 25% profit.",
  "Use a 25% profit target to make money and avoid greed. Place your profit target at 25% or 20% when placing an order. Employ stop loss orders to protect trades and manage winners effectively.",
  "With rapidly taking winners, profit targets and tighter stop-loss orders benefit zero DT option positions. Tony recommends 50-100% profit targets instead of 200%. At-the-money trades perform well when closed rapidly, whether win or loss. Exiting losers effectively reduces downside exposure while leaving enough profits to cover losses.",
  "When using stop-loss orders, keep in mind that once triggered, they will fill at the market price, which may be worse than your set price. Consider using marketable limits or limit orders."
]