[
  "In this segment, we are revisiting rolling zeros. The VIX was trading at a record low today, making it a challenging day for zero DTE trades. Rolling zeros refers to putting on a zero DTE trade, making a profit, and then rolling it over to the next day.",
  "If you make money on a trade and want to push it further, change strikes, take a profit, or do something else, research shows it's better to be one and done than to do multiple trades a day. Let's revisit this concept with more data.",
  "Retail traders can take advantage of liquidity in zero DT markets by aggressively managing winners. This means closing winning positions early in the day or rolling strikes to maximize profits.",
  "We are testing the performance of rolling mechanics on our new larger zero DTE data set, which now includes 18 months of data. This data set is one of the largest for Zero DTE trades in our tasty think tank.",
  "20 months of data in the zero DTE SPX trades. We choose SPX because it is cash settled, making it easy and an industry standard. Cash settled means that at expiration, if the trade is in the money, the amount is added to your account.",
  "Consider examining the 20 and 30 Delta strangles, which have been performing well in the current low volatility environment. Manage them by closing at 25% of Max profit or leaving losers alone. This approach contrasts with daily results for traders who base decisions on stock movement.",
  "Traders based their decisions to close or roll positions on the remaining hours in the trade. All trades were assumed to be filled at the mid price. The cost of controlling the long strikes was neglected, meaning long strikes were not bought to reduce buying power. To adjust for this, subtract $10 to $15 from the daily P&L for more realistic results.",
  "Focus on the daily P&L for more realistic results. In this study, losers are being ignored. Let's start with the 30 Delta strangles and analyze winning days. The data shows that closing on winners is at 90%, rolling until 10 is at 85%, and rolling until 11 is at 80-78%. The average daily P&L is better.",
  "The average daily profit and loss is better when you take your profit at 25%. Trying to make more can actually result in making less. Working less time and making more money is the goal.",
  "This statistic is consistent with our previous research findings from 6 and 8 months ago. With 20 months of data, the numbers are more reliable and significant. It is clear that it is better to trade early in the day rather than forcing trades late in the day.",
  "20 Deltas triangle shows a 93% win rate with an average daily P&L of $48. Risk is higher with SAR at the bottom, leading to lower numbers overall. Probability profit decreases, while CARAR increases.",
  "When your average daily profit goes down, it's a no-brainer. Take your winner on the opening and move on to another trade. Avoid trading in the zeros. Keep it simple and clear. Let's move on to the next slide.",
  "The best short premium zero DT positions have been the earliest ones. Many traders focus on the last hour of the day, but the first hour or two can be crucial for profitable trading.",
  "In trading SPY, there is assignment risk. SPX allows for smaller positions by buying wings. ES options convert to the Future.",
  "When trading SPX futures, it's important to consider the assignment risk. The first hour of trading is crucial for maximizing profits. Rolling winners is a common strategy for longer-term traders.",
  "Traders often choose to roll winners instead of closing them, especially if they have a small proportion of winning days. This can lower their average profit and make it challenging to manage zero day trades in smaller accounts without triggering day trading restrictions. It is advisable for traders to simply close winning trades and move on to avoid these issues. What is your opinion on this strategy?",
  "DT, be cautious with pattern day trading rules to avoid account shutdown. If under $25,000 in an IRA, same rules apply. Hoping for changes with new SEC leadership to make progress on pattern day trading rules."
]