[
  "Today, I will discuss monitoring, setting up, adjusting, closing, rolling, and redeploying capital for trading positions. Creating practical and actionable watch lists is essential for successful trading in futures and equities.",
  "trade or are interested in but they don't really understand the importance of focusing on specific criteria when selecting stocks to watch. It's crucial to prioritize stocks that meet your trading strategy and criteria. This will help you stay focused and make more informed trading decisions.",
  "Watch lists should start with the front month index futures in descending order. Index futures are the largest and most liquid pool of liquidity in the market.",
  "The futures market is the largest and most liquid pool of liquidity in the world. It is the most capital efficient pool of liquidity, attracting institutional and retail money. Index futures drive market movements, with stocks following suit. Futures trading is open from Sunday night at 5:00 until Friday night at 5:00.",
  "Markets are open, providing insight into what is driving equity markets. Start by monitoring S&P 500 (ES), NASDAQ (NQ), Dow (YM), and Russell (RTY) futures. Build a watchlist with other liquid futures and equities. Liquid equities have active options trading.",
  "Liquid equities are typically more liquid than options. Sometimes, an option marketplace may be very liquid even if the underlying equity or index is not. I prioritize listing futures first, followed by grouping similar assets together such as gold and silver, or 10-year notes and bonds. Finally, I list the most liquid equities first.",
  "Organize your equities by liquidity, starting with the top seven or eight most actively traded. Keep positions on a separate tab if your platform doesn't support watch lists. Separate Futures from equities for easy tracking.",
  "If you are trading equities and positions separately, consider using a different platform. Understanding Futures and how they relate to options is crucial in 2024. Being able to track all markets and quickly switch between positions is essential.",
  "Check your positions and utilize technology advancements in trading. With Tasty, you can now sort watch lists by various criteria, including IVR and liquidity, which can greatly benefit your trading strategy.",
  "On the first slide, I sorted seven stocks I have positions in (Boeing, Meta, SMCI, Google, AMD, Nvidia, and MU) by IV Rank and liquidity. Some stocks have two-star liquidity, some have three-star, and some have four-star.",
  "Some stocks have three or four-star liquidity, such as Google and AMD. Currently, Nvidia has four-star liquidity. Others, like SMCI, may have two-star liquidity. It's possible to sort by liquidity on various platforms, but I prefer to sort by IV rank to gauge implied volatility compared to itself when managing or opening positions. Today's segment focuses on trading.",
  "Today's focus is on managing existing positions in your portfolio. Identify the open positions with the highest implied volatility rank to roll forward. For example, Boeing has a high IV rank, indicating it should be rolled forward. Look for positions with IV ranks above 50 for potential adjustments.",
  "If the IV rank is in single digits, consider closing those positions instead of rolling them forward. Use a watchlist sorted by IV rank to easily identify which stocks to roll and which to close in your portfolio.",
  "Knowing which stocks to trade and when to close them is crucial for consistency in trading. IV rank is a simple and reliable indicator to help with this. While the information may seem overwhelming at first, focus on understanding the key points for successful trading.",
  "When managing your positions, quickly scan the individual Greeks and PNLs, regardless of the number of positions you have. Repetition will help make it clearer over time.",
  "we use native Greeks for Equity options and Equity index positions. This is not our total, just our individual positions. Beta weighting everything to the Spy can cause confusion.",
  "trading platform. Beta weighting individual positions to the Spy may look strange, so we use native Greeks for Equity options, ETFs, and indexes when possible. This feature is available on Tasty. We use ETF Greeks for all Futures positions and options to allow for accurate comparisons.",
  "An important adjustment to the platform allows you to have positions in Nvidia, IBM, Reddit, SNPS, and crude oil. This normalization simplifies trading Futures by setting everything to an equity equivalent.",
  "Consider adding Futures and Futures options positions to your portfolio for improved Capital efficiency and diversification. Normalize positions by using native non-ba weighted Greeks for individual equities and futures.",
  "For individual equities and futures, we convert everything to their Equity equivalent. For example, ES would be converted to SPY, and crude oil is converted to USO. This simplifies tracking P&L, which can be confusing for many traders.",
  "trading context. Default to daily P&L for individual underlyings and overall totals. Focus on daily P&L for individual positions and underlyings to quickly assess performance. Avoid getting caught up in open P&L or other types of P&L.",
  "The underlying quickly indicates if your position is off balance, based on Deltas. If your P&L looks abnormal compared to the rest, check your Greeks and Delta to confirm.",
  "P&L provides instant confirmation. Develop consistent risk management guidelines. Be consistent with monitoring frequency and position sizes.",
  "On the right side of the page, I have listed symbols such as Coinbase. My P&L for today is $125 and the position Delta for individual positions. For example, I have 15 long Deltas in SPY and my P&L is down $50. This converts to 30 SPY Deltas. In CL (crude oil), I have a P&L of +$100 which I converted to USO Deltas for simplicity.",
  "Focus on setting up your watch list correctly, ensuring your Greeks are accurate, and monitoring your daily P&L. Make sure everything is set up and converted properly for accurate comparisons.",
  "When comparing positions, it's important to beta weight everything to the Spy. This allows you to monitor your overall account risk effectively. While you can beta weight to other indices like the ES or the SPX, it's recommended to stick to the Spy for simplicity.",
  "beta weight your positions to the SPY for consistency and clarity in trading. The SPY is 1/10 the size of the SPX, so understanding this relationship is important.",
  "The SPY is 1/10 the size of the SPX. The relationship between the SPY and ES is that ES is five times the size of SPY, and MES is 1/10 the size of ES. They are all essentially the same product with some minor differences.",
  "different nuances, such as dividends, carry costs, and settlement methods. However, they are all based on the S&P 500 index. Understanding that SPX is 10 times the size of SPY, ES is five times the size of SPY, and MES is one-tenth the size of ES is key.",
  "The size of ES or Mees is equivalent to 50 shares of SPY. Two Mees equal one SPY, allowing you to normalize your portfolio risk. By looking at the Theta number and beta weighted Deltas, you can convert it into anything you want.",
  "Understanding the daily Theta to net lick ratio is essential for managing a portfolio. Ensure your Deltas align with your market assumptions - if you are bullish, avoid being short Deltas, and if you are bearish, avoid being long Deltas.",
  "If you are bearish and long Deltas, ensure your Deltas align with your market assumption. Monitor your daily data to your net lick for consistency. Determine a reasonable number based on your account size.",
  "Total portfolio Theta should be around 10 to 30 basis points of your net lick. For example, if your net lick is $100,000, daily decay should be around $100 to $300.",
  "position yourself strategically based on our 13 years of research. Aim for a Theta to net lick expectation of 1/10th to 1/3. Be disciplined and mechanical in your approach.",
  "Take a disciplined approach to managing your positions. Avoid overthinking and trying to predict stock movements. Stay mechanical and be consistent in adjusting your positions based on market conditions. This approach will help you avoid unnecessary risks and losses.",
  "A disciplined approach is essential in managing a portfolio. It's important to always know your next step based on your current positions. Don't waste time rewatching videos or webinars, be prepared for your next move based on your strikes and expiration dates.",
  "When deciding whether to stay in the same expiration or roll to another expiration, the default adjustment should always be earlier is better. Waiting may sometimes result in luck, but the general rule is earlier is better.",
  "If you're undecided, it's better to manage your trades early to meet risk expectations. We put together an example comparing managing early versus holding to expiration. The potential profit is slightly higher when holding to expiration, but the average daily P&L is higher when managing trades early.",
  "When managing trades, focus on reducing P&L volatility and outlier risk. Pay attention to standard deviation risk and portfolio volatility. Aim to minimize intraday swings to improve overall trading performance.",
  "Reducing intraday swings and outlier risk by 2/3 can improve daily P&L management. No other arguments needed. Contact Tom at tasty.com for questions. Next piece:",
  "The next topic is adjusting your positions. This part can be confusing, which is why we have six speakers sharing their perspectives: Nikki Batista, Mike Butler, Katie McGou, Jamal Chandler, myself, and Pete Mad.",
  "To manage Delta risk, remember the three Rs: roll up or down the untested side. If your Deltas are off balance, adjust to reduce risk.",
  "If you suddenly find yourself short 200 Deltas, consider adjusting your put position by rolling it up. Focus on the untested side to manage the long Deltas.",
  "If you have too many long Deltas, roll your call side down to reduce Delta and lower gamma risk. Reenter by buying the two nearest at-the-money strikes and selling out the wings in a single click.",
  "If your platform doesn't support selling out options with a single click, consider switching to a more advanced platform. Rolling out in time refers to transitioning from the current month to the next month when trading listed options, ETFs, indexes, and futures. This applies to all types of options, including crude oil, ES, NQ, and natural gas.",
  "NQ options for trading natural gas, copper, soybeans, bonds, or node options all involve rolling up or down the untested side with one click, buying the guts, selling the wing, or rolling out in time (calendarizing the trade). This means moving the trade to the next cycle or active month.",
  "In trading, calendarizing a trade can reduce risk by about 30%. Remember the three Rs: rolling up or down the untested side, reentering, and rolling out in time. Always get comfortable with these strategies early on, take profits when you can, and avoid adding to losing positions. Egos can often interfere with trading decisions, so it's important to stay disciplined.",
  "Egos often interfere with trading decisions. Avoid adding to losing positions, as it can be difficult to recover from. Take profits early and manage trades effectively.",
  "need to set aside and trust the process. Stay disciplined, consistent, and trust the research. Avoid personalizing the mechanics of trading. Remember to take profits, manage losses early, and adhere to the three Rs: stay disciplined, consistent, and trust the research.",
  "Traders often have alpha personalities that can make them pigheaded. It's important to stay consistent and trust the research. If the suggestion is to roll off the onesti side, do so. Avoid legging, unless it's a rare exception.",
  "If you start legging every trade, it won't work. Don't try to be cute or save pennies. No hero stuff. Stick to the plan.",
  "to achieve their financial goals efficiently and effectively. Trust in the research and avoid unnecessary risks. Stick to strategic optimization for long-term success in trading.",
  "time you make a trade, make sure you have done your research and optimized your strategy for success.",
  "focusing on Capital efficiency is key in trading. Trust the research and be comfortable with counterintuitive decisions. Avoid adjusting tests and focus on the untested side. Prioritize Capital efficiency over potential moves to avoid wasting money. Manage positions carefully.",
  "When managing your positions and portfolio, focus on increasing credits and lowering Delta to reduce risk. Avoid adding money or contracts to trades that are not working.",
  "If a trade is not working, consider staying in and fighting to the bitter end without adding more money. Increase credits by lowering Delta and focus on capital efficiency. Be comfortable with counterintuitive decisions and avoid unnecessary adjustments.",
  "counter intuitive not adjusting the tested side. Short puts in SPY and ES demonstrate capital efficiency. We trade various assets and appreciate the sponsorship from CME and CBOE.",
  "Primary option exchanges offer various benefits. For Futures options, capital efficiency is key. For example, with the same $7,000 investment, you can make almost seven times more profit compared to other exchanges. Understanding capital efficiency is advantageous in maximizing profits.",
  "The advantage of understanding capital efficiency is that we can trade various products, not just ES options. For example, we trade SPY for different reasons. This is what we call nuance know-how, where your max profit could be up to six times greater. Let's move on to the next slide.",
  "Sometimes, despite doing everything right in trading, the stock, future, commodity, ETF, or index may still win. It's important to understand that everyone needs to have their wins. Just keep doing the right thing and making the necessary adjustments.",
  "When trading, it's important to make defensive Delta adjustments when needed, even if it means rolling up puts. Don't be afraid to make offensive adjustments when the IV rank is high and you have a good position.",
  "IV rank is high, consider offensive adjustments like rolling down calls or rolling out to the next month to keep the position. It's okay to make offensive adjustments when a position is going your way. Be cautious when hedging, as many people overlook this.",
  "Hedging can be confusing and expensive, similar to an insurance policy. Be cautious and conservative with your hedges. Offensive hedging is acceptable, but be mindful of the cost.",
  "When hedging defensively, be cautious of overpaying. Remember, sometimes a stock wins. Make necessary individual Delta adjustments. Don't hesitate to make offensive adjustments when in a strong position. Be cautious when hedging and avoid doing so unnecessarily.",
  "When hedging, only do so when necessary. Moving on to the next segment on closing and rolling in trading.",
  "This segment is about closing and rolling positions. When deciding whether to close or roll a position, consider the optimal point in the Decay curve. If all factors are working in your favor, it may be time to close the position.",
  "You may consider closing a trade when the risk-reward ratio changes, and you are taking more risk for less reward. This could be due to a drop in implied volatility rank (IVR) as the underlying asset has moved or had its earnings announcement.",
  "The IVR has dropped, making it less attractive for trading. It is better to redeploy capital elsewhere for more efficient use. Consider switching to different assets like ES, MES, CL, or notes for better capital utilization.",
  "When trading Bond options, consider switching to IBM or Qualcomm options based on your current market assumption. Close positions if the underlying no longer aligns with your outlook or reaches your target. Aim for the expected move when entering a position.",
  "When putting on a position, anticipate a $10 expected move in the underlying asset. If the move reaches $10, consider taking profits. Rolling a position gives you more time to be right, extending the duration of the trade. Rolling is a strong defensive strategy to allow for being early in the market.",
  "extends the time frame for your trade to work in your favor. Rolling is a strategic move to manage risk and increase the potential for profit in trading.",
  "Rolling eliminates most outlier risk in trading. For the Spy, it eliminates almost all outlier risk, while for individual equities, it reduces a lot of it. In a 20 Delta strangle example, the win rates remain the same, but rolling allows for more profitability.",
  "matter in trading? Yes, for optimizing mechanics. Generally, with 20 Delta strangles, you can make more money and reduce outlier risk. Trade duration can impact these factors.",
  "Trade duration does not affect theoretical edge. Whether a trade is one day out, three days out, seven days out, 14 days out, 21 days out, or 45 days out, the theoretical edge remains the same. The optimization of mechanics is where the difference lies, as being at a better point in the decay curve can impact trading outcomes.",
  "The point in the Decay curve varies depending on the level of mechanics you apply to your trades. Managing a trade with one day or one week left is challenging, but with 45 days left, it becomes easier. Living in a certain part of the Decay curve can be more advantageous over time. Duration also matters as Deltas move slower, requiring fewer adjustments with longer durations compared to shorter durations.",
  "Short durations cause Delta to move quickly, requiring frequent adjustments. Longer durations result in slower Delta movement, reducing gamma and outlier risks. Adding duration also increases implied volatility in longer dated months.",
  "When implied volatility is low in the shorter-dated months, consider adding duration to increase it synthetically. This is due to the uncertainty in the long term, causing options to stay higher. For example, with a 16 Delta put with 53 days to go, the gamma is 0.93.",
  "16 Delta put with 53 days to expiration has a gamma of 0.93. The gamma risk increases by 5x when there are only 3 days left until expiration. It is important to have a diversified portfolio of underlyings when managing positions.",
  "To effectively manage positions, use a 3-day and 7-day risk management strategy. It's easier to handle positions with different time frames (3, 7, 21, 45 days). Timing is crucial, but predicting the market is impossible. Pay attention to timing for successful trading.",
  "Timing is critical in trading. Pay attention to your mechanics and timing. You can't time the market, but you can time the amount of attention you give to something. Timing is synonymous with risk reduction and discipline. If you want to be a disciplined trader, focus on timing.",
  "To be successful in trading, it is important to have discipline and a sense of timing. Timing is crucial for longevity and overall success in trading. Success in trading is often determined by small differences between individuals in various industries.",
  "successful in trading is dependent on your ability to survive and hang around for decades. There is no overnight success in trading, it is all about longevity and being able to consistently navigate the market.",
  "managing your portfolio with a focus on risk reduction and success. Now, let's discuss redeploying capital.",
  "In trading, it's important to be active and aggressive. There is no such thing as being too active or too aggressive, but not being active enough can be a problem. Overtrading is a possibility, so it's important to find a balance.",
  "There is no such thing as overtrading. Some may consider me an over trader due to my aggressive trading style. I prefer active and aggressive traders. Daily engagement, such as reviewing positions, is important even if no trades are made. Just checking positions or Deltas is sufficient.",
  "I will check my Deltas, p&l, portfolio Theta, and portfolio p&l. I will also check the Futures for daily engagement. It is important to stay updated on why I am losing or making money. Trading can be done from anywhere in the world.",
  "Trading can be lonely, which is why we host Live Events, chats, and encourage interaction on our Network. The monetary markets are valuable for talking shop and gaining insights.",
  "Trading is like being in a room by yourself, discussing and articulating your thoughts about markets. Attending Live Events can be valuable for talking shop with others. I have been doing it my whole life and it's all I talk about at the Thanksgiving table or during holidays.",
  "At my holiday table, we have a rule of no market talk. Product indifference and capital efficiency allow for more trading activity. Being locked up in equities or certain commodities can limit your options.",
  "When trading commodities, focus on products that are capital efficient. Futures and Futures options are generally not correlated to equities, except for indexes. This provides a variety of choices that are capital efficient. Stay open-minded and consider different products.",
  "In trading, it's important to be agnostic towards products and capital efficient. Using correlation graphs with ETFs like SPY, QQQ, IWM, TLT, GLD, USO, UN, and FXE can help track underlying Futures products. SPY corresponds to ES, QQQ to NQ, IWM to RTY, TLT to ZB, GLD to GC, USO to CL, UN to NG, and FXE to 6E.",
  "These are the ETFs we use. Look at the bottom of the page to see the Spy, bonds, gold, Uso, and un. There is virtually no correlation, highlighting the beauty of non-correlated markets. Consider the importance of redeploying your capital.",
  "Increasing the number of occurrences when trading is essential for a more predictable outcome. It is important to redeploy your capital effectively to make the most of your trading strategy.",
  "Log on, adjust positions, close or reopen trades. Increasing occurrences leads to more predictable outcomes. Redeploying capital optimizes your portfolio for success. Basis reduction and high probability trades are key for optimal results.",
  "becomes even more clear that the results are predictable and consistent. The more trades you sample, the tighter the range of outcomes, reducing the likelihood of outlier moves.",
  "With 2,000 to 5,000 trades, creating a currency allows for a more predictable outcome. Redeploying capital and keeping it optimized gives you the capital to do what you need. It's all about basis reduction and high probability. Consider reasonable return expectations for your portfolio and set objectives accordingly.",
  "Your objective should be at least three times the risk-free rate, which is currently about 5%. Your objective could be 7x, 35%, or 3% per month. It's easier to hit higher numbers with a smaller account.",
  "The minimum objective should be around three times the risk-free rate, approximately 15-18%. Aim to average around 25% of your daily Theta. For example, with a $100,000 account...",
  "If you have a $100,000 account and collect $200 a day in theta (0.21% daily), you would collect $6,000 in theta per month. Keeping 25% of that ($1,500), results in a monthly return of 1.5% and an annualized return of 18%.",
  "Understanding the math and objectives of managing a portfolio, sticking to mechanics, being disciplined, and trusting research can significantly improve all aspects of investing, including non-traditional investments.",
  "For non-traditional investments and business entrepreneurship, understanding risk-taking is crucial. Setting reasonable objectives and minimum targets can make a significant difference in your trading strategy.",
  "What is the minimum objective and how high could I aim for? What is a reasonable amount of money to keep based on the risk I'm taking? This could be as much as 10x. Once you prove concept and repeatability, trading can be very scalable. How scalable is trading an active portfolio?",
  "When trading an active portfolio, it is important to prove the concept before scaling up. You need to demonstrate that you can repeat success to make it scalable. The general rule is that scaling investments is typically 10 times faster than wealth creation.",
  "Scaling investments can accelerate wealth creation by up to 10 times. Research, including studies from the University of Chicago, supports the idea that scaling can improve the speed of wealth creation.",
  "First, prove the concept and repeatability before scaling up and taking things to the next level in trading."
]