[
  "the odds of large daily moves in high volatility stocks? In this segment, we analyze the Dynamics of Major Market shifts to uncover patterns in their occurrence. How likely are these moves to happen?",
  "Pat, how likely are significant market moves to happen within a defined time frame? By analyzing past events of similar magnitude in major ETFs and liquid single stocks, we can assess the probability of such shifts taking place again. Major market moves occur more frequently in individual stocks than in ETFs.",
  "It is harder to move 500 stocks than one stock. The likelihood of this happening is low because it is not good for business. We used two ETFs to spy on the QEs and two stocks, Tesla and Nvidia, for our analysis.",
  "We chose Tesla and Nvidia because they are the most liquid optionable stocks. SPY and QQQ are the most liquid optionable ETFs. We calculated the probabilities of certain daily moves in a 5-day trading window from 2015 to present. Next slide, please.",
  "The most active option trading vehicle is SPY. The chances of a 7-10% movement in a week have been zero in the last 10 years, but the probability of a 1% movement is high. SPY has an average daily movement of 1.11%.",
  "A 1% move is happening almost every day. Numbers show 25% once, 8% twice. What are you worried about?",
  "The chances of a 10% move are small but can be very painful. The QQQ also has a low likelihood of experiencing a 5% or 10% move in a week based on the past 10 years.",
  "In the past 10 years, the Q's have had an average daily movement of 1.37 compared to 1.11 for SPY. The numbers show similarities between the two. It would be difficult to differentiate between them. Overall, the numbers are pretty much the same. The key takeaway is that a 10% move is not common.",
  "For a 10% move in the S&P 500 would be 6,000 points. A 1% move is 60 points, triggering circuit breakers. Over a 10-year time frame, ETFs tend to remain stable with daily moves between 1-2%. Individual stocks like Tesla and Nvidia exhibit",
  "Individual stocks like Tesla and Nvidia are known for their higher volatility and frequent price swings. Tesla, in particular, has an average daily move of around 4%, making it a highly liquid and volatile stock. This is why it is actively traded and has higher implied volatility compared to other stocks like Spy and Q's.",
  "Implied volatility is higher in ETFs compared to individual stocks. The probability of experiencing 1% or more movement per week is relatively high. Stocks that move 4% a day have prices that reflect this volatility.",
  "Stocks like Tesla and Nvidia have the potential to move 4% a day, reflecting the opportunity to make significant profits. Nvidia has shown a 0% likelihood of experiencing a 5%, 7%, or 10% movement within a single week over the past 10 years.",
  "Within a single week and over the past 10 years, it has experienced an average daily movement of 3.5%. This is just under what Tesla has. We have analyzed the numbers for you to show that it is very interesting. You get paid three times trading in India over what you would in Despise because of the higher risk. In Tesla, you get paid four times over Despise due to the increased risk.",
  "According to our study over the past 10 years, individual stocks have shown more than three times the frequency of large daily movements compared to ETFs. Since early 2025, there have been more large market movements, offering profit opportunities and increased liquidity, but also posing risks like loss.",
  "Liquidity in trading poses risks such as loss distress, margin slippage, and requires strong risk management."
]