[
  "Let's discuss why occurrences matter in trading strategies. Achieving a high number of occurrences can be beneficial for certain strategies. It's important to understand the nuances of occurrences for a deeper discussion.",
  "We often debate what An Occurrence could be in trading. The goal of trading often is to achieve a high number of statistical occurrences, reducing strategy variance and increasing the chances of realizing long-term averages. This can lead to a positive expected value over time.",
  "a short option strategy can have a positive expected value over time. To realize this, it is important to trade frequently over a long period. Today, let's discuss what an Occurrence is and why it matters.",
  "When analyzing a population or system, a large sample size is preferred to reduce sampling errors and ensure statistically representative results.",
  "To measure a system accurately, we need a large number of measurements. In trading, it's important to have data that spans a long time and captures various market conditions to evaluate performance effectively.",
  "Market conditions impact short-term fluctuations in trading strategies, affecting long-term expected behavior. To smooth out profits over time, a large number of occurrences is needed based on statistical principles like the law of large numbers.",
  "Our PNLs over time follow the law of large numbers. Tony and I discuss the central limit theorem frequently. This background motivates our trade small and trade off mantra, which is based on statistical principles.",
  "The principle of trading consistently small trades over time reduces P&L variance and brings the strategy average closer to its expected value. Short-term strategies often have positive averages.",
  "We built our trading career around the important concept of trade often, trade small. Understanding the law of large numbers and Central Limit Theorem is crucial for success. Blackjack also teaches valuable lessons on discipline.",
  "In trading, it's important to maintain discipline and avoid high-risk strategies. Trading small and frequently may align with the casino's objectives, but not necessarily with your own. Understanding the context of the market's volatility can help you make more informed decisions.",
  "Trade small and often when there is evidence of long-term positive expected value for the game. Avoid negative expected value trades.",
  "Gauging the nuances of estimating short premium strategies through back tests shows evidence of trading small and often. This approach is rooted in statistical principles discovered by two individuals.",
  "The statistical justification for this type of trading is based on completed trades with a specific underlying contract type, Delta, and expiration. For example, placing a monthly spice strangle trade would be considered a monthly occurrence.",
  ", we aim to achieve a high number of occurrences to minimize the impact of short-term fluctuations on our strategy averages. This involves completing trades with specific parameters and underlying contract types, such as Deltas. By averaging over various market conditions and time-sensitive risk factors, we can better manage our trading strategy.",
  "When counting occurrences towards a specific trading strategy, it's important to have variation in risk profiles. For example, selling a 45 DTE 16 Delta spice strangle at the open and then selling another one at noon may not provide the impact of two distinct occurrences due to potentially similar market conditions.",
  "Market conditions may not have substantially changed between opening the first and second trade. While these are considered occurrences, the goal of achieving a large number of occurrences is to smooth out our profit and loss over time. This may not have the impact of a distinct occurrence.",
  "The impact of a distinct occurrence depends on how you space out your traits. There is a difference between total views and unique viewers. Total views refer to the overall number of viewers, while unique viewers are individual viewers.",
  "Refer to total views for simplicity. Think in terms of total viewers, not unique viewers. Understand the perspective of simplicity in trading occurrences.",
  "The goal is to achieve occurrences to smooth out your profits and losses. Understanding the nuances of unique occurrences is important. Under normal market conditions, there is a strong case for counting a trade towards a unique occurrence for a particular strategy if there is a buffer time between trades.",
  "occur within a short period of time. The key is to focus on the change in risk profile rather than the time that has passed between trades. This shift can happen quickly, especially in volatile markets.",
  "shift in risk profile that can justify counting unique occurrences differently. In normal market conditions, we define the strength of counting something as an occurrence based on the passage of time. Risk factors are often driven by duration and changes in market conditions that take time to propagate.",
  "Next slide. I discussed this study with Jacob, who suggested looking at how the P&L variance or standard deviation changes based on trade distribution in the data set. This led to an interesting finding. We calculated the...",
  "We calculated the P&L volatility (standard deviation of PNLs) for 45 DTE 16 Delta SPY strangles from 2013 to present. We measured how this standard deviation changed based on the frequency of opening trades (daily, every other day, every third day, etc.). The graph illustrates the P&L standard deviations based on the spacing of trades in the dataset.",
  "In this data set, the P&L volatility ranged from 670 to 710 when strangles were opened one to five trading days apart. It dropped to 630 when strangles were spaced out by an average of seven trading days or nine calendar days. The sharp drop in P&L volatility is due to the spacing between strangles.",
  "there is a natural shift in expiration cycles after about seven trading days or nine calendar days on average. The 45-day contracts from the previous cycle are close enough in duration to count as a 45-day occurrence. This shift results in something that was originally 50 days now being close enough to 45 days to count as another occurrence.",
  "When we shifted into expiration cycles, we noticed a significant drop in P&L variance. Spreading occurrences out to ensure each has a unique expiration cycle may help smooth out these fluctuations over time in regular market conditions. Buffer time of 45 days can be beneficial.",
  "The buffer time for 45-day contracts is about nine calendar days for SPY. It is helpful to have a specific number to space out trades and smooth out PNLs over time.",
  "looking to manage my position by rolling out to the next expiration cycle how many days should I wait between rolling the first trade and the second trade to consider them as distinct occurrences?",
  "16 Delta SPY strangles with a duration of about 45 days. Spreading out occurrences by about nine days.",
  "risk profile, then these unique occurrences can be beneficial. It's important to differentiate between regular occurrences and unique ones when making trading decisions.",
  "can lead to a smoother profit and loss curve. Using unique occurrences may help achieve this goal. On average, spreading out occurrences by about N9 days can be effective, according to a study. In conclusion, the strategy of trading small and trading often is grounded in the statistical principle that consistent small trades over time can lead to smoother results.",
  "Small trades over time reduce P&L variance caused by market noise. To minimize short-term fluctuations, unique trade occurrences should have varying risk profiles. Factors can cause changes in a trade's risk profile.",
  "When trading in regular market conditions, it is beneficial to spread out occurrences with unique expiration cycles, such as nine days for 45-day contracts like SPY. This approach allows for different trading strategies and opportunities without discouraging people from making adjustments or reentering trades.",
  "We make adjustments to our trades without getting emotionally attached. We focus on the trading context and don't chase after small gains.",
  "I often receive questions about trading 10 puts at once for diversification. While it may seem like a good idea, it lacks time diversification.",
  "is not a foolproof method and there are still risks involved. It's important to carefully consider your trading strategy and risk tolerance before implementing time diversification.",
  "It is important to consider various factors such as adjustments, rolling, and changes in volatility when trading index options. This information is more relevant for regular market conditions."
]