[
  "Welcome to Option Trades Today. I'm Tony the Baptist. Today's trade idea is for October 22nd, 2024. The S&P is down 15 points, Nasdaq and Russell are also down slightly. Let's dive into the trade idea.",
  "Russell is weaker than the rest of the group, selling off while the market has been gaining. The Dow is down 80 points and volatility is up 33 cents, almost 2%. Volatility remains high as the market continues to fluctuate.",
  "Bonds traded down to 118.02 despite interest rate cuts. Typically, rates go lower and bonds go higher, but currently, bonds are decreasing. The 30-year and 10-year bonds are following a similar trend. Today, I will discuss the cost of capital.",
  "I will analyze the cost of capital and buying power for two stocks, starting with Goldman Sachs ($519 stock).",
  "From the high option volume list, stock $519 is relatively high priced at $500. It has had a $1.74 increase today with an average move of about $5. The IVX 5-day change is slightly red over the last 5 days, indicating volatility. The Ivy rank of 37 is good and there are no earnings looming.",
  "I will compare the same strategy in a $500 stock with JP Morgan. Half the buying power would be needed for a $224 stock versus a $500 stock. Both have similar average size moves and IV rank, with JP Morgan slightly higher at 38 compared to Goldman Sachs at 37.",
  "When comparing JP Morgan to Goldman Sachs, both companies are in the same industry. The IV rank, IVX 5-day change, relative move for the day, and price are similar. Let's analyze the buying power relationship between two similar trades.",
  "I will stay in JP Morgan for now. December earnings are in January. The volume is good but not great. The market is tight with thousands of contracts on either side, making it a liquid market. Bid-ask between strikes is relatively tight. There is enough volume here to warrant a trade.",
  "you're looking for in a trade is volume. You want to ensure there are other traders in the market. Consider a 20ish Delta strangle on both sides for JP Morgan, with puts at 210 and calls at 240. Aim for delta neutrality around 55 Deltas, with a pop of 65%. Theta decay is $970, and max profit depends on volatility.",
  "Your max profit when selling for $494 is around $495, with a max loss defined by your buying power. With $3,000 to $3,100 in buying power, there is a 65% probability of profit. I prefer trades with a 65% probability or higher.",
  "We are analyzing JP Morgan and Goldman Sachs on the Tasty Trade platform. JP Morgan has strong open interest numbers, while Goldman Sachs, being a higher-priced stock, has slightly weaker open interest. Both have upcoming earnings in January.",
  "Interest in JP Morgan has potential for a trade. Consider 480 puts and 560 calls with around a 20 Delta. Volume and market conditions are favorable. Compare the numbers: 67% pop vs 65% pop, Theta Decay at 25.",
  "A higher priced stock like Delta is delta neutral. The mid price for selling is $1,255 with a buying power effect of $6,500, which is twice as much as JP Morgan. The credit received is more than twice as much as JP Morgan, with a mid price of $1,255.",
  "Sell the 480-560 strangle on Goldman Sachs for a potential profit.",
  "I plan to sell the 480 560 for around $12.55, the mid price. You can view this trade on the following page. Consider opening an account with Tasty Trade for perks like cash bonuses. Visit TDtrade.com for more information.",
  "Visit TDtrade.com to support us and keep our content free. Bring your account to Tasty Trade to help us continue providing great content."
]