[
  "Welcome to the life cycle of a trade series where we break down trade entry, adjustments, and closing orders. In this video, we will cover a call diagonal. We have seen a significant pullback in the market, with McDonald's being hit particularly hard overnight, down approximately 7% due to negative news.",
  "The stock is down 7% currently, reaching a low of 280 overnight. Implied volatility is high, with IV rank exceeding 100. This could be a good time to consider trading.",
  "This is an interesting time to consider a contrarian move with Delta. Despite recent price action erasing gains, the stock has rallied significantly. Considering a call diagonal spread in McDonald's, noting that while IV rank is high, actual implied volatility is relatively low.",
  "In McDonald's, implied volatility is currently low at 20-24%, making Delta cheap to buy. When volatility is high, Delta is more expensive. Let's buy the December 300 strike, which is the first strike out of the money with $5 wide strikes.",
  "focusing on a relatively cheap call diagonal spread with a $700 premium. Targeting a short option at the 310 strike, aiming for a price just under the 52-week high of 317. Picking up 18 long Deltas in a stock trading around $300.",
  "Let's round it to $300. We're getting $3,000 to $4,000 worth of exposure in Delta for just $500 or $600. This reflects the leverage of options and the low implied volatility. The diagonal spread has moved significantly as the stock rallies.",
  "The stock has moved significantly, making it difficult to assess risk at expiration due to calendarized options. Using analysis mode, we can simulate the passage of time and adjust for implied volatility. This gives us a 50/50 shot on the risk profile.",
  "We are looking to get filled at 590, 593, or 595 for a long option position. The stock is currently at 296, so we may need to adjust our entry to 310 to get filled.",
  "Filled at 310, price improved at 604. Long Delta in McDonald's into this dip at the session high. Good timing on that trade. Managing our winning McDonald's position, originally at 297, now up $3-4. Slightly bullish with a called diagonal spread.",
  "The value of the short option we sold in the November monthly expiration at the 310 strike has increased significantly. It was trading at about $4 when we put the trade on, and is now trading at about 35 cents. This gain is due to time decay and a decrease in implied volatility.",
  "The option we sold at 390 is now trading at 30. The long option has only gained $2 while the stock price has remained stable. We bought it at 10 and it's now trading at $759, resulting in a loss of $2.50. However, we gained almost $3.50 on the short option. Most of the profit came from the short option, giving us profit potential. Consider selling out of the December call and buying back the November position.",
  "December call buying back the November position at 730, filled 2 cents above mid price. Closed out for $126 profit, around a 20-30% return on capital in a 3-week timeframe."
]