[
  "Welcome to Option Trades Today. I'm Tony the Baptist. Today, January 2nd, I have a trade idea for you. The S&P is down $450, with an $80 handle top to bottom. It opened up 13, then went down 20 handles, and now it's up 50 handles.",
  "The market opened up 50 handles and has been volatile but with unchanged volatility. Currently at 1765, there is some churn with three indices lower (NASDAQ, Dow, S&P) and only the Russell higher. I prefer a neutral strategy today.",
  "Today's trading strategy involves avoiding stocks with earnings reports. One stock to watch is AVGO, currently up $3.80. Consider making a trade around $235.",
  "Stock is trading at $235, near the higher end of its range for the day. Ivy rank is lower by 2.5%, but still at a good rank of 40. Option markets are 2-3 cents wide, which is considered good.",
  "looking at a 15 Delta on each side for a standard deviation strangle in AVGO. The bid-ask spread is 3 cents wide, with larger calls at 10 cents wide. AVGO had a big gap up a month ago and has been trading sideways. I will play it sideways today.",
  "I'm trading the 200 call and 200 put on each side, with the 280 call to give me two short Deltas. I was filled at $548, right at the mid price. Aim for a higher credit for a better trade outcome. This is a delta neutral trade.",
  "If you move the put up one, you'll be long a Delta and a half. I went with a 15 Delta versus 13 Delta and a price of $274. Both options are equal in price and Delta. You are $35 away on the put side and more on the call side, about $45.",
  "Skew refers to the difference in price between options at different strike prices. If you prefer to avoid skew, you can adjust your positions accordingly. This trade has about two short Deltas and a 77% probability of profit.",
  "On the Tasty Trade platform, the one standard deviation line is shown on top and bottom. The green line represents your profit and loss graph. You can make money between $195 and $280, with a break-even point of $285 if filled at 50 cents. The downside break-even point would be $194.50 if filled at $550. This is a good trade outside the standard deviation.",
  "Standard deviation trade: classic strangle with high IV rank. Stock moving sideways, good markets on each side outside of standard deviation for a 77% probability of profit above 65. Looking to profit as time passes and stock moves up or down. Entry at $548.",
  "Get filled at Tasty Trade for all your trading needs. Transfer your account and enjoy our support for most products. Help us keep the lights on and have a happy New Year."
]