[
  "up, things are going to work out pretty well. But what if the market doesn't move at all? That's where trading volatility comes in. Let's get ready to start trading volatility through options.",
  "If you're bearish and the market goes down, you can make money. Direction matters, but predicting it is uncertain. No one knows where the market is going next.",
  "Market direction is unpredictable. In this crash course, I will show you how to shift the emphasis away from short-term directional moves and focus on other trading strategies.",
  "To begin the journey of trading, it's important to understand the three factors involved in option profitability: direction, time, and volatility. Many traders focus solely on direction, overlooking the impact of time and volatility.",
  "market. By focusing on time and volatility, traders can potentially profit regardless of market direction.",
  "portfolio. By focusing on volatility metrics, you can gain valuable insights and opportunities for diversification in the market.",
  "Diversify your portfolio to manage risk and capitalize on new opportunities. Traditional investors may not welcome volatility, but it can present new trading possibilities.",
  "trading perspective, volatility spikes can present opportunities to capitalize on short option strategies.",
  "Market prices and volatility have shown an inverse relationship over time. When market prices go up, volatility tends to go down, and vice versa. This relationship is reliable but not perfect.",
  "Market volatility is an independent metric that allows for diversification in a portfolio. It provides a way to shift assets beyond fixed income, currencies, or precious metals.",
  "Trade volatility first, not direction. This will shift your portfolio away from day-to-day market movements. Inside the platform, focus on market-wide volatility.",
  "On the left side, we have the VX, which is the volatility Futures for the front month, currently November. VX is trading at 2040. Another commonly used market-wide volatility metric is the VIX, also known as the fear indicator.",
  "The VIX is currently trading at 19.21, indicating market-wide volatility. Traders often look at future volatility, such as VX futures contracts. The VIX is the spot volatility indicator.",
  "When looking at Apple's quote overview on Tasty Trade, check the IV Index for Apple's implied volatility in one number. This is important for understanding the volatility of specific stocks.",
  "Every stock has various implied volatilities associated with different expiration cycles and strike prices. For example, Apple's IV index is 28.6. By looking at the trade page, you can see how implied volatilities vary between expiration cycles.",
  "When trading options, it's important to consider the different numbers associated with various expiration cycles. For example, opening up the November expiration cycle with 41 days to go will show different implied volatilities for the available strikes.",
  "By selecting a dropdown menu from extrinsic value to implied volatility, you can see multiple implied volatilities for different strikes within the same expiration cycle. Tasty trade provides an average implied volatility by considering various metrics for a stock.",
  "The IV rank for Apple is 44.9, indicating the stock's volatility compared to others. This metric helps in comparing stocks like Apple and Proctor and Gamble. More on this will be discussed in the crash course.",
  "The IVR for Apple is currently at 44.9. Understanding this number is important for trading volatility. Shifting focus from trading direction to volatility will change the foundation of your portfolio.",
  "Direction exclusively looks at metrics like implied volatility and IV rank. These will be a big part of your daily trading activities. Volatility is fluid and dynamic, like other metrics in the financial marketplace. Understanding how it changes is important for active traders.",
  "In the financial marketplace, many models assume constant volatility. Allowing for changing volatility, known as heteroskedasticity, complicates financial modeling. This makes it challenging to capture the complexities of real markets.",
  "As traders, we are more focused on improving the risk profile of our portfolios rather than theoretical obstacles. Heteroscedasticity presents opportunities for us to capitalize on in trading.",
  "Market conditions can fall into three states: expansion, contraction, and low volatility. According to figure 2.2 in the Unlucky Investors Guide to option trading, volatility expansion occurs 10% of the time, volatility contraction occurs 20% of the time, and volatility lows occur 70% of the time.",
  "Volatility expansions occur when volatility is rising quickly, while volatility contractions happen when volatility is falling quickly. Volatility lows are periods of stable volatility with a tendency to slowly decrease over time. Taking advantage of these different states involves selling volatility during contractions or when in a volatility low.",
  "volatility contraction. We can take advantage of this by buying volatility when it is expanding. Despite the unpredictability of the market, we can use these findings to inform our trading decisions.",
  "Volatility in the market can either contract quickly or slowly during a low, with roughly 90% of days being in this state. It is only about 10% of the time that volatility significantly expands. Selling volatility offers more opportunities than buying because it can benefit from contractions or lows, while buying may only profit during expansions.",
  "Volatility traders can profit during both volatility expansions and contractions. Profitability in trading is multifactorial, but being in a market where volatility is decreasing can make trading easier.",
  "When trading volatility, it may be easier to be on the short side rather than the long side. Predicting market volatility is uncertain, but there may be some predictive power to tap into. For example, when trading a stock like Amazon with 41 days until expiration, the expected move can be found on the trade page.",
  "bearish outlook on the stock and I want to set up a short call spread. I would sell a 195 call and buy a 200 call. This strategy has defined risk with a maximum loss of 335 and maximum profit of 165.",
  "I have a neutral bias on Amazon, so I could sell a 170 put and a 205 call to create a neutral strategy. This allows me to benefit the most if Amazon stays between my strikes. You can see this more clearly in the p&l diagram in the curve view.",
  "Click on the analysis button to view the profit and loss diagram in Tasty Trade. This diagram illustrates where profits and losses occur, as well as risk, break-even points, and other important factors. This is just a brief overview of the available features in Tasty Trade, which includes short premium strategies. There are also long premium and debit strategies to explore further.",
  "In this course, we will focus on the table view for trade analysis. You can select different variables such as Theta, Gamma, and Vega. Vega is a Greek that measures sensitivity in the Black-Scholes model.",
  "Souls model shows how sensitive a strike is to changes in volatility, indicating how much an option contract will move when volatility changes by one point. The sign of the Vega is more important than the magnitude, especially in strategies like a short call spread.",
  "I have a short call spread with a 195 strike sold (short 24 Vega) and a 200 strike bought (long 22 Vega), resulting in a net of minus 2 Vega. This means you will be short Vega and able to benefit from falling volatility. Consider selling a strangle using the expected move as an anchor.",
  "use the expected move as our anchor for strike selection, selling the 170 put and selling the 205 call just outside the expected move. The key focus is on the Vega impact of this strategy. Selling an option results in negative Vega, while buying an option results in positive Vega.",
  "buying an option with positive Vega can be beneficial. In a strangle strategy, selling options on both sides of the market can capitalize on falling volatility. For example, selling a 170 put with an 18 Vega and selling a 205 call with a 19 Vega can be profitable.",
  "I'm selling a 205 call with a 19 Vega to avoid dilution and eliminate the need to buy back Vega from long options. Shifting focus from direction to factors like volatility, IVR, and option Vega can maximize potential in trading.",
  "Option Vega measures the sensitivity of positions to changes in volatility. Volatility has a mean-reverting characteristic. We can understand this through mathematical, intuitive, or empirical approaches. Let's discuss each.",
  "Market volatility is a stationary process, where data points that deviate from the mean are countered by additional data points to bring the variable back to its mean. This concept has been demonstrated by academics and researchers.",
  "Volatility in trading follows a pattern of mean reversion. Periods of low volatility are typically followed by periods of high volatility, and vice versa. This pattern is influenced by global events and market uncertainty. It is intuitive that calm markets will eventually experience a shock, leading to volatility expansion, followed by a period of stability and volatility contraction.",
  "identified a pattern of calm volatility contraction in the data. This empirical approach focuses on the actual data, which is the ultimate determinant of truth.",
  "The Tasty Live research team has studied volatility mean reversion multiple times. A study from August 2022 shows the power of volatility mean reversion, particularly from the short side of option contracts. Analyzing VIX data from 2000, the study highlights the probability of an up or down day in the VIX.",
  "bias towards a down day in the VIX. This is due to the overall positive drift in the market leading to a higher probability of an up day in the market.",
  "vix showing an upward bias. After a series of down days in the vix, the probabilities of the next day remain around 50/50 between an up day and a down day. However, as the down day streak continues, there is a slight shift in favor of the vix showing an upward bias.",
  "There is a slight shift in favor of the next day being an uptick in the VIX, indicating volatility expansion. This suggests some mean reversion after a period of volatility contraction. Following a series of updates in the VIX, probabilities begin to change significantly, moving away from a 50/50 chance.",
  "probabilities are not guaranteed, historically speaking, this type of market environment has been favorable for long volatility strategies such as debit spreads like long vertical, calendar, or diagonal spreads. These strategies can be effective in taking advantage of low volatility levels.",
  "Take advantage of the environment and look for opportunities in volatility mean reversion. Consider a short volatility strategy like a short vertical spread, iron condor, or short put after volatility has expanded.",
  "short iron condor strategy that can capitalize on the market's tendency to revert back to lower volatility levels. This strategy aligns well with different volatility conditions and scenarios, making it a strong choice for trading in the market.",
  "nice environment for short volatility trades. The market's volatility mean reversion can be advantageous, especially from the short side of the option contract. Now, let's combine these insights to enhance our trading strategy.",
  "When trading, it's important to consider implied volatility and implied volatility rank. While market-wide volatility metrics like the VIX provide a broader context, focusing on specific stocks allows for a more targeted strategy selection.",
  "Implied volatility measures the expected volatility of a stock over a specific time period. Higher implied volatility indicates more volatility and wider stock price ranges, while lower implied volatility suggests the opposite.",
  "Lower implied volatility in a stock indicates less volatility and narrower price ranges are expected. Implied volatility is a key input in the Black-Scholes option pricing model, which helps determine the price of options based on factors like stock price, strike price, time to expiration, interest rates, and potential dividends. The focus is on the relationship between option price and implied volatility.",
  "higher implied volatility, the option price will be higher. Conversely, if implied volatility is lower, the option price will be lower. Check out our crash course on option pricing for more in-depth information.",
  "When buying options with Reit strategies, using them in stocks with lower IVs can make sense. When selling options with credit strategies like short verticals, short strangles, and short puts, using them in stocks with higher IVs can be more effective. Keep in mind that implied volatility is not the only factor to consider.",
  "When analyzing trades, implied volatility is a key factor to consider. Understanding how implied volatility impacts option premiums is crucial for successful trading. Now, let's shift our focus to implied volatility rank (IVR).",
  "Volatility Rank (IVR) is a measurement that looks at implied volatility (IV) relative to itself over a specific period of time. It analyzes the range of IV for a stock over the last 12 months and shows where the current IV sits within that range. For example, if the IV range for Apple over the last year was 30 to 60, an IV of 45 would indicate a mid-range level of volatility.",
  "In the last 12 months, the IV for a trading app ranged from 30 to 50. If the current IV is 40, the IV rank would be 50, indicating it is at the 50th percentile. For Apple with an IV of 35, the IV rank would be 25. Similarly, Amazon has an IV range of 25 to 65.",
  "IV range of 25 to 65. If Amazon's current IV is 30, it is 5 IV points into a 40-point IV range, resulting in an IVR of 12.5. IVRs outside of 0 to 100 boundaries indicate current implied volatility is lower than the previous 12-month low or higher than the previous 12-month high.",
  "If the IVR is -10, it means the current implied volatility is 10% lower than the previous year's low. If the IVR is 106, it means the current implied volatility is 6% higher than the previous year's high. Apply volatility mean reversion on a stock-by-stock basis.",
  "to start trading volatility, but where do I even begin?",
  ": \"I'm ready to start trading volatility, but I need to know what constitutes high volatility. In August 2023, our research team found that selling 16 Delta strangles on stocks with an IVR above 30 yielded better results than on stocks with an IVR below 30.\"",
  "The key takeaways are that selling premium was profitable in both IVR environments, but the P&L was drastically different. The average daily P&L in the under 30 IVR category was 25 cents, while in the over 30 IVR category it was $1.15, over 3x higher.",
  "If you are new to short options trading, consider the effectiveness of lower IVR. Avoid selling volatility during high IVR to prevent potential losses from a sudden volatility expansion. Short options can be effective in various market conditions.",
  "When IVR is low and implied volatility is suppressed, consider using debit strategies like long verticals, calendars, and diagonals. Use 30 as a marker for high IVR and low IVR.",
  "High and low IVR are good reference points for analysis, but IVR is fluid and dynamic. Some traders prefer IVRs of 20 or 25 for selling premium, while others are comfortable with higher IVRs.",
  "When IVR expands to 35 or 40, consider using short premium strategies. Start with an IVR of 30 and adjust based on your style, risk tolerance, account size, and experience level. Explore tasty trade for more trading insights.",
  "Let's set up some short volatility trades on Tasty Trade. To begin, go to the hamburger menu and click on the watch list. Start with either the Tasty default or Tom's watch list.",
  "start with stocks that have a high IV rank. This indicates that the options are pricing in a higher level of volatility, which can lead to higher premiums when selling options. By focusing on stocks with high liquidity and high IV rank, you can identify potential trading opportunities more efficiently.",
  "To sell premium, click on the IV rank column to sort from high to low. This will show the IV rank of different stocks like IBM, Chipotle, and Starbucks. Choose a stock with a high IV rank, such as Starbucks with an IV rank of almost 75.",
  "With an IV rank of almost 75 and a stock price of $97, I open up Starbucks on the trade page. I choose the November cycle with 41 days to go, keeping in mind that earnings are on November 7th. Despite the upcoming earnings, I proceed with the trade due to the current earnings season.",
  "Given the time of year, let's focus on trading strategies. If I'm bullish on Starbucks in November, I could sell a put spread by selling the 95 put and buying the 90 put to collect a $1.74 credit with a 62% probability of profit.",
  "strategy has a positive Theta and Delta, with a 62% probability of profit and a p50 of 77%. The maximum loss is the difference between the spread width and the credit collected. The focus is on the volatility impact, with a positive Vega indicating sensitivity to changing volatility.",
  "This strategy involves selling volatility on one leg and buying volatility on the other leg. The net Vega exposure is -3, with 13 Vegas short and 10 Vegas long. Being short three Vega results in negative volatility exposure. When the market rises, volatility typically decreases. It is important to strategically consider market movements when trading.",
  "When setting up a short put spread on Starbucks, you want the stock to rally due to a positive Delta. This typically leads to a decrease in implied volatility. Volatility is a key metric in trading, with some stocks seeing an increase in volatility as prices rise, and a decrease as prices fall.",
  "When the price decreases, volatility also decreases. Most individual stocks follow the overall market. Short put spreads capitalize on volatility contraction, which can occur alongside a rising market. This is beneficial for your short put spread.",
  "Consider implementing a short put spread strategy or an undefined risk strategy to capitalize on volatility contractions. Selling a 90 put can be a bullish alternative to explore.",
  "The bullish strategy is more aggressive than a short put spread, with a higher probability of making 50%. With short 10 Vega, there is more exposure to volatility contraction.",
  "If you have more Vega exposure, you may be at risk if Starbucks stock goes down. Selling puts from start to finish can be a viable trading strategy with its own set of pros and cons.",
  "guide to explore the various possibilities and strategies available in short volatility trading. The potential for success is high with positive drift and negative Vega working in your favor. Take advantage of the countless opportunities in the options market and consider different approaches to maximize your trading potential.",
  "There are endless short premium trades to explore and add to your portfolio. Consider playing a debit strategy for volatility spikes. Learn how to set these up on Tasty Trade. There are many other trading strategies to consider beyond this introduction.",
  "Let's set up a couple of long premium trades that would benefit from volatility expanding. Short put spreads and short puts are similar to long-term investing in the stock market. Let's explore some examples on the watch list.",
  "I'm going to sort my watch list by IV rank from low to high to find a low implied volatility opportunity for a debit strategy. The NASDAQ index (QQQ) has an IV rank of 27, making it a potential candidate.",
  "The study focused on short premium and selling premium strategies, but buying premium is also an opportunity due to low volatility. With VIX at 20 and VIX Futures just over 20, there are limited low volatility options. Consider an at-the-money put vertical strategy in QQQ to take advantage of volatility expansion.",
  "An at-the-money put vertical is a strategy for taking advantage of volatility expansion. For example, if you're bearish on the NASDAQ, you could buy a 490 put and sell a 480 put with the stock at 486. This is a directional shot with a probability of profit around 50%.",
  "take advantage of any increase in volatility. This can help offset any potential losses from a decrease in stock price.",
  "In the curve view, making money if QQQ goes down is a bearish trade that benefits from market volatility increasing. This setup allows for potential gains from both Delta and Vega.",
  "One way to set up a positive Vega volatility expanding trade is by using an equity index. Another strategy is to set up a calendar spread with QQ at 486-487 to be neutral on the NASDAQ index.",
  "want to play for volatility expansion on the NASDAQ index by using a calendar spread. I am buying the back month and selling the front month with overlapping strikes. For example, I may sell the 485 put in November with 41 days to go to minimize directional exposure.",
  "66 Vega at the 485 put in November. Open December and buy the same strike put. Cost is $4. Strategy provides positive volatility exposure. If volatility expands, market may go down more.",
  "This strategy involves adjusting strikes to trade volatility from both the short and long sides. If you're bullish on a stock, adjust strikes higher. If you're bearish, adjust strikes lower. That's the key to successful trading.",
  "If you're bearish on a stock, focus on the directional bias without getting into the details of how you arrived at that conclusion. Day-to-day movements are random, so use charts, balance sheets, or other tools to determine your own bias.",
  "If you have a directional bias in a stock and need guidance or reference points for your portfolio metrics, check out the portfolio management crash course on the YouTube channel."
]