[
  "position on I'm going to look at setting up a short put spread in the SPX so let's go ahead and take a look at that so I'm going to go ahead and sell the 3400 put and buy the 3395 put for a credit of around $1.50 so let's go ahead and take a look at that trade and see how it plays out.",
  "I already have a position in Nvidia, so I am looking to trade SMH, the semiconductor ETF. It has a 22% weighting in Nvidia, so a large portion of the ETF will be affected by Nvidia's earnings after the market closes today. This will also impact other semiconductor stocks in the ETF. The IV rank is 69, indicating high volatility. SMH is fairly liquid for trading.",
  "It's liquid enough to trade, with a 20 to 30 cent spread for a $200 stock. I want exposure to Nvidia earnings, so I'll do an iron Condor to sell premium and capture volatility. Looking for around a 20 Delta on the short options.",
  "a 20 Delta on the short options, with the put side at 220 and the call side at 275. I typically allocate 10 to 15 points wide for spreads, depending on risk tolerance. I will go $10 wide and expect the trade to be around onethird the width of the strikes.",
  "The trade is at $3.25, one-third the width of the strikes, with a total risk of $667 and a buying power of $660. There is a 57% probability of success when collecting 1/3 the width of the strikes, setting up a 50-60% probability of success. Short strikes are at 220 and 275.",
  "Our short strikes are at 275 and below, aiming for a delta neutral trade to take advantage of high implied volatility and upcoming binary events. Placed an SMH iron condor trade at 330.",
  "The SMH position has seen a V contraction and a bounce, resulting in a profit of about $150. I am looking to get out of some positions, focusing on the long options with bids.",
  "If the long option has no bid, it is considered worthless. Options with very low value are difficult to fill. All options in this context have value, but the wider mark may require price adjustments.",
  "We may need to adjust the price up, but all options have value. We aim to get filled at the mid price to free up capital. We closed out a trade at $183, up $147. Currently light on positions, looking to add a new one.",
  "light on positions today, looking to make a couple of trades. The recent drop in oil prices due to geopolitical events, including OPEC discussions on production cuts, has caught my attention. Oil has fallen from the high 70s to the 60s, a level not seen in 2024. Oil Futures are a significant contract to watch.",
  "The oil futures contract is large, with a multiplier of $1,000 per point. This provides significant leverage, requiring only $10,000 to trade. Options trading is a more suitable option for smaller accounts.",
  "I can trade options that are equivalent in notional value to Futures. For example, a $1 option is worth $1,000. A one-point wide spread is also worth $1,000. An 18 cent credit is equivalent to $10 per tick.",
  "$800 max loss with a potential credit of around 18 cents per tick, resulting in a value of $180 for this spread. The spread has a Delta of around 20. By adjusting the spread slightly, you can potentially increase the credit. The risk for selling at 20 cents is 80 cents.",
  "In Futures trading, there is a risk of 80 cents, which equals $800. The buying power effect is less than the initial loss due to span margin calculation. Span margin considers factors like days till expiration, volatility, and proximity to the strike price.",
  "The closer to at-the-money a spread is, the higher the buying power required due to its higher Delta. The risk and potential changes in buying power are limited to the maximum risk.",
  "When trading a spread in a Futures Contract, ensure you do not exceed your maximum risk parameters. Aim for a 30 Delta and collect around one-third of the width of the strikes, typically around $2 or 25-26 cents.",
  "We are looking to enter a credit spread trade with a 65 strike for the short and 64 strike for the long, 43 days out to the October 17th expiration. Starting at 26 cents, we will adjust to 25 cents to try to get filled. Currently, we are in at a 25 cent credit.",
  "We are in a 25 cent credit spread in oil, with a $250 credit and $750 risk. The market is performing well today, with e mini S&P 500 futures up 90 points, NASDAQ up 475, Dow and Russell up significantly. Oil is also up.",
  "We recently had a rate cut decision which caused volatility in the market. The market responded positively, so we need to close out some positions. These positions have been performing well and it's time to start managing them. When managing a portfolio, aim to buy at lower prices and sell at higher prices.",
  "market rally, it is advantageous to go long at lower prices and sell at higher prices. Short premium positions have limited profit potential, which diminishes as expiration approaches. It is important to capitalize on favorable market movements to maximize returns.",
  "are going to close out. We will also be reducing our risk exposure in other positions that have been performing well. This approach is essential in our trading strategy to secure profits and manage our portfolio effectively.",
  "We recently entered a Futures position in oil, which has seen a $2 rally since we entered at around $66-68. Our out-of-the-money put spread has gained long Delta as the stock has risen, so we will be adjusting to a short Delta position.",
  "Delta is decreasing as we exit our long position in oil Futures during an upward move. We aim to close the position for a $130 debit, resulting in a $120 profit.",
  "Currently, we have netted about $120 profit on this trade. Let's aim for $14 and see if we can get filled. We will try for 15 cents profit. We successfully closed the trade for a $100 profit in oil Futures. Looking at Nvidia, there has been two-sided action in the markets, particularly in the NASDAQ.",
  "NASDAQ is down 40 points, while E-mini futures are up 19 points, nearing the high of the last two sessions. There has been increased volatility in the markets. Nvidia has faced negative PR following earnings, opening inside the expected move and experiencing weakness in the market.",
  "The market showed weakness on Tuesday with Nvidia falling to 106. Consider taking a long Delta position with a diagonal spread trade. Aim for a 30 to 40 day short option and a 70-day long option expiration.",
  "I am looking to trade options with a 70-day expiration. Instead of a shorter-term spread, I am considering a November trade for more duration. I typically buy a 40 Delta option, such as the 115 strike.",
  "look to potentially hedge that by selling a 20 Delta option around the 120-125 strike in the October expiration. This will add a positive decay component and help reduce the cost of the trade. I aim to keep the costs around $500-$700 to align with my risk tolerance in this portfolio.",
  "sell the position for a profit. The potential profit is significant if the price returns to the 115 to 125 range. Using the analysis mode, we can simulate how the risk profile changes over time, even up to the October expiration.",
  "the October expiration, all of the premium will come out of this option as it expires on October 18th. If there is a rally, the extrinsic value will decay, capturing $2 of extrinsic value. This would leave only intrinsic value in the short option. While giving up some profit potential if the stock price significantly increases, I am not concerned about missing out on potential gains.",
  "I'm not worried about giving up the tail with the short option in exchange for positive Decay. We got filled on the diagonal spread, long the 115 in November and short the 125 in October expiration. Leans about 20 Deltas longish.",
  "We are 20 Deltas long in Nvidia amid a steep drop. Looking to profit $100 to $200 in the next few weeks. We bought the dip on the fourth and entered around 105.",
  "the market. The stock has moved significantly higher, making it a good time to consider a call diagonal spread. We were long the November 115 strike call and short the 125 call. In just two weeks, the option we sold at $240 has increased in value.",
  "We invested $240 in a short call during Nvidia's rally from 106 to almost 120 over two weeks. The call cost us about $160. If the stock had not gone up $14 in two weeks, the option would have hedged us some, depending on where the stock went.",
  "$2 depending on the stock movement. If it went lower, it would have hedged us to the downside, saving $200 in value. We played the upside with a lot of long Delta and positive gamma, which was ideal for this position. Instead of making $300 or $400, we are only making",
  "$300 profit on a $400 position, resulting in a 75% return on capital. In hindsight, missing out on potential profit was a possibility, but we can't predict the future. Stick to trading what is in front of us.",
  "We hedged the dip buying with a short premium position in the shorter duration. We got the bounce we wanted, time to take a big win. We aim for a $395 credit for a $300 profit. We got price improved for a $316 profit, taking off $2,000 in buying power.",
  "We booked some winners in the Johnny Trader portfolio, managing our capital and freeing up some to get into new opportunities next week. Tune in to Johnny trades every Wednesday to catch these trades live.",
  "Tune in to Johnny Trades every Wednesday at 9:40 a.m. on Tasty Live."
]